{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Accessing Neo4j DB from outside"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x7f8ab0d0eb50>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "remote_graph = Graph(\"http://ec2-52-56-99-123.eu-west-2.compute.amazonaws.com:7474/db/data/\", user='neo4j', password='graphtest')\n",
    "\n",
    "remote_graph\n",
    "\n",
    "cypher_query = \"MATCH (n:ARTICLE)-[r:CITES]->(k:ARTICLE) WHERE n.pmcid IN ['PMC3769458', 'PMC5890653', 'PMC4580396'] RETURN n, r, k;\"\n",
    "\n",
    "remote_graph.run(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "07/23/2018 09:41:34 PM [INFO]: Created new log.\n",
      "07/23/2018 09:41:35 PM [INFO]: RequestFullTextSearch: Creating request\n",
      "07/23/2018 09:41:35 PM [INFO]: ConnectEutils: Connecting to eutils API:\n",
      " https://eutils.ncbi.nlm.nih.gov/entrez/eutils/esearch.fcgi?db=pmc&tool=graphsearch&sort=relevance&term=tourigny&retmax=200\n",
      "07/23/2018 09:41:35 PM [INFO]: MongoSession: Mongo db connection successful\n",
      "07/23/2018 09:41:36 PM [INFO]: MongoSession: Mongo db connection successful\n",
      "07/23/2018 09:41:37 PM [INFO]: Max degree: 26\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "22\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'{\"graph\": {\"nodes\": [{\"data\": {\"node_col\": \"#ff7373\", \"journal\": \"Indian pacing and electrophysiology journal\", \"key\": \"20552060\", \"authors\": \"Udink Ten Cate, Wiesner, Trieschmann\", \"cite_color\": \"black\", \"id\": \"20552060\", \"group\": \"Cited\", \"name\": \"20552060\", \"pubDate\": \"Jun 2010\", \"title\": \"Dyssynchronous ventricular activation in asymptomatic wolff-Parkinson-white syndrome: a risk factor for development of dilated cardiomyopathy.\", \"label\": \"Indian pacing and electrophysiology journal\", \"journal_iso\": \"Indian Pacing Electrophysiol J\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Healthcare policy = Politiques de sante\", \"key\": \"23115575\", \"authors\": \"Breton, L\\\\u00e9vesque, Pineault\", \"cite_color\": \"black\", \"id\": \"23115575\", \"group\": \"Cited\", \"name\": \"23115575\", \"pubDate\": \"Nov 2011\", \"title\": \"Primary Care Reform: Can Quebec\\'s Family Medicine Group Model Benefit from the Experience of Ontario\\'s Family Health Teams?\", \"label\": \"Healthcare policy = Politiques de sante\", \"journal_iso\": \"Healthc Policy\"}}, {\"data\": {\"node_col\": \"#ff8484\", \"journal\": \"International journal of integrated care\", \"key\": \"18317561\", \"authors\": \"H\\\\u00e9bert, Dubois, Ra\\\\u00eeche\", \"cite_color\": \"black\", \"id\": \"18317561\", \"group\": \"Searched\", \"name\": \"18317561\", \"pubDate\": \"Feb 2008\", \"title\": \"The effectiveness of the PRISMA integrated service delivery network: preliminary report on methods and baseline data.\", \"label\": \"International journal of integrated care\", \"journal_iso\": \"Int J Integr Care\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"key\": \"15317937\", \"authors\": \"Blanchard, Kim, Gonzalez\", \"cite_color\": \"black\", \"id\": \"15317937\", \"group\": \"Cited\", \"name\": \"15317937\", \"pubDate\": \"Aug 2004\", \"title\": \"tRNA dynamics on the ribosome during translation.\", \"label\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"journal_iso\": \"Proc. Natl. Acad. Sci. U.S.A.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Circulation\", \"key\": \"1245032\", \"authors\": \"DeMaria, Vera, Neumann\", \"cite_color\": \"black\", \"id\": \"1245032\", \"group\": \"Cited\", \"name\": \"1245032\", \"pubDate\": \"Feb 1976\", \"title\": \"Alterations in ventricular contraction pattern in the Wolff-Parkinson-White syndrome. Detection by echocardiography.\", \"label\": \"Circulation\", \"journal_iso\": \"Circulation\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Statistics in medicine\", \"key\": \"24167024\", \"authors\": \"H\\\\u00e9roux, Moodie, Strumpf\", \"cite_color\": \"black\", \"id\": \"24167024\", \"group\": \"Cited\", \"name\": \"24167024\", \"pubDate\": \"Mar 2014\", \"title\": \"Marginal structural models for skewed outcomes: identifying causal relationships in health care utilization.\", \"label\": \"Statistics in medicine\", \"journal_iso\": \"Stat Med\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"International journal for quality in health care : journal of the International Society for Quality in Health Care\", \"key\": \"21672922\", \"authors\": \"Pirkle, Dumont, Zunzunegui\", \"cite_color\": \"black\", \"id\": \"21672922\", \"group\": \"Cited\", \"name\": \"21672922\", \"pubDate\": \"Aug 2011\", \"title\": \"Criterion-based clinical audit to assess quality of obstetrical care in low- and middle-income countries: a systematic review.\", \"label\": \"International journal for quality in health care : journal of the International Society for Quality in Health Care\", \"journal_iso\": \"Int J Qual Health Care\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"International journal of integrated care\", \"key\": \"23882166\", \"authors\": \"Dubuc, Bonin, Tourigny\", \"cite_color\": \"black\", \"id\": \"23882166\", \"group\": \"Searched\", \"name\": \"23882166\", \"pubDate\": \"Apr 2013\", \"title\": \"Development of integrated care pathways: toward a care management system to meet the needs of frail and disabled community-dwelling older people.\", \"label\": \"International journal of integrated care\", \"journal_iso\": \"Int J Integr Care\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Japanese circulation journal\", \"key\": \"9856605\", \"authors\": \"Yamanaka, Shirayama, Inoue\", \"cite_color\": \"black\", \"id\": \"9856605\", \"group\": \"Cited\", \"name\": \"9856605\", \"pubDate\": \"Nov 1998\", \"title\": \"Improved cardiac function after catheter ablation in a patient with type B Wolff-Parkinson-White syndrome with an old myocardial infarction.\", \"label\": \"Japanese circulation journal\", \"journal_iso\": \"Jpn. Circ. J.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"East African medical journal\", \"key\": \"7215271\", \"authors\": \"Bullough\", \"cite_color\": \"black\", \"id\": \"7215271\", \"group\": \"Cited\", \"name\": \"7215271\", \"pubDate\": \"Jan 1981\", \"title\": \"Analysis of maternal deaths in the Central Region of Malawi.\", \"label\": \"East African medical journal\", \"journal_iso\": \"East Afr Med J\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Immunity\", \"key\": \"12196289\", \"authors\": \"Tourigny, Ursini-Siegel, Lee\", \"cite_color\": \"black\", \"id\": \"12196289\", \"group\": \"Cited\", \"name\": \"12196289\", \"pubDate\": \"Aug 2002\", \"title\": \"CDK inhibitor p18(INK4c) is required for the generation of functional plasma cells.\", \"label\": \"Immunity\", \"journal_iso\": \"Immunity\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"European journal of immunology\", \"key\": \"2567243\", \"authors\": \"Nikoli\\\\u0107-Zugi\\\\u0107, Moore, Bevan\", \"cite_color\": \"black\", \"id\": \"2567243\", \"group\": \"Cited\", \"name\": \"2567243\", \"pubDate\": \"Apr 1989\", \"title\": \"Characterization of the subset of immature thymocytes which can undergo rapid in vitro differentiation.\", \"label\": \"European journal of immunology\", \"journal_iso\": \"Eur. J. Immunol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Multivariate behavioral research\", \"key\": \"21818162\", \"authors\": \"Austin\", \"cite_color\": \"black\", \"id\": \"21818162\", \"group\": \"Cited\", \"name\": \"21818162\", \"pubDate\": \"May 2011\", \"title\": \"An Introduction to Propensity Score Methods for Reducing the Effects of Confounding in Observational Studies.\", \"label\": \"Multivariate behavioral research\", \"journal_iso\": \"Multivariate Behav Res\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"The Gerontologist\", \"key\": \"7622088\", \"authors\": \"Branch, Coulam, Zimmerman\", \"cite_color\": \"black\", \"id\": \"7622088\", \"group\": \"Cited\", \"name\": \"7622088\", \"pubDate\": \"Jun 1995\", \"title\": \"The PACE evaluation: initial findings.\", \"label\": \"The Gerontologist\", \"journal_iso\": \"Gerontologist\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"European journal of immunology\", \"key\": \"2148525\", \"authors\": \"Petrie, Pearse, Scollay\", \"cite_color\": \"black\", \"id\": \"2148525\", \"group\": \"Cited\", \"name\": \"2148525\", \"pubDate\": \"Dec 1990\", \"title\": \"Development of immature thymocytes: initiation of CD3, CD4, and CD8 acquisition parallels down-regulation of the interleukin 2 receptor alpha chain.\", \"label\": \"European journal of immunology\", \"journal_iso\": \"Eur. J. Immunol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Maternal and child health journal\", \"key\": \"20697934\", \"authors\": \"Pirkle, Fournier, Tourigny\", \"cite_color\": \"black\", \"id\": \"20697934\", \"group\": \"Cited\", \"name\": \"20697934\", \"pubDate\": \"Oct 2011\", \"title\": \"Emergency obstetrical complications in a rural African setting (Kayes, Mali): the link between travel time and in-hospital maternal mortality.\", \"label\": \"Maternal and child health journal\", \"journal_iso\": \"Matern Child Health J\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"Acta obstetricia et gynecologica Scandinavica\", \"key\": \"11167204\", \"authors\": \"Bouvier-Colle, Ouedraogo, Dumont\", \"cite_color\": \"black\", \"id\": \"11167204\", \"group\": \"Cited\", \"name\": \"11167204\", \"pubDate\": \"Feb 2001\", \"title\": \"Maternal mortality in West Africa. Rates, causes and substandard care from a prospective survey.\", \"label\": \"Acta obstetricia et gynecologica Scandinavica\", \"journal_iso\": \"Acta Obstet Gynecol Scand\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Heart rhythm\", \"key\": \"18774110\", \"authors\": \"Cadrin-Tourigny, Fournier, Andelfinger\", \"cite_color\": \"black\", \"id\": \"18774110\", \"group\": \"Cited\", \"name\": \"18774110\", \"pubDate\": \"Sep 2008\", \"title\": \"Severe left ventricular dysfunction in infants with ventricular preexcitation.\", \"label\": \"Heart rhythm\", \"journal_iso\": \"Heart Rhythm\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of electrocardiology\", \"key\": \"19879594\", \"authors\": \"Udink ten Cate, Kruessell, Wagner\", \"cite_color\": \"black\", \"id\": \"19879594\", \"group\": \"Cited\", \"name\": \"19879594\", \"pubDate\": \" \", \"title\": \"Dilated cardiomyopathy in children with ventricular preexcitation: the location of the accessory pathway is predictive of this association.\", \"label\": \"Journal of electrocardiology\", \"journal_iso\": \"J Electrocardiol\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Canadian family physician Medecin de famille canadien\", \"key\": \"20631263\", \"authors\": \"Tourigny, Aubin, Haggerty\", \"cite_color\": \"black\", \"id\": \"20631263\", \"group\": \"Cited\", \"name\": \"20631263\", \"pubDate\": \"Jul 2010\", \"title\": \"Patients\\' perceptions of the quality of care after primary care reform: Family medicine groups in Quebec.\", \"label\": \"Canadian family physician Medecin de famille canadien\", \"journal_iso\": \"Can Fam Physician\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Circulation\", \"key\": \"15583083\", \"authors\": \"Thambo, Bordachar, Garrigue\", \"cite_color\": \"black\", \"id\": \"15583083\", \"group\": \"Cited\", \"name\": \"15583083\", \"pubDate\": \"Dec 2004\", \"title\": \"Detrimental ventricular remodeling in patients with congenital complete heart block and chronic right ventricular apical pacing.\", \"label\": \"Circulation\", \"journal_iso\": \"Circulation\"}}, {\"data\": {\"node_col\": \"#ffb1b1\", \"journal\": \"BMC pregnancy and childbirth\", \"key\": \"23351269\", \"authors\": \"Pirkle, Dumont, Traor\\\\u00e9\", \"cite_color\": \"black\", \"id\": \"23351269\", \"group\": \"Searched\", \"name\": \"23351269\", \"pubDate\": \"Jan 2013\", \"title\": \"Effect of a facility-based multifaceted intervention on the quality of obstetrical care: a cluster randomized controlled trial in Mali and Senegal.\", \"label\": \"BMC pregnancy and childbirth\", \"journal_iso\": \"BMC Pregnancy Childbirth\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"International journal for equity in health\", \"key\": \"22931249\", \"authors\": \"El-Khoury, Hatt, Gandaho\", \"cite_color\": \"black\", \"id\": \"22931249\", \"group\": \"Cited\", \"name\": \"22931249\", \"pubDate\": \"Aug 2012\", \"title\": \"User fee exemptions and equity in access to caesarean sections: an analysis of patient survey data in Mali.\", \"label\": \"International journal for equity in health\", \"journal_iso\": \"Int J Equity Health\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Circulation\", \"key\": \"181165\", \"authors\": \"Francis, Theroux, O\\'Rourke\", \"cite_color\": \"black\", \"id\": \"181165\", \"group\": \"Cited\", \"name\": \"181165\", \"pubDate\": \"Aug 1976\", \"title\": \"An echocardiographic study of interventricular septal motion in the Wolff-Parkinson-White syndrome.\", \"label\": \"Circulation\", \"journal_iso\": \"Circulation\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"The Gerontologist\", \"key\": \"3928449\", \"authors\": \"Yordi, Waldman\", \"cite_color\": \"black\", \"id\": \"3928449\", \"group\": \"Cited\", \"name\": \"3928449\", \"pubDate\": \"Aug 1985\", \"title\": \"A consolidated model of long-term care: service utilization and cost impacts.\", \"label\": \"The Gerontologist\", \"journal_iso\": \"Gerontologist\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"JAMA\", \"key\": \"25490331\", \"authors\": \"Dimick, Ryan\", \"cite_color\": \"black\", \"id\": \"25490331\", \"group\": \"Cited\", \"name\": \"25490331\", \"pubDate\": \"Dec 2014\", \"title\": \"Methods for evaluating changes in health care policy: the difference-in-differences approach.\", \"label\": \"JAMA\", \"journal_iso\": \"JAMA\"}}, {\"data\": {\"node_col\": \"#ff9696\", \"journal\": \"BMC pregnancy and childbirth\", \"key\": \"25129069\", \"authors\": \"Merali, Lipsitz, Hevelone\", \"cite_color\": \"black\", \"id\": \"25129069\", \"group\": \"Searched\", \"name\": \"25129069\", \"pubDate\": \"Aug 2014\", \"title\": \"Audit-identified avoidable factors in maternal and perinatal deaths in low resource settings: a systematic review.\", \"label\": \"BMC pregnancy and childbirth\", \"journal_iso\": \"BMC Pregnancy Childbirth\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Nature methods\", \"key\": \"24213166\", \"authors\": \"Kucukelbir, Sigworth, Tagare\", \"cite_color\": \"black\", \"id\": \"24213166\", \"group\": \"Cited\", \"name\": \"24213166\", \"pubDate\": \"Jan 2014\", \"title\": \"Quantifying the local resolution of cryo-EM density maps.\", \"label\": \"Nature methods\", \"journal_iso\": \"Nat. Methods\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Science (New York, N.Y.)\", \"key\": \"19833919\", \"authors\": \"Gao, Selmer, Dunham\", \"cite_color\": \"black\", \"id\": \"19833919\", \"group\": \"Cited\", \"name\": \"19833919\", \"pubDate\": \"Oct 2009\", \"title\": \"The structure of the ribosome with elongation factor G trapped in the posttranslocational state.\", \"label\": \"Science (New York, N.Y.)\", \"journal_iso\": \"Science\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Sante (Montrouge, France)\", \"key\": \"7894830\", \"authors\": \"Vangeenderhuysen, Banos, Mahaman\", \"cite_color\": \"black\", \"id\": \"7894830\", \"group\": \"Cited\", \"name\": \"7894830\", \"pubDate\": \" \", \"title\": \"[Preventable maternal mortality in an urban area in Niamey (Niger)].\", \"label\": \"Sante (Montrouge, France)\", \"journal_iso\": \"Sante\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Cardiology in the young\", \"key\": \"15679994\", \"authors\": \"Emmel, Balaji, Sreeram\", \"cite_color\": \"black\", \"id\": \"15679994\", \"group\": \"Cited\", \"name\": \"15679994\", \"pubDate\": \"Dec 2004\", \"title\": \"Ventricular preexcitation associated with dilated cardiomyopathy: a causal relationship?\", \"label\": \"Cardiology in the young\", \"journal_iso\": \"Cardiol Young\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"Acta crystallographica. Section D, Biological crystallography\", \"key\": \"20383002\", \"authors\": \"Emsley, Lohkamp, Scott\", \"cite_color\": \"black\", \"id\": \"20383002\", \"group\": \"Cited\", \"name\": \"20383002\", \"pubDate\": \"Apr 2010\", \"title\": \"Features and development of Coot.\", \"label\": \"Acta crystallographica. Section D, Biological crystallography\", \"journal_iso\": \"Acta Crystallogr. D Biol. Crystallogr.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"The Milbank quarterly\", \"key\": \"21676023\", \"authors\": \"Hutchison, Levesque, Strumpf\", \"cite_color\": \"black\", \"id\": \"21676023\", \"group\": \"Cited\", \"name\": \"21676023\", \"pubDate\": \"Jun 2011\", \"title\": \"Primary health care in Canada: systems in motion.\", \"label\": \"The Milbank quarterly\", \"journal_iso\": \"Milbank Q\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"International journal of cardiology\", \"key\": \"17292982\", \"authors\": \"Fazio, Mongiovi\\', Sutera\", \"cite_color\": \"black\", \"id\": \"17292982\", \"group\": \"Cited\", \"name\": \"17292982\", \"pubDate\": \"Jan 2008\", \"title\": \"Segmental dyskinesia in Wolff-Parkinson-White syndrome: a possible cause of dilatative cardiomyopathy.\", \"label\": \"International journal of cardiology\", \"journal_iso\": \"Int. J. Cardiol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Acta crystallographica. Section D, Biological crystallography\", \"key\": \"15299926\", \"authors\": \"Murshudov, Vagin, Dodson\", \"cite_color\": \"black\", \"id\": \"15299926\", \"group\": \"Cited\", \"name\": \"15299926\", \"pubDate\": \"May 1997\", \"title\": \"Refinement of macromolecular structures by the maximum-likelihood method.\", \"label\": \"Acta crystallographica. Section D, Biological crystallography\", \"journal_iso\": \"Acta Crystallogr. D Biol. Crystallogr.\"}}, {\"data\": {\"node_col\": \"#ffa8a8\", \"journal\": \"Maternal and child health journal\", \"key\": \"25874875\", \"authors\": \"Ravit, Philibert, Tourigny\", \"cite_color\": \"black\", \"id\": \"25874875\", \"group\": \"Searched\", \"name\": \"25874875\", \"pubDate\": \"Aug 2015\", \"title\": \"The Hidden Costs of a Free Caesarean Section Policy in West Africa (Kayes Region, Mali).\", \"label\": \"Maternal and child health journal\", \"journal_iso\": \"Matern Child Health J\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Genes & development\", \"key\": \"8608942\", \"authors\": \"Hoffman, Passoni, Crompton\", \"cite_color\": \"black\", \"id\": \"8608942\", \"group\": \"Cited\", \"name\": \"8608942\", \"pubDate\": \"Apr 1996\", \"title\": \"Productive T-cell receptor beta-chain gene rearrangement: coincident regulation of cell cycle and clonality during development in vivo.\", \"label\": \"Genes & development\", \"journal_iso\": \"Genes Dev.\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"Reproductive health\", \"key\": \"21569276\", \"authors\": \"Dogba, Fournier, Dumont\", \"cite_color\": \"black\", \"id\": \"21569276\", \"group\": \"Searched\", \"name\": \"21569276\", \"pubDate\": \"May 2011\", \"title\": \"Mother and newborn survival according to point of entry and type of human resources in a maternal referral system in Kayes (Mali).\", \"label\": \"Reproductive health\", \"journal_iso\": \"Reprod Health\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"key\": \"11687653\", \"authors\": \"Thompson, Gulyas, Sarnow\", \"cite_color\": \"black\", \"id\": \"11687653\", \"group\": \"Cited\", \"name\": \"11687653\", \"pubDate\": \"Nov 2001\", \"title\": \"Internal initiation in Saccharomyces cerevisiae mediated by an initiator tRNA/eIF2-independent internal ribosome entry site element.\", \"label\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"journal_iso\": \"Proc. Natl. Acad. Sci. U.S.A.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"JAMA\", \"key\": \"12365965\", \"authors\": \"Bodenheimer, Wagner, Grumbach\", \"cite_color\": \"black\", \"id\": \"12365965\", \"group\": \"Cited\", \"name\": \"12365965\", \"pubDate\": \"Oct 2002\", \"title\": \"Improving primary care for patients with chronic illness.\", \"label\": \"JAMA\", \"journal_iso\": \"JAMA\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"International journal of geriatric psychiatry\", \"key\": \"12642892\", \"authors\": \"Johri, Beland, Bergman\", \"cite_color\": \"black\", \"id\": \"12642892\", \"group\": \"Cited\", \"name\": \"12642892\", \"pubDate\": \"Mar 2003\", \"title\": \"International experiments in integrated care for the elderly: a synthesis of the evidence.\", \"label\": \"International journal of geriatric psychiatry\", \"journal_iso\": \"Int J Geriatr Psychiatry\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of cardiovascular electrophysiology\", \"key\": \"19804548\", \"authors\": \"Kwon, Bae, Kim\", \"cite_color\": \"black\", \"id\": \"19804548\", \"group\": \"Cited\", \"name\": \"19804548\", \"pubDate\": \"Mar 2010\", \"title\": \"Septal dyskinesia and global left ventricular dysfunction in pediatric Wolff-Parkinson-White syndrome with septal accessory pathway.\", \"label\": \"Journal of cardiovascular electrophysiology\", \"journal_iso\": \"J. Cardiovasc. Electrophysiol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of structural biology\", \"key\": \"12781660\", \"authors\": \"Mindell, Grigorieff\", \"cite_color\": \"black\", \"id\": \"12781660\", \"group\": \"Cited\", \"name\": \"12781660\", \"pubDate\": \"Jun 2003\", \"title\": \"Accurate determination of local defocus and specimen tilt in electron microscopy.\", \"label\": \"Journal of structural biology\", \"journal_iso\": \"J. Struct. Biol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Lancet (London, England)\", \"key\": \"20382417\", \"authors\": \"Hogan, Foreman, Naghavi\", \"cite_color\": \"black\", \"id\": \"20382417\", \"group\": \"Cited\", \"name\": \"20382417\", \"pubDate\": \"May 2010\", \"title\": \"Maternal mortality for 181 countries, 1980-2008: a systematic analysis of progress towards Millennium Development Goal 5.\", \"label\": \"Lancet (London, England)\", \"journal_iso\": \"Lancet\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Age and ageing\", \"key\": \"2976575\", \"authors\": \"Hebert, Carrier, Bilodeau\", \"cite_color\": \"black\", \"id\": \"2976575\", \"group\": \"Cited\", \"name\": \"2976575\", \"pubDate\": \"Sep 1988\", \"title\": \"The Functional Autonomy Measurement System (SMAF): description and validation of an instrument for the measurement of handicaps.\", \"label\": \"Age and ageing\", \"journal_iso\": \"Age Ageing\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Health policy and planning\", \"key\": \"10141624\", \"authors\": \"Mbaruku, Bergstr\\\\u00f6m\", \"cite_color\": \"black\", \"id\": \"10141624\", \"group\": \"Cited\", \"name\": \"10141624\", \"pubDate\": \"Mar 1995\", \"title\": \"Reducing maternal mortality in Kigoma, Tanzania.\", \"label\": \"Health policy and planning\", \"journal_iso\": \"Health Policy Plan\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"key\": \"21245352\", \"authors\": \"Zhu, Korostelev, Costantino\", \"cite_color\": \"black\", \"id\": \"21245352\", \"group\": \"Cited\", \"name\": \"21245352\", \"pubDate\": \"Feb 2011\", \"title\": \"Crystal structures of complexes containing domains from two viral internal ribosome entry site (IRES) RNAs bound to the 70S ribosome.\", \"label\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"journal_iso\": \"Proc. Natl. Acad. Sci. U.S.A.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"BJOG : an international journal of obstetrics and gynaecology\", \"key\": \"16101606\", \"authors\": \"Dumont, Gaye, Mah\\\\u00e9\", \"cite_color\": \"black\", \"id\": \"16101606\", \"group\": \"Cited\", \"name\": \"16101606\", \"pubDate\": \"Sep 2005\", \"title\": \"Emergency obstetric care in developing countries: impact of guidelines implementation in a community hospital in Senegal.\", \"label\": \"BJOG : an international journal of obstetrics and gynaecology\", \"journal_iso\": \"BJOG\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"Lancet (London, England)\", \"key\": \"17011946\", \"authors\": \"Ronsmans, Graham, \", \"cite_color\": \"black\", \"id\": \"17011946\", \"group\": \"Cited\", \"name\": \"17011946\", \"pubDate\": \"Sep 2006\", \"title\": \"Maternal mortality: who, when, where, and why.\", \"label\": \"Lancet (London, England)\", \"journal_iso\": \"Lancet\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of structural biology\", \"key\": \"23000701\", \"authors\": \"Scheres\", \"cite_color\": \"black\", \"id\": \"23000701\", \"group\": \"Cited\", \"name\": \"23000701\", \"pubDate\": \"Dec 2012\", \"title\": \"RELION: implementation of a Bayesian approach to cryo-EM structure determination.\", \"label\": \"Journal of structural biology\", \"journal_iso\": \"J. Struct. Biol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Annals of internal medicine\", \"key\": \"19805769\", \"authors\": \"Friedberg, Coltin, Safran\", \"cite_color\": \"black\", \"id\": \"19805769\", \"group\": \"Cited\", \"name\": \"19805769\", \"pubDate\": \"Oct 2009\", \"title\": \"Associations between structural capabilities of primary care practices and performance on selected quality measures.\", \"label\": \"Annals of internal medicine\", \"journal_iso\": \"Ann. Intern. Med.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of molecular biology\", \"key\": \"12470947\", \"authors\": \"Jan, Sarnow\", \"cite_color\": \"black\", \"id\": \"12470947\", \"group\": \"Cited\", \"name\": \"12470947\", \"pubDate\": \"Dec 2002\", \"title\": \"Factorless ribosome assembly on the internal ribosome entry site of cricket paralysis virus.\", \"label\": \"Journal of molecular biology\", \"journal_iso\": \"J. Mol. Biol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of nursing measurement\", \"key\": \"17278339\", \"authors\": \"Gagnon, H\\\\u00e9bert, Dub\\\\u00e9\", \"cite_color\": \"black\", \"id\": \"17278339\", \"group\": \"Cited\", \"name\": \"17278339\", \"pubDate\": \" 2006\", \"title\": \"Development and validation of the Health Care Satisfaction Questionnaire (HCSQ) in elders.\", \"label\": \"Journal of nursing measurement\", \"journal_iso\": \"J Nurs Meas\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Lancet (London, England)\", \"key\": \"18406864\", \"authors\": \", Bradshaw, Chopra\", \"cite_color\": \"black\", \"id\": \"18406864\", \"group\": \"Cited\", \"name\": \"18406864\", \"pubDate\": \"Apr 2008\", \"title\": \"Every death counts: use of mortality audit data for decision making to save the lives of mothers, babies, and children in South Africa.\", \"label\": \"Lancet (London, England)\", \"journal_iso\": \"Lancet\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"Canadian journal on aging = La revue canadienne du vieillissement\", \"key\": \"15660297\", \"authors\": \"Tourigny, Durand, Bonin\", \"cite_color\": \"black\", \"id\": \"15660297\", \"group\": \"Cited\", \"name\": \"15660297\", \"pubDate\": \" 2004\", \"title\": \"Quasi-experimental study of the effectiveness of an integrated service delivery network for the frail elderly.\", \"label\": \"Canadian journal on aging = La revue canadienne du vieillissement\", \"journal_iso\": \"Can J Aging\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Psychological methods\", \"key\": \"21767021\", \"authors\": \"Bollen, Bauldry\", \"cite_color\": \"black\", \"id\": \"21767021\", \"group\": \"Cited\", \"name\": \"21767021\", \"pubDate\": \"Sep 2011\", \"title\": \"Three Cs in measurement models: causal indicators, composite indicators, and covariates.\", \"label\": \"Psychological methods\", \"journal_iso\": \"Psychol Methods\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Health policy and planning\", \"key\": \"14654514\", \"authors\": \"Borghi, Hanson, Acquah\", \"cite_color\": \"black\", \"id\": \"14654514\", \"group\": \"Cited\", \"name\": \"14654514\", \"pubDate\": \"Dec 2003\", \"title\": \"Costs of near-miss obstetric complications for women and their families in Benin and Ghana.\", \"label\": \"Health policy and planning\", \"journal_iso\": \"Health Policy Plan\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Bulletin of the World Health Organization\", \"key\": \"16583081\", \"authors\": \"Dumont, Gaye, de Bernis\", \"cite_color\": \"black\", \"id\": \"16583081\", \"group\": \"Cited\", \"name\": \"16583081\", \"pubDate\": \"Mar 2006\", \"title\": \"Facility-based maternal death reviews: effects on maternal mortality in a district hospital in Senegal.\", \"label\": \"Bulletin of the World Health Organization\", \"journal_iso\": \"Bull. World Health Organ.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Annals of family medicine\", \"key\": \"25384820\", \"authors\": \"Tousignant, Diop, Fournier\", \"cite_color\": \"black\", \"id\": \"25384820\", \"group\": \"Cited\", \"name\": \"25384820\", \"pubDate\": \" \", \"title\": \"Validation of 2 new measures of continuity of care based on year-to-year follow-up with known providers of health care.\", \"label\": \"Annals of family medicine\", \"journal_iso\": \"Ann Fam Med\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"key\": \"14673072\", \"authors\": \"Jan, Kinzy, Sarnow\", \"cite_color\": \"black\", \"id\": \"14673072\", \"group\": \"Cited\", \"name\": \"14673072\", \"pubDate\": \"Dec 2003\", \"title\": \"Divergent tRNA-like element supports initiation, elongation, and termination of protein biosynthesis.\", \"label\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"journal_iso\": \"Proc. Natl. Acad. Sci. U.S.A.\"}}, {\"data\": {\"node_col\": \"#ff7c7c\", \"journal\": \"International journal of chronic diseases\", \"key\": \"27144222\", \"authors\": \"Pineault, Borg\\\\u00e8s Da Silva, Provost\", \"cite_color\": \"black\", \"id\": \"27144222\", \"group\": \"Searched\", \"name\": \"27144222\", \"pubDate\": \" 2016\", \"title\": \"Evolution of Experience of Care of Patients with and without Chronic Diseases following a Qu\\\\u00e9bec Primary Healthcare Reform.\", \"label\": \"International journal of chronic diseases\", \"journal_iso\": \"Int J Chronic Dis\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Nature reviews. Molecular cell biology\", \"key\": \"20094052\", \"authors\": \"Jackson, Hellen, Pestova\", \"cite_color\": \"black\", \"id\": \"20094052\", \"group\": \"Cited\", \"name\": \"20094052\", \"pubDate\": \"Feb 2010\", \"title\": \"The mechanism of eukaryotic translation initiation and principles of its regulation.\", \"label\": \"Nature reviews. Molecular cell biology\", \"journal_iso\": \"Nat. Rev. Mol. Cell Biol.\"}}, {\"data\": {\"node_col\": \"#ffa8a8\", \"journal\": \"International journal of integrated care\", \"key\": \"16896376\", \"authors\": \"H\\\\u00e9bert, Durand, Dubuc\", \"cite_color\": \"black\", \"id\": \"16896376\", \"group\": \"Searched\", \"name\": \"16896376\", \"pubDate\": \" 2003\", \"title\": \"PRISMA: a new model of integrated service delivery for the frail older people in Canada.\", \"label\": \"International journal of integrated care\", \"journal_iso\": \"Int J Integr Care\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Cell\", \"key\": \"10966112\", \"authors\": \"Wilson, Pestova, Hellen\", \"cite_color\": \"black\", \"id\": \"10966112\", \"group\": \"Cited\", \"name\": \"10966112\", \"pubDate\": \"Aug 2000\", \"title\": \"Initiation of protein synthesis from the A site of the ribosome.\", \"label\": \"Cell\", \"journal_iso\": \"Cell\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"American journal of public health\", \"key\": \"20724689\", \"authors\": \"Richard, Witter, de Brouwere\", \"cite_color\": \"black\", \"id\": \"20724689\", \"group\": \"Cited\", \"name\": \"20724689\", \"pubDate\": \"Oct 2010\", \"title\": \"Innovative approaches to reducing financial barriers to obstetric care in low-income countries.\", \"label\": \"American journal of public health\", \"journal_iso\": \"Am J Public Health\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Cell\", \"key\": \"15315759\", \"authors\": \"Spahn, Jan, Mulder\", \"cite_color\": \"black\", \"id\": \"15315759\", \"group\": \"Cited\", \"name\": \"15315759\", \"pubDate\": \"Aug 2004\", \"title\": \"Cryo-EM visualization of a viral internal ribosome entry site bound to human ribosomes: the IRES functions as an RNA-based translation factor.\", \"label\": \"Cell\", \"journal_iso\": \"Cell\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"CMAJ : Canadian Medical Association journal = journal de l\\'Association medicale canadienne\", \"key\": \"9347783\", \"authors\": \"Bergman, B\\\\u00e9land, Lebel\", \"cite_color\": \"black\", \"id\": \"9347783\", \"group\": \"Cited\", \"name\": \"9347783\", \"pubDate\": \"Oct 1997\", \"title\": \"Care for Canada\\'s frail elderly population: fragmentation or integration?\", \"label\": \"CMAJ : Canadian Medical Association journal = journal de l\\'Association medicale canadienne\", \"journal_iso\": \"CMAJ\"}}, {\"data\": {\"node_col\": \"#ffc2c2\", \"journal\": \"Cell division\", \"key\": \"17295909\", \"authors\": \"Myatt, Lam\", \"cite_color\": \"black\", \"id\": \"17295909\", \"group\": \"Searched\", \"name\": \"17295909\", \"pubDate\": \"Feb 2007\", \"title\": \"Promiscuous and lineage-specific roles of cell cycle regulators in haematopoiesis.\", \"label\": \"Cell division\", \"journal_iso\": \"Cell Div\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Bulletin of the World Health Organization\", \"key\": \"19197402\", \"authors\": \"Fournier, Dumont, Tourigny\", \"cite_color\": \"black\", \"id\": \"19197402\", \"group\": \"Cited\", \"name\": \"19197402\", \"pubDate\": \"Jan 2009\", \"title\": \"Improved access to comprehensive emergency obstetric care and its effect on institutional maternal mortality in rural Mali.\", \"label\": \"Bulletin of the World Health Organization\", \"journal_iso\": \"Bull. World Health Organ.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"RNA (New York, N.Y.)\", \"key\": \"11233983\", \"authors\": \"Kanamori, Nakashima\", \"cite_color\": \"black\", \"id\": \"11233983\", \"group\": \"Cited\", \"name\": \"11233983\", \"pubDate\": \"Feb 2001\", \"title\": \"A tertiary structure model of the internal ribosome entry site (IRES) for methionine-independent initiation of translation.\", \"label\": \"RNA (New York, N.Y.)\", \"journal_iso\": \"RNA\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of structural biology\", \"key\": \"16859925\", \"authors\": \"Tang, Peng, Baldwin\", \"cite_color\": \"black\", \"id\": \"16859925\", \"group\": \"Cited\", \"name\": \"16859925\", \"pubDate\": \"Jan 2007\", \"title\": \"EMAN2: an extensible image processing suite for electron microscopy.\", \"label\": \"Journal of structural biology\", \"journal_iso\": \"J. Struct. Biol.\"}}, {\"data\": {\"node_col\": \"#ffc2c2\", \"journal\": \"Cell division\", \"key\": \"17049078\", \"authors\": \"Dib, Peterson, Raducha-Grace\", \"cite_color\": \"black\", \"id\": \"17049078\", \"group\": \"Searched\", \"name\": \"17049078\", \"pubDate\": \"Oct 2006\", \"title\": \"Paradoxical expression of INK4c in proliferative multiple myeloma tumors: bi-allelic deletion vs increased expression.\", \"label\": \"Cell division\", \"journal_iso\": \"Cell Div\"}}, {\"data\": {\"node_col\": \"#ff9696\", \"journal\": \"PloS one\", \"key\": \"25137072\", \"authors\": \"Fournier, Dumont, Tourigny\", \"cite_color\": \"black\", \"id\": \"25137072\", \"group\": \"Searched\", \"name\": \"25137072\", \"pubDate\": \" 2014\", \"title\": \"The free caesareans policy in low-income settings: an interrupted time series analysis in Mali (2003-2012).\", \"label\": \"PloS one\", \"journal_iso\": \"PLoS ONE\"}}, {\"data\": {\"node_col\": \"#ffb1b1\", \"journal\": \"BMC immunology\", \"key\": \"12241558\", \"authors\": \"Su, Manley\", \"cite_color\": \"black\", \"id\": \"12241558\", \"group\": \"Searched\", \"name\": \"12241558\", \"pubDate\": \"Sep 2002\", \"title\": \"Stage-specific changes in fetal thymocyte proliferation during the CD4-8- to CD4+8+ transition in wild type, Rag1-/-, and Hoxa3,Pax1 mutant mice.\", \"label\": \"BMC immunology\", \"journal_iso\": \"BMC Immunol.\"}}, {\"data\": {\"node_col\": \"#fdd\", \"journal\": \"The Journal of experimental medicine\", \"key\": \"11015437\", \"authors\": \"Do, Hatada, Lee\", \"cite_color\": \"black\", \"id\": \"11015437\", \"group\": \"Searched\", \"name\": \"11015437\", \"pubDate\": \"Oct 2000\", \"title\": \"Attenuation of apoptosis underlies B lymphocyte stimulator enhancement of humoral immune response.\", \"label\": \"The Journal of experimental medicine\", \"journal_iso\": \"J. Exp. Med.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Studies in family planning\", \"key\": \"16570729\", \"authors\": \"Stanton, Holtz\", \"cite_color\": \"black\", \"id\": \"16570729\", \"group\": \"Cited\", \"name\": \"16570729\", \"pubDate\": \"Mar 2006\", \"title\": \"Levels and trends in cesarean birth in the developing world.\", \"label\": \"Studies in family planning\", \"journal_iso\": \"Stud Fam Plann\"}}, {\"data\": {\"node_col\": \"#f00\", \"journal\": \"eLife\", \"key\": \"27159451\", \"authors\": \"Murray, Savva, Shin\", \"cite_color\": \"black\", \"id\": \"27159451\", \"group\": \"Searched\", \"name\": \"27159451\", \"pubDate\": \"May 2016\", \"title\": \"Structural characterization of ribosome recruitment and translocation by type IV IRES.\", \"label\": \"eLife\", \"journal_iso\": \"Elife\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Genes & development\", \"key\": \"9744866\", \"authors\": \"Franklin, Godfrey, Lee\", \"cite_color\": \"black\", \"id\": \"9744866\", \"group\": \"Cited\", \"name\": \"9744866\", \"pubDate\": \"Sep 1998\", \"title\": \"CDK inhibitors p18(INK4c) and p27(Kip1) mediate two separate pathways to collaboratively suppress pituitary tumorigenesis.\", \"label\": \"Genes & development\", \"journal_iso\": \"Genes Dev.\"}}, {\"data\": {\"node_col\": \"#f00\", \"journal\": \"Cell\", \"key\": \"24792965\", \"authors\": \"Fern\\\\u00e1ndez, Bai, Murshudov\", \"cite_color\": \"black\", \"id\": \"24792965\", \"group\": \"Cited\", \"name\": \"24792965\", \"pubDate\": \"May 2014\", \"title\": \"Initiation of translation by cricket paralysis virus IRES requires its translocation in the ribosome.\", \"label\": \"Cell\", \"journal_iso\": \"Cell\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Molecular cell\", \"key\": \"18951087\", \"authors\": \"Agirrezabala, Lei, Brunelle\", \"cite_color\": \"black\", \"id\": \"18951087\", \"group\": \"Cited\", \"name\": \"18951087\", \"pubDate\": \"Oct 2008\", \"title\": \"Visualization of the hybrid state of tRNA binding promoted by spontaneous ratcheting of the ribosome.\", \"label\": \"Molecular cell\", \"journal_iso\": \"Mol. Cell\"}}, {\"data\": {\"node_col\": \"#ff7373\", \"journal\": \"Korean circulation journal\", \"key\": \"23323117\", \"authors\": \"Ko\", \"cite_color\": \"black\", \"id\": \"23323117\", \"group\": \"Searched\", \"name\": \"23323117\", \"pubDate\": \"Dec 2012\", \"title\": \"Left ventricular dysfunction and dilated cardiomyopathy in infants and children with wolff-Parkinson-white syndrome in the absence of tachyarrhythmias.\", \"label\": \"Korean circulation journal\", \"journal_iso\": \"Korean Circ J\"}}, {\"data\": {\"node_col\": \"#ffc2c2\", \"journal\": \"Lancet (London, England)\", \"key\": \"17027735\", \"authors\": \"Campbell, Graham, \", \"cite_color\": \"black\", \"id\": \"17027735\", \"group\": \"Cited\", \"name\": \"17027735\", \"pubDate\": \"Oct 2006\", \"title\": \"Strategies for reducing maternal mortality: getting on with what works.\", \"label\": \"Lancet (London, England)\", \"journal_iso\": \"Lancet\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"The Milbank quarterly\", \"key\": \"10197028\", \"authors\": \"Leutz\", \"cite_color\": \"black\", \"id\": \"10197028\", \"group\": \"Cited\", \"name\": \"10197028\", \"pubDate\": \" 1999\", \"title\": \"Five laws for integrating medical and social services: lessons from the United States and the United Kingdom.\", \"label\": \"The Milbank quarterly\", \"journal_iso\": \"Milbank Q\"}}, {\"data\": {\"node_col\": \"#fdd\", \"journal\": \"Nature structural & molecular biology\", \"key\": \"23563141\", \"authors\": \"Hospenthal, Freund, Komander\", \"cite_color\": \"black\", \"id\": \"23563141\", \"group\": \"Searched\", \"name\": \"23563141\", \"pubDate\": \"May 2013\", \"title\": \"Assembly, analysis and architecture of atypical ubiquitin chains.\", \"label\": \"Nature structural & molecular biology\", \"journal_iso\": \"Nat. Struct. Mol. Biol.\"}}, {\"data\": {\"node_col\": \"#ff9f9f\", \"journal\": \"Human resources for health\", \"key\": \"19627605\", \"authors\": \"Dumont, Tourigny, Fournier\", \"cite_color\": \"black\", \"id\": \"19627605\", \"group\": \"Searched\", \"name\": \"19627605\", \"pubDate\": \"Jul 2009\", \"title\": \"Improving obstetric care in low-resource settings: implementation of facility-based maternal death reviews in five pilot hospitals in Senegal.\", \"label\": \"Human resources for health\", \"journal_iso\": \"Hum Resour Health\"}}, {\"data\": {\"node_col\": \"#ff7373\", \"journal\": \"International journal of family medicine\", \"key\": \"26977318\", \"authors\": \"Pineault, Borg\\\\u00e8s Da Silva, Provost\", \"cite_color\": \"black\", \"id\": \"26977318\", \"group\": \"Searched\", \"name\": \"26977318\", \"pubDate\": \" 2016\", \"title\": \"Impacts of Qu\\\\u00e9bec Primary Healthcare Reforms on Patients\\' Experience of Care, Unmet Needs, and Use of Services.\", \"label\": \"International journal of family medicine\", \"journal_iso\": \"Int J Family Med\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Science (New York, N.Y.)\", \"key\": \"23812720\", \"authors\": \"Tourigny, Fern\\\\u00e1ndez, Kelley\", \"cite_color\": \"black\", \"id\": \"23812720\", \"group\": \"Cited\", \"name\": \"23812720\", \"pubDate\": \"Jun 2013\", \"title\": \"Elongation factor G bound to the ribosome in an intermediate state of translocation.\", \"label\": \"Science (New York, N.Y.)\", \"journal_iso\": \"Science\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Europace : European pacing, arrhythmias, and cardiac electrophysiology : journal of the working groups on cardiac pacing, arrhythmias, and cardiac cellular electrophysiology of the European Society of Cardiology\", \"key\": \"19028709\", \"authors\": \"Iwasaku, Hirooka, Taniguchi\", \"cite_color\": \"black\", \"id\": \"19028709\", \"group\": \"Cited\", \"name\": \"19028709\", \"pubDate\": \"Jan 2009\", \"title\": \"Successful catheter ablation to accessory atrioventricular pathway as cardiac resynchronization therapy in a patient with dilated cardiomyopathy.\", \"label\": \"Europace : European pacing, arrhythmias, and cardiac electrophysiology : journal of the working groups on cardiac pacing, arrhythmias, and cardiac cellular electrophysiology of the European Society of Cardiology\", \"journal_iso\": \"Europace\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"Immunity\", \"key\": \"9052836\", \"authors\": \"Morse, Chen, Franklin\", \"cite_color\": \"black\", \"id\": \"9052836\", \"group\": \"Cited\", \"name\": \"9052836\", \"pubDate\": \"Jan 1997\", \"title\": \"Induction of cell cycle arrest and B cell terminal differentiation by CDK inhibitor p18(INK4c) and IL-6.\", \"label\": \"Immunity\", \"journal_iso\": \"Immunity\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of immunology (Baltimore, Md. : 1950)\", \"key\": \"7730616\", \"authors\": \"P\\\\u00e9nit, Lucas, Vasseur\", \"cite_color\": \"black\", \"id\": \"7730616\", \"group\": \"Cited\", \"name\": \"7730616\", \"pubDate\": \"May 1995\", \"title\": \"Cell expansion and growth arrest phases during the transition from precursor (CD4-8-) to immature (CD4+8+) thymocytes in normal and genetically modified mice.\", \"label\": \"Journal of immunology (Baltimore, Md. : 1950)\", \"journal_iso\": \"J. Immunol.\"}}, {\"data\": {\"node_col\": \"#ffb1b1\", \"journal\": \"The Journal of experimental medicine\", \"key\": \"9151892\", \"authors\": \"Tourigny, Mazel, Burtrum\", \"cite_color\": \"black\", \"id\": \"9151892\", \"group\": \"Cited\", \"name\": \"9151892\", \"pubDate\": \"May 1997\", \"title\": \"T cell receptor (TCR)-beta gene recombination: dissociation from cell cycle regulation and developmental progression during T cell ontogeny.\", \"label\": \"The Journal of experimental medicine\", \"journal_iso\": \"J. Exp. Med.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"RNA (New York, N.Y.)\", \"key\": \"17630323\", \"authors\": \"Spiegel, Ermolenko, Noller\", \"cite_color\": \"black\", \"id\": \"17630323\", \"group\": \"Cited\", \"name\": \"17630323\", \"pubDate\": \"Sep 2007\", \"title\": \"Elongation factor G stabilizes the hybrid-state conformation of the 70S ribosome.\", \"label\": \"RNA (New York, N.Y.)\", \"journal_iso\": \"RNA\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Age and ageing\", \"key\": \"8670547\", \"authors\": \"H\\\\u00e9bert, Bravo, Korner-Bitensky\", \"cite_color\": \"black\", \"id\": \"8670547\", \"group\": \"Cited\", \"name\": \"8670547\", \"pubDate\": \"Mar 1996\", \"title\": \"Predictive validity of a postal questionnaire for screening community-dwelling elderly individuals at risk of functional decline.\", \"label\": \"Age and ageing\", \"journal_iso\": \"Age Ageing\"}}, {\"data\": {\"node_col\": \"#fdd\", \"journal\": \"International journal of integrated care\", \"key\": \"24959112\", \"authors\": \"Somme, Trouv\\\\u00e9, Perisset\", \"cite_color\": \"black\", \"id\": \"24959112\", \"group\": \"Searched\", \"name\": \"24959112\", \"pubDate\": \"Apr 2014\", \"title\": \"Adapting the Quebecois method for assessing implementation to the French National Alzheimer Plan 2008-2012: lessons for gerontological services integration.\", \"label\": \"International journal of integrated care\", \"journal_iso\": \"Int J Integr Care\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"key\": \"18971332\", \"authors\": \"Juli\\\\u00e1n, Konevega, Scheres\", \"cite_color\": \"black\", \"id\": \"18971332\", \"group\": \"Cited\", \"name\": \"18971332\", \"pubDate\": \"Nov 2008\", \"title\": \"Structure of ratcheted ribosomes with tRNAs in hybrid states.\", \"label\": \"Proceedings of the National Academy of Sciences of the United States of America\", \"journal_iso\": \"Proc. Natl. Acad. Sci. U.S.A.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"American heart journal\", \"key\": \"7484735\", \"authors\": \"Prinzen, Cheriex, Delhaas\", \"cite_color\": \"black\", \"id\": \"7484735\", \"group\": \"Cited\", \"name\": \"7484735\", \"pubDate\": \"Nov 1995\", \"title\": \"Asymmetric thickness of the left ventricular wall resulting from asynchronous electric activation: a study in dogs with ventricular pacing and in patients with left bundle branch block.\", \"label\": \"American heart journal\", \"journal_iso\": \"Am. Heart J.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"International journal of integrated care\", \"key\": \"20689740\", \"authors\": \"Trouv\\\\u00e9, Couturier, Etheridge\", \"cite_color\": \"black\", \"id\": \"20689740\", \"group\": \"Searched\", \"name\": \"20689740\", \"pubDate\": \"Jun 2010\", \"title\": \"The path dependency theory: analytical framework to study institutional integration. The case of France.\", \"label\": \"International journal of integrated care\", \"journal_iso\": \"Int J Integr Care\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Genes & development\", \"key\": \"12533507\", \"authors\": \"Pestova, Hellen\", \"cite_color\": \"black\", \"id\": \"12533507\", \"group\": \"Cited\", \"name\": \"12533507\", \"pubDate\": \"Jan 2003\", \"title\": \"Translation elongation after assembly of ribosomes on the Cricket paralysis virus internal ribosomal entry site without initiation factors or initiator tRNA.\", \"label\": \"Genes & development\", \"journal_iso\": \"Genes Dev.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"The Journal of biological chemistry\", \"key\": \"17209036\", \"authors\": \"Yamamoto, Nakashima, Ikeda\", \"cite_color\": \"black\", \"id\": \"17209036\", \"group\": \"Cited\", \"name\": \"17209036\", \"pubDate\": \"Mar 2007\", \"title\": \"Binding mode of the first aminoacyl-tRNA in translation initiation mediated by Plautia stali intestine virus internal ribosome entry site.\", \"label\": \"The Journal of biological chemistry\", \"journal_iso\": \"J. Biol. Chem.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Journal of immunology (Baltimore, Md. : 1950)\", \"key\": \"11544316\", \"authors\": \"Kovalev, Franklin, Coffield\", \"cite_color\": \"black\", \"id\": \"11544316\", \"group\": \"Cited\", \"name\": \"11544316\", \"pubDate\": \"Sep 2001\", \"title\": \"An important role of CDK inhibitor p18(INK4c) in modulating antigen receptor-mediated T cell proliferation.\", \"label\": \"Journal of immunology (Baltimore, Md. : 1950)\", \"journal_iso\": \"J. Immunol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Science (New York, N.Y.)\", \"key\": \"11340196\", \"authors\": \"Ogle, Brodersen, Clemons \", \"cite_color\": \"black\", \"id\": \"11340196\", \"group\": \"Cited\", \"name\": \"11340196\", \"pubDate\": \"May 2001\", \"title\": \"Recognition of cognate transfer RNA by the 30S ribosomal subunit.\", \"label\": \"Science (New York, N.Y.)\", \"journal_iso\": \"Science\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Cell\", \"key\": \"1547488\", \"authors\": \"Mombaerts, Iacomini, Johnson\", \"cite_color\": \"black\", \"id\": \"1547488\", \"group\": \"Cited\", \"name\": \"1547488\", \"pubDate\": \"Mar 1992\", \"title\": \"RAG-1-deficient mice have no mature B and T lymphocytes.\", \"label\": \"Cell\", \"journal_iso\": \"Cell\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"Age and ageing\", \"key\": \"8669343\", \"authors\": \"Desrosiers, Bravo, H\\\\u00e9bert\", \"cite_color\": \"black\", \"id\": \"8669343\", \"group\": \"Cited\", \"name\": \"8669343\", \"pubDate\": \"Sep 1995\", \"title\": \"Reliability of the revised functional autonomy measurement system (SMAF) for epidemiological research.\", \"label\": \"Age and ageing\", \"journal_iso\": \"Age Ageing\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"International journal for equity in health\", \"key\": \"27724952\", \"authors\": \"Khanassov, Pluye, Descoteaux\", \"cite_color\": \"black\", \"id\": \"27724952\", \"group\": \"Searched\", \"name\": \"27724952\", \"pubDate\": \"Oct 2016\", \"title\": \"Organizational interventions improving access to community-based primary health care for vulnerable populations: a scoping review.\", \"label\": \"International journal for equity in health\", \"journal_iso\": \"Int J Equity Health\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Current opinion in structural biology\", \"key\": \"19362464\", \"authors\": \"Filbin, Kieft\", \"cite_color\": \"black\", \"id\": \"19362464\", \"group\": \"Cited\", \"name\": \"19362464\", \"pubDate\": \"Jun 2009\", \"title\": \"Toward a structural understanding of IRES RNA function.\", \"label\": \"Current opinion in structural biology\", \"journal_iso\": \"Curr. Opin. Struct. Biol.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Archives of gerontology and geriatrics\", \"key\": \"16125809\", \"authors\": \"Dubuc, H\\\\u00e9bert, Desrosiers\", \"cite_color\": \"black\", \"id\": \"16125809\", \"group\": \"Cited\", \"name\": \"16125809\", \"pubDate\": \" \", \"title\": \"Disability-based classification system for older people in integrated long-term care services: the Iso-SMAF profiles.\", \"label\": \"Archives of gerontology and geriatrics\", \"journal_iso\": \"Arch Gerontol Geriatr\"}}, {\"data\": {\"node_col\": \"#ffcbcb\", \"journal\": \"BMC health services research\", \"key\": \"18047668\", \"authors\": \"Kr\\\\u00f6ger, Tourigny, Morin\", \"cite_color\": \"black\", \"id\": \"18047668\", \"group\": \"Searched\", \"name\": \"18047668\", \"pubDate\": \"Nov 2007\", \"title\": \"Selecting process quality indicators for the integrated care of vulnerable older adults affected by cognitive impairment or dementia.\", \"label\": \"BMC health services research\", \"journal_iso\": \"BMC Health Serv Res\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Annals of internal medicine\", \"key\": \"12558375\", \"authors\": \"Safran\", \"cite_color\": \"black\", \"id\": \"12558375\", \"group\": \"Cited\", \"name\": \"12558375\", \"pubDate\": \"Feb 2003\", \"title\": \"Defining the future of primary care: what can we learn from patients?.\", \"label\": \"Annals of internal medicine\", \"journal_iso\": \"Ann. Intern. Med.\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Europace : European pacing, arrhythmias, and cardiac electrophysiology : journal of the working groups on cardiac pacing, arrhythmias, and cardiac cellular electrophysiology of the European Society of Cardiology\", \"key\": \"18256123\", \"authors\": \"Tomaske, Janousek, R\\\\u00e1zek\", \"cite_color\": \"black\", \"id\": \"18256123\", \"group\": \"Cited\", \"name\": \"18256123\", \"pubDate\": \"Feb 2008\", \"title\": \"Adverse effects of Wolff-Parkinson-White syndrome with right septal or posteroseptal accessory pathways on cardiac function.\", \"label\": \"Europace : European pacing, arrhythmias, and cardiac electrophysiology : journal of the working groups on cardiac pacing, arrhythmias, and cardiac cellular electrophysiology of the European Society of Cardiology\", \"journal_iso\": \"Europace\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Statistical science : a review journal of the Institute of Mathematical Statistics\", \"key\": \"20871802\", \"authors\": \"Stuart\", \"cite_color\": \"black\", \"id\": \"20871802\", \"group\": \"Cited\", \"name\": \"20871802\", \"pubDate\": \"Feb 2010\", \"title\": \"Matching methods for causal inference: A review and a look forward.\", \"label\": \"Statistical science : a review journal of the Institute of Mathematical Statistics\", \"journal_iso\": \"Stat Sci\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Health policy and planning\", \"key\": \"20360258\", \"authors\": \"Witter, Dieng, Mbengue\", \"cite_color\": \"black\", \"id\": \"20360258\", \"group\": \"Cited\", \"name\": \"20360258\", \"pubDate\": \"Sep 2010\", \"title\": \"The national free delivery and caesarean policy in Senegal: evaluating process and outcomes.\", \"label\": \"Health policy and planning\", \"journal_iso\": \"Health Policy Plan\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Medical care\", \"key\": \"9596063\", \"authors\": \"Safran, Kosinski, Tarlov\", \"cite_color\": \"black\", \"id\": \"9596063\", \"group\": \"Cited\", \"name\": \"9596063\", \"pubDate\": \"May 1998\", \"title\": \"The Primary Care Assessment Survey: tests of data quality and measurement performance.\", \"label\": \"Medical care\", \"journal_iso\": \"Med Care\"}}, {\"data\": {\"node_col\": \"#ffd4d4\", \"journal\": \"Nature\", \"key\": \"23354046\", \"authors\": \"Galej, Oubridge, Newman\", \"cite_color\": \"black\", \"id\": \"23354046\", \"group\": \"Cited\", \"name\": \"23354046\", \"pubDate\": \"Jan 2013\", \"title\": \"Crystal structure of Prp8 reveals active site cavity of the spliceosome.\", \"label\": \"Nature\", \"journal_iso\": \"Nature\"}}], \"edges\": [{\"data\": {\"source\": \"20552060\", \"id\": \"20552060_9856605\", \"target\": \"9856605\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_18256123\", \"target\": \"18256123\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_15679994\", \"target\": \"15679994\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_17292982\", \"target\": \"17292982\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_19028709\", \"target\": \"19028709\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_19804548\", \"target\": \"19804548\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_1245032\", \"target\": \"1245032\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_181165\", \"target\": \"181165\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_15583083\", \"target\": \"15583083\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_19879594\", \"target\": \"19879594\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_7484735\", \"target\": \"7484735\"}}, {\"data\": {\"source\": \"20552060\", \"id\": \"20552060_18774110\", \"target\": \"18774110\"}}, {\"data\": {\"source\": \"23115575\", \"id\": \"23115575_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"23115575\", \"id\": \"23115575_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_10197028\", \"target\": \"10197028\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_16125809\", \"target\": \"16125809\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_8669343\", \"target\": \"8669343\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_15660297\", \"target\": \"15660297\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_9347783\", \"target\": \"9347783\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_2976575\", \"target\": \"2976575\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_12642892\", \"target\": \"12642892\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_7622088\", \"target\": \"7622088\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_3928449\", \"target\": \"3928449\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_17278339\", \"target\": \"17278339\"}}, {\"data\": {\"source\": \"18317561\", \"id\": \"18317561_8670547\", \"target\": \"8670547\"}}, {\"data\": {\"source\": \"15317937\", \"id\": \"15317937_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"15317937\", \"id\": \"15317937_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"1245032\", \"id\": \"1245032_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"24167024\", \"id\": \"24167024_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"24167024\", \"id\": \"24167024_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"21672922\", \"id\": \"21672922_25129069\", \"target\": \"25129069\"}}, {\"data\": {\"source\": \"21672922\", \"id\": \"21672922_23351269\", \"target\": \"23351269\"}}, {\"data\": {\"source\": \"23882166\", \"id\": \"23882166_8669343\", \"target\": \"8669343\"}}, {\"data\": {\"source\": \"23882166\", \"id\": \"23882166_16125809\", \"target\": \"16125809\"}}, {\"data\": {\"source\": \"9856605\", \"id\": \"9856605_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"7215271\", \"id\": \"7215271_19627605\", \"target\": \"19627605\"}}, {\"data\": {\"source\": \"7215271\", \"id\": \"7215271_25129069\", \"target\": \"25129069\"}}, {\"data\": {\"source\": \"12196289\", \"id\": \"12196289_17049078\", \"target\": \"17049078\"}}, {\"data\": {\"source\": \"12196289\", \"id\": \"12196289_17295909\", \"target\": \"17295909\"}}, {\"data\": {\"source\": \"2567243\", \"id\": \"2567243_12241558\", \"target\": \"12241558\"}}, {\"data\": {\"source\": \"2567243\", \"id\": \"2567243_9151892\", \"target\": \"9151892\"}}, {\"data\": {\"source\": \"21818162\", \"id\": \"21818162_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"21818162\", \"id\": \"21818162_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"7622088\", \"id\": \"7622088_16896376\", \"target\": \"16896376\"}}, {\"data\": {\"source\": \"2148525\", \"id\": \"2148525_12241558\", \"target\": \"12241558\"}}, {\"data\": {\"source\": \"2148525\", \"id\": \"2148525_9151892\", \"target\": \"9151892\"}}, {\"data\": {\"source\": \"20697934\", \"id\": \"20697934_25874875\", \"target\": \"25874875\"}}, {\"data\": {\"source\": \"20697934\", \"id\": \"20697934_25137072\", \"target\": \"25137072\"}}, {\"data\": {\"source\": \"11167204\", \"id\": \"11167204_19627605\", \"target\": \"19627605\"}}, {\"data\": {\"source\": \"11167204\", \"id\": \"11167204_25129069\", \"target\": \"25129069\"}}, {\"data\": {\"source\": \"11167204\", \"id\": \"11167204_23351269\", \"target\": \"23351269\"}}, {\"data\": {\"source\": \"18774110\", \"id\": \"18774110_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"19879594\", \"id\": \"19879594_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"20631263\", \"id\": \"20631263_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"20631263\", \"id\": \"20631263_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"15583083\", \"id\": \"15583083_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"23351269\", \"id\": \"23351269_16583081\", \"target\": \"16583081\"}}, {\"data\": {\"source\": \"23351269\", \"id\": \"23351269_17027735\", \"target\": \"17027735\"}}, {\"data\": {\"source\": \"23351269\", \"id\": \"23351269_18406864\", \"target\": \"18406864\"}}, {\"data\": {\"source\": \"23351269\", \"id\": \"23351269_16101606\", \"target\": \"16101606\"}}, {\"data\": {\"source\": \"22931249\", \"id\": \"22931249_25874875\", \"target\": \"25874875\"}}, {\"data\": {\"source\": \"22931249\", \"id\": \"22931249_25137072\", \"target\": \"25137072\"}}, {\"data\": {\"source\": \"181165\", \"id\": \"181165_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"3928449\", \"id\": \"3928449_16896376\", \"target\": \"16896376\"}}, {\"data\": {\"source\": \"25490331\", \"id\": \"25490331_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"25490331\", \"id\": \"25490331_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"25129069\", \"id\": \"25129069_19627605\", \"target\": \"19627605\"}}, {\"data\": {\"source\": \"25129069\", \"id\": \"25129069_17011946\", \"target\": \"17011946\"}}, {\"data\": {\"source\": \"25129069\", \"id\": \"25129069_10141624\", \"target\": \"10141624\"}}, {\"data\": {\"source\": \"25129069\", \"id\": \"25129069_18406864\", \"target\": \"18406864\"}}, {\"data\": {\"source\": \"25129069\", \"id\": \"25129069_20382417\", \"target\": \"20382417\"}}, {\"data\": {\"source\": \"25129069\", \"id\": \"25129069_7894830\", \"target\": \"7894830\"}}, {\"data\": {\"source\": \"24213166\", \"id\": \"24213166_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"24213166\", \"id\": \"24213166_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"19833919\", \"id\": \"19833919_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"19833919\", \"id\": \"19833919_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"7894830\", \"id\": \"7894830_19627605\", \"target\": \"19627605\"}}, {\"data\": {\"source\": \"15679994\", \"id\": \"15679994_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"20383002\", \"id\": \"20383002_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"20383002\", \"id\": \"20383002_23563141\", \"target\": \"23563141\"}}, {\"data\": {\"source\": \"20383002\", \"id\": \"20383002_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"21676023\", \"id\": \"21676023_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"21676023\", \"id\": \"21676023_27724952\", \"target\": \"27724952\"}}, {\"data\": {\"source\": \"17292982\", \"id\": \"17292982_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"15299926\", \"id\": \"15299926_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"15299926\", \"id\": \"15299926_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"25874875\", \"id\": \"25874875_19197402\", \"target\": \"19197402\"}}, {\"data\": {\"source\": \"25874875\", \"id\": \"25874875_16570729\", \"target\": \"16570729\"}}, {\"data\": {\"source\": \"25874875\", \"id\": \"25874875_20724689\", \"target\": \"20724689\"}}, {\"data\": {\"source\": \"25874875\", \"id\": \"25874875_20360258\", \"target\": \"20360258\"}}, {\"data\": {\"source\": \"25874875\", \"id\": \"25874875_14654514\", \"target\": \"14654514\"}}, {\"data\": {\"source\": \"8608942\", \"id\": \"8608942_12241558\", \"target\": \"12241558\"}}, {\"data\": {\"source\": \"8608942\", \"id\": \"8608942_9151892\", \"target\": \"9151892\"}}, {\"data\": {\"source\": \"21569276\", \"id\": \"21569276_17027735\", \"target\": \"17027735\"}}, {\"data\": {\"source\": \"21569276\", \"id\": \"21569276_19197402\", \"target\": \"19197402\"}}, {\"data\": {\"source\": \"21569276\", \"id\": \"21569276_17011946\", \"target\": \"17011946\"}}, {\"data\": {\"source\": \"11687653\", \"id\": \"11687653_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"11687653\", \"id\": \"11687653_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"12365965\", \"id\": \"12365965_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"12365965\", \"id\": \"12365965_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"12642892\", \"id\": \"12642892_18047668\", \"target\": \"18047668\"}}, {\"data\": {\"source\": \"12642892\", \"id\": \"12642892_20689740\", \"target\": \"20689740\"}}, {\"data\": {\"source\": \"19804548\", \"id\": \"19804548_23323117\", \"target\": \"23323117\"}}, {\"data\": {\"source\": \"12781660\", \"id\": \"12781660_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"12781660\", \"id\": \"12781660_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"20382417\", \"id\": \"20382417_25137072\", \"target\": \"25137072\"}}, {\"data\": {\"source\": \"2976575\", \"id\": \"2976575_16896376\", \"target\": \"16896376\"}}, {\"data\": {\"source\": \"10141624\", \"id\": \"10141624_19627605\", \"target\": \"19627605\"}}, {\"data\": {\"source\": \"21245352\", \"id\": \"21245352_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"21245352\", \"id\": \"21245352_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"16101606\", \"id\": \"16101606_19627605\", \"target\": \"19627605\"}}, {\"data\": {\"source\": \"17011946\", \"id\": \"17011946_25137072\", \"target\": \"25137072\"}}, {\"data\": {\"source\": \"23000701\", \"id\": \"23000701_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"23000701\", \"id\": \"23000701_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"19805769\", \"id\": \"19805769_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"19805769\", \"id\": \"19805769_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"12470947\", \"id\": \"12470947_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"12470947\", \"id\": \"12470947_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"17278339\", \"id\": \"17278339_18047668\", \"target\": \"18047668\"}}, {\"data\": {\"source\": \"15660297\", \"id\": \"15660297_18047668\", \"target\": \"18047668\"}}, {\"data\": {\"source\": \"15660297\", \"id\": \"15660297_27724952\", \"target\": \"27724952\"}}, {\"data\": {\"source\": \"21767021\", \"id\": \"21767021_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"21767021\", \"id\": \"21767021_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"14654514\", \"id\": \"14654514_25137072\", \"target\": \"25137072\"}}, {\"data\": {\"source\": \"16583081\", \"id\": \"16583081_19627605\", \"target\": \"19627605\"}}, {\"data\": {\"source\": \"25384820\", \"id\": \"25384820_27144222\", \"target\": \"27144222\"}}, {\"data\": {\"source\": \"25384820\", \"id\": \"25384820_26977318\", \"target\": \"26977318\"}}, {\"data\": {\"source\": \"14673072\", \"id\": \"14673072_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"14673072\", \"id\": \"14673072_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"27144222\", \"id\": \"27144222_9596063\", \"target\": \"9596063\"}}, {\"data\": {\"source\": \"27144222\", \"id\": \"27144222_12558375\", \"target\": \"12558375\"}}, {\"data\": {\"source\": \"27144222\", \"id\": \"27144222_20871802\", \"target\": \"20871802\"}}, {\"data\": {\"source\": \"20094052\", \"id\": \"20094052_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"20094052\", \"id\": \"20094052_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"16896376\", \"id\": \"16896376_10197028\", \"target\": \"10197028\"}}, {\"data\": {\"source\": \"16896376\", \"id\": \"16896376_8669343\", \"target\": \"8669343\"}}, {\"data\": {\"source\": \"16896376\", \"id\": \"16896376_9347783\", \"target\": \"9347783\"}}, {\"data\": {\"source\": \"16896376\", \"id\": \"16896376_8670547\", \"target\": \"8670547\"}}, {\"data\": {\"source\": \"10966112\", \"id\": \"10966112_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"10966112\", \"id\": \"10966112_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"20724689\", \"id\": \"20724689_25137072\", \"target\": \"25137072\"}}, {\"data\": {\"source\": \"15315759\", \"id\": \"15315759_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"15315759\", \"id\": \"15315759_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"9347783\", \"id\": \"9347783_20689740\", \"target\": \"20689740\"}}, {\"data\": {\"source\": \"17295909\", \"id\": \"17295909_11544316\", \"target\": \"11544316\"}}, {\"data\": {\"source\": \"17295909\", \"id\": \"17295909_9052836\", \"target\": \"9052836\"}}, {\"data\": {\"source\": \"17295909\", \"id\": \"17295909_9744866\", \"target\": \"9744866\"}}, {\"data\": {\"source\": \"11233983\", \"id\": \"11233983_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"11233983\", \"id\": \"11233983_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"16859925\", \"id\": \"16859925_27159451\", \"target\": \"27159451\"}}, {\"data\": {\"source\": \"16859925\", \"id\": \"16859925_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"17049078\", \"id\": \"17049078_11544316\", \"target\": \"11544316\"}}, {\"data\": {\"source\": \"17049078\", \"id\": \"17049078_9052836\", \"target\": \"9052836\"}}, {\"data\": {\"source\": \"17049078\", \"id\": \"17049078_9744866\", \"target\": \"9744866\"}}, {\"data\": {\"source\": \"25137072\", \"id\": \"25137072_16570729\", \"target\": \"16570729\"}}, {\"data\": {\"source\": \"25137072\", \"id\": \"25137072_20360258\", \"target\": \"20360258\"}}, {\"data\": {\"source\": \"25137072\", \"id\": \"25137072_17027735\", \"target\": \"17027735\"}}, {\"data\": {\"source\": \"12241558\", \"id\": \"12241558_1547488\", \"target\": \"1547488\"}}, {\"data\": {\"source\": \"12241558\", \"id\": \"12241558_9151892\", \"target\": \"9151892\"}}, {\"data\": {\"source\": \"12241558\", \"id\": \"12241558_7730616\", \"target\": \"7730616\"}}, {\"data\": {\"source\": \"11015437\", \"id\": \"11015437_9052836\", \"target\": \"9052836\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_11340196\", \"target\": \"11340196\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_18951087\", \"target\": \"18951087\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_17209036\", \"target\": \"17209036\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_23812720\", \"target\": \"23812720\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_18971332\", \"target\": \"18971332\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_17630323\", \"target\": \"17630323\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_24792965\", \"target\": \"24792965\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_19362464\", \"target\": \"19362464\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_12533507\", \"target\": \"12533507\"}}, {\"data\": {\"source\": \"27159451\", \"id\": \"27159451_23354046\", \"target\": \"23354046\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_11340196\", \"target\": \"11340196\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_12533507\", \"target\": \"12533507\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_17209036\", \"target\": \"17209036\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_23812720\", \"target\": \"23812720\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_17630323\", \"target\": \"17630323\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_19362464\", \"target\": \"19362464\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_18951087\", \"target\": \"18951087\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_18971332\", \"target\": \"18971332\"}}, {\"data\": {\"source\": \"24792965\", \"id\": \"24792965_23354046\", \"target\": \"23354046\"}}, {\"data\": {\"source\": \"23323117\", \"id\": \"23323117_18256123\", \"target\": \"18256123\"}}, {\"data\": {\"source\": \"23323117\", \"id\": \"23323117_19028709\", \"target\": \"19028709\"}}, {\"data\": {\"source\": \"23323117\", \"id\": \"23323117_7484735\", \"target\": \"7484735\"}}, {\"data\": {\"source\": \"17027735\", \"id\": \"17027735_19627605\", \"target\": \"19627605\"}}, {\"data\": {\"source\": \"10197028\", \"id\": \"10197028_24959112\", \"target\": \"24959112\"}}, {\"data\": {\"source\": \"26977318\", \"id\": \"26977318_9596063\", \"target\": \"9596063\"}}, {\"data\": {\"source\": \"26977318\", \"id\": \"26977318_12558375\", \"target\": \"12558375\"}}, {\"data\": {\"source\": \"26977318\", \"id\": \"26977318_20871802\", \"target\": \"20871802\"}}, {\"data\": {\"source\": \"7730616\", \"id\": \"7730616_9151892\", \"target\": \"9151892\"}}, {\"data\": {\"source\": \"9151892\", \"id\": \"9151892_1547488\", \"target\": \"1547488\"}}]}, \"stats\": {\"top_journal_dict\": {\"Genes Dev.\": 3, \"Circulation\": 3, \"Science\": 3, \"Health Policy Plan\": 3, \"Int J Integr Care\": 5, \"Lancet\": 4, \"Cell\": 4, \"Age Ageing\": 3, \"J. Struct. Biol.\": 3, \"Proc. Natl. Acad. Sci. U.S.A.\": 5}, \"num_citations\": 91, \"pub_years\": {\"values\": [2010, 2011, 2008, 2004, 1976, 2014, 2011, 2013, 1998, 1981, 2002, 1989, 2011, 1995, 1990, 2011, 2001, 2008, 2010, 2004, 2013, 2012, 1976, 1985, 2014, 2014, 2014, 2009, 2004, 2010, 2011, 2008, 1997, 2015, 1996, 2011, 2001, 2002, 2003, 2010, 2003, 2010, 1988, 1995, 2011, 2005, 2006, 2012, 2009, 2002, 2006, 2008, 2004, 2011, 2003, 2006, 2003, 2016, 2010, 2003, 2000, 2010, 2004, 1997, 2007, 2009, 2001, 2007, 2006, 2014, 2002, 2000, 2006, 2016, 1998, 2014, 2008, 2012, 2006, 1999, 2013, 2009, 2016, 2013, 2009, 1997, 1995, 1997, 2007, 1996, 2014, 2008, 1995, 2010, 2003, 2007, 2001, 2001, 1992, 1995, 2016, 2009, 2007, 2003, 2008, 2010, 2010, 1998, 2013], \"num_bin\": 20}, \"num_results\": 22, \"top_author_dict\": {\"Tourigny\": 15, \"Tousignant\": 6, \"Ramakrishnan\": 5, \"Dubuc\": 5, \"Xiong\": 4, \"Fournier\": 10, \"Levesque\": 4, \"Dumont\": 10, \"H\\\\u00e9bert\": 7, \"Sarnow\": 5}, \"top_authors\": \"Tourigny (15), Fournier (10), Dumont (10), H\\\\u00e9bert (7), Tousignant (6), Sarnow (5), Ramakrishnan (5), Dubuc (5), Xiong (4), Levesque (4)\", \"top_journals\": \"Int J Integr Care (5), Proc. Natl. Acad. Sci. U.S.A. (5), Cell (4), Lancet (4), Circulation (3), Science (3), J. Struct. Biol. (3), Age Ageing (3), Health Policy Plan (3), Genes Dev. (3)\", \"num_links\": 191, \"max_degree_cited\": 26}}'"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import sys\n",
    "sys.path.append('../backend/lib')\n",
    "sys.path.append('../backend')\n",
    "from GraphSession import GraphSession\n",
    "from ResultGraph import ResultGraph\n",
    "from networkx import generate_gml\n",
    "import networkx as nx\n",
    "from networkx.readwrite import json_graph\n",
    "import json\n",
    "\n",
    "search_input = \"tourigny\"#\"campbell cancer leukemia\" #\"nlp genomics\"\n",
    "graphsession = GraphSession(search_input)\n",
    "citations = graphsession.get_citations_from_fulltext_mongo(search_input, retmax=200)\n",
    "resultGraph = ResultGraph()\n",
    "resultGraph.populate_from_cite_dict(citations)\n",
    "        \n",
    "resultGraph.extract_by_connectivity(connectivity=1)\n",
    "resultGraph.extract_by_connectivity(connectivity=0)\n",
    "        \n",
    "# Query metadata\n",
    "metadataList = graphsession.get_metadataList_from_mongo(resultGraph.nodeIds)\n",
    "resultGraph.add_metadata_to_graph(metadataList)\n",
    "resultGraph.get_graph(graph_format='cytoscape')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "08/02/2018 11:35:35 AM [INFO]: Created new log.\n",
      "08/02/2018 11:35:36 AM [INFO]: RequestFullTextSearch: Creating request\n",
      "08/02/2018 11:35:36 AM [INFO]: ConnectEutils: Connecting to eutils API:\n",
      " https://eutils.ncbi.nlm.nih.gov/entrez/eutils/esearch.fcgi?db=pmc&tool=graphsearch&sort=relevance&term=cancer&retmax=20\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20\n",
      "'PMC5811185', 'PMC5473951', 'PMC4339370', 'PMC5850596', 'PMC5287060', 'PMC3921623', 'PMC5339024', 'PMC5434894', 'PMC3769458', 'PMC4588097', 'PMC4568174', 'PMC4580396', 'PMC4569005', 'PMC5890653', 'PMC3295744', 'PMC5421136', 'PMC3560853', 'PMC5570538', 'PMC4951023', 'PMC4819002'\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "sys.path.append('../backend/lib')\n",
    "sys.path.append('../backend')\n",
    "from GraphSession import GraphSession\n",
    "from ResultGraph import ResultGraph\n",
    "from networkx import generate_gml\n",
    "import networkx as nx\n",
    "from networkx.readwrite import json_graph\n",
    "import json\n",
    "\n",
    "search_input = \"cancer\"#\"campbell cancer leukemia\" #\"nlp genomics\"\n",
    "graphsession = GraphSession(search_input)\n",
    "pmc_hits = graphsession.get_pubmed_results_from_fulltext(search_input, retmax=20)\n",
    "\n",
    "pmc_hits\n",
    "pmc_lst = [\"'PMC{0}'\".format(pmc) for pmc in pmc_hits]\n",
    "pmc_str = ', '.join(pmc_lst)\n",
    "print len(pmc_lst)\n",
    "print pmc_str"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (n:ARTICLE)-[k:CITES]->(r:ARTICLE) WHERE n.pmcid IN ['PMC5811185', 'PMC5473951', 'PMC4339370', 'PMC5850596', 'PMC5287060', 'PMC3921623', 'PMC5339024', 'PMC5434894', 'PMC3769458', 'PMC4588097', 'PMC4568174', 'PMC4580396', 'PMC4569005', 'PMC5890653', 'PMC3295744', 'PMC5421136', 'PMC3560853', 'PMC5570538', 'PMC4951023', 'PMC4819002'] MATCH (j:JOURNAL)-[p:PUBLISHED]->(n) MATCH (j2:JOURNAL)-[p2:PUBLISHED]->(r) RETURN n,k,r,j,p,j2,p2;\n"
     ]
    }
   ],
   "source": [
    "\n",
    "cypher_query = 'MATCH (k:ARTICLE)-[r:CITES]->(n:ARTICLE { pmcid IN [' + pmc_str + '] })' + \\\n",
    "    'WITH k, r, n LIMIT 10 MATCH (n)-[r2:CITES]->(k2:ARTICLE) ' + \\\n",
    "    'MATCH (j1)-[p1:PUBLISHED]->(n) MATCH (j2)-[p2:PUBLISHED]->(k) ' + \\\n",
    "    'MATCH (j3)-[p3:PUBLISHED]->(k2) RETURN n, r, r2, k, k2, j1, j2, j3, p1, p2, p3;'\n",
    "\n",
    "cypher_query3 = 'MATCH (k:ARTICLE)-[r:CITES]->(n:ARTICLE) WHERE n.pmcid IN [' + pmc_str + '] ' + \\\n",
    "    'MATCH (n)-[r2:CITES]->(k2:ARTICLE) ' + \\\n",
    "    'MATCH (j1:JOURNAL)-[p1:PUBLISHED]->(n) MATCH (j2)-[p2:PUBLISHED]->(k) ' + \\\n",
    "    'MATCH (j3:JOURNAL)-[p3:PUBLISHED]->(k2) RETURN n, r, r2, k, k2, j1, j2, j3, p1, p2, p3;'\n",
    "    \n",
    "cypher_query4 = 'MATCH (k:ARTICLE)-[r:CITES]->(n:ARTICLE) WITH k, r, n, size((k)-[:CITES]->(n)) as degree ' + \\\n",
    "    'WHERE n.pmcid IN [' + pmc_str + '] RETURN degree;' + \\\n",
    "    'MATCH (n)-[r2:CITES]->(k2:ARTICLE) ' + \\\n",
    "    'MATCH (j1:JOURNAL)-[p1:PUBLISHED]->(n) MATCH (j2)-[p2:PUBLISHED]->(k) ' + \\\n",
    "    'MATCH (j3:JOURNAL)-[p3:PUBLISHED]->(k2) RETURN n, r, r2, k, k2, j1, j2, j3, p1, p2, p3;'\n",
    "\n",
    "cypher_query5 = 'MATCH (k:ARTICLE) WHERE k.pmcid IN [' + pmc_str + '] ' + \\\n",
    "    'WITH k, size(()-[:CITES]->(k)) as degree RETURN k, degree;'\n",
    "    \n",
    "cypher_query2 = 'MATCH (n:ARTICLE)-[k:CITES]->(r:ARTICLE) WHERE n.pmcid IN [' + pmc_str + '] '+ \\\n",
    "    'MATCH (j:JOURNAL)-[p:PUBLISHED]->(n) MATCH (j2:JOURNAL)-[p2:PUBLISHED]->(r) RETURN n,k,r,j,p,j2,p2;'\n",
    "\n",
    "cypher_query6 = 'MATCH (k:ARTICLE)-[r:CITES]->(n:ARTICLE) WHERE n.pmcid IN [' + pmc_str + '] ' + \\\n",
    "    'MATCH (n)-[r2:CITES]->(k2:ARTICLE) RETURN n, r, r2, k, k2;'    \n",
    "\n",
    "cypher_query7 = 'MATCH (n:ARTICLE)-[r:CITES]->(k:ARTICLE) WHERE n.pmcid IN [' + pmc_str + '] ' + \\\n",
    "    'RETURN count(n);'\n",
    "#    'RETURN n, r, k;'\n",
    "    \n",
    "print cypher_query2\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Design Cypher query\n",
    "\n",
    "MATCH (k:ARTICLE)-[r:CITES]->(n:ARTICLE) WHERE n.pmcid IN ['PMC2922830', 'PMC4799500', 'PMC3794158', 'PMC2214268', 'PMC2225401', 'PMC2193312', 'PMC2790177', 'PMC3330087', 'PMC3002699', 'PMC3002681', 'PMC3330072', 'PMC5884338', 'PMC4984747', 'PMC4500844', 'PMC3841715', 'PMC4176142', 'PMC3836249', 'PMC3590618', 'PMC3457162', 'PMC3079976'] WITH k, r, n LIMIT 10 MATCH (n)-[r2:CITES]->(k2:ARTICLE) MATCH (j1)-[p1:PUBLISHED]->(n) MATCH (j2)-[p2:PUBLISHED]->(k) MATCH (j3)-[p3:PUBLISHED]->(k2) RETURN n, r, r2, k, k2, j1, j2, j3, p1, p2, p3;"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connecting to Neo4j and submitting query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(_8904690:ARTICLE {authors: 'Fidler M M, Frobisher C, Guha J, Wong K, Kelly J, Winter D L, Sugden E, Duncan R, Whelan J, Reulen R C, Hawkins M M', journal: 'British journal of cancer', journal_iso: 'Br. J. Cancer', month: 'Jun', pmcid: 'PMC4580396', pmid: '25989269', title: 'Long-term adverse outcomes in survivors of childhood bone sarcoma: the British Childhood Cancer Survivor Study.', year: 2015})"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import py2neo\n",
    "from py2neo import Graph\n",
    "import networkx as nx\n",
    "\n",
    "graph = Graph(user='neo4j', password=\"graphtest\")#, host=\"http://ec2-52-56-99-123.eu-west-2.compute.amazonaws.com:7474\")\n",
    "\n",
    "#cypher_query = \"MATCH (n:ARTICLE)-[r:CITES]->(k:ARTICLE) WHERE n.pmcid IN ['PMC5811185', 'PMC5473951', 'PMC4339370', 'PMC5850596', 'PMC5287060', 'PMC3921623', 'PMC5339024', 'PMC5434894', 'PMC3769458', 'PMC4588097', 'PMC4568174', 'PMC4580396', 'PMC4569005', 'PMC5890653', 'PMC3295744', 'PMC5421136', 'PMC3560853', 'PMC5570538', 'PMC4951023', 'PMC4819002'] RETURN n, r, k;\"\n",
    "cypher_query = \"MATCH (n:ARTICLE)-[r:CITES]->(k:ARTICLE) WHERE n.pmcid IN ['PMC3769458', 'PMC5890653', 'PMC4580396'] RETURN n, r, k;\"\n",
    "neo_request = graph.run(cypher_query)\n",
    "\n",
    "#g = neo_request.to_subgraph()\n",
    "#print g.relationships.\n",
    "\n",
    "#for n in g.nodes:\n",
    "#    print n\n",
    "#    print n.identity\n",
    "#    print dict(n)\n",
    "#    attr = dict(n)\n",
    "#    break\n",
    "    \n",
    "#for r in g.relationships:\n",
    "#    print r\n",
    "#    print dict(r)\n",
    "#    break\n",
    "    \n",
    "neo_request.to_series()[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "8904690"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.start_node.identity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{4296069: u'16767717', 6642571: u'21642683', 6812302: u'21947833', 6068881: u'20447915', 645396: u'3469460', 4708513: u'17557301', 7591666: u'23401292', 4652464: u'17450524', 5004468: u'18268128', 6284730: u'20922787', 5927228: u'20107164', 6516542: u'21407221', 7638082: u'23484904', 3499333: u'15127411', 5144655: u'18521283', 5217484: u'18664655', 1478223: u'8614005', 3678291: u'15534610', 3289178: u'14506117', 6170191: u'20634481', 6166330: u'20628130', 8132400: u'24419490', 4491366: u'17141498', 5363942: u'19030995', 6470122: u'21319288', 5522289: u'19327986', 8904690: u'25989269', 6182206: u'20656964', 4821368: u'17849473', 1510009: u'8690526', 5524988: u'19332714'}\n"
     ]
    }
   ],
   "source": [
    "import networkx as nx\n",
    "import py2neo\n",
    "from py2neo import Graph\n",
    "\n",
    "\n",
    "def neo2networkx(neo_subgraph):\n",
    "    # Extract nodes and relationships from neo_subgraph\n",
    "    nodes = neo_subgraph.nodes\n",
    "    rels = neo_subgraph.relationships\n",
    "    \n",
    "    # Generate new NetworkX object\n",
    "    G = nx.Graph()\n",
    "    \n",
    "    # Set up dictionary to map Neo4j IDs to PMID\n",
    "    pmid_map = {}\n",
    "    \n",
    "    # Add all nodes\n",
    "    for node in nodes:\n",
    "        attr = dict(node)\n",
    "        pmid = attr['pmid']\n",
    "        neo_id = node.identity\n",
    "        pmid_map[neo_id] = pmid\n",
    "        \n",
    "        #print node\n",
    "        G.add_node(pmid)\n",
    "        #break\n",
    "        \n",
    "    print pmid_map\n",
    "    \n",
    "    # Add relationships\n",
    "    for rel in rels:\n",
    "        start_node = pmid_map[rel.start_node.identity]\n",
    "        end_node = pmid_map[rel.end_node.identity]\n",
    "        G.add_edge(start_node, end_node)\n",
    "        #break\n",
    "        \n",
    "    return G\n",
    "    \n",
    "\n",
    "graph = Graph(user='neo4j', password=\"graphtest\")\n",
    "\n",
    "#cypher_query = \"MATCH (n:ARTICLE)-[r:CITES]->(k:ARTICLE) WHERE n.pmcid IN ['PMC5811185', 'PMC5473951', 'PMC4339370', 'PMC5850596', 'PMC5287060', 'PMC3921623', 'PMC5339024', 'PMC5434894', 'PMC3769458', 'PMC4588097', 'PMC4568174', 'PMC4580396', 'PMC4569005', 'PMC5890653', 'PMC3295744', 'PMC5421136', 'PMC3560853', 'PMC5570538', 'PMC4951023', 'PMC4819002'] RETURN n, r, k;\"\n",
    "cypher_query = \"MATCH (n:ARTICLE)-[r:CITES]->(k:ARTICLE) WHERE n.pmcid IN ['PMC3769458', 'PMC5890653', 'PMC4580396'] RETURN n, r, k;\"\n",
    "neo_request = graph.run(cypher_query)\n",
    "\n",
    "nx_graph = neo2networkx(neo_request.to_subgraph())\n",
    "#g = neo_request.to_subgraph()\n",
    "#g.nodes\n",
    "\n",
    "nx.draw(nx_graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeEAAAFCCAYAAADGwmVOAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzs3XdcU9f7B/APogiIIDNsFMWBAzfV\nOsFVFRW0RtyrjrZqnUWtVapVoc5+HbhXHVBRFPfAbbXgQkUrahHZiIDKynp+f+QHBZlJbkgC5/16\n5aWQ3HPPBZLnnucsLSIiMAzDMAxT6WqougIMwzAMU12xIMwwDMMwKsKCMMMwDMOoCAvCDMMwDKMi\nLAgzDMMwjIqwIMwwDMMwKsKCMMMwDMOoCAvCDMMwDKMiLAgzDMMwjIqwIMwwDMMwKsKCMMMwDMOo\nCAvCDMMwDKMiLAgzDMMwjIqwIMwwDMMwKsKCMMMwDMOoCAvCDMMwDKMiLAgzDMMwjIqwIMwwDMMw\nKsKCMMMwDMOoCAvCDMMwDKMiLAgzDMMwjIqwIMwwDMMwKsKCMMMwDMOoCAvCDMMwDKMiLAgzDMMw\njIrUVHUFGIap5lJSgL17gchIIDMTMDICWrUCJkwAzM1VXTuGUSotIiJVV4JhmBJU9eAUHg6sWgWc\nPSv9Ojf3v+f09AAi4KuvgIULgQ4dVFNHhlEyFoQZRt1Uh+C0dSswbx6QkyO9ntJoaUmvec0aYPr0\nyqsfw1QSFoQZRp1Uh+CUf43Z2RU/Rl9fM6+VYcrBgjDDqIvqEJzCw4EePWS7xnz6+sC1a0D79pxX\ni2FUhQVhhlEH1SU4eXkBISFlt/JLo6UFeHoCwcHc14thVIQFYYZRB9UhOKWkAA4ORfu4ZaWrC8TG\nVo2BaQwDNk+YYVQvJUU6CEve+2Ei4MwZIDWV23pxbe9excvQ0uKmHIZREywIM4yqVZfgFBmpWCsY\nkA5Ye/yYm/owjBpgQZhhVK26BKfMTG7KSU/nphyGUQMsCDOMqlWX4GRkxE05xsbclMMwaoAFYYZR\nteoSnFq1kg6sUoSeHtCyJTf1YRg1wIIwox5SUgB/f2D0aMDDQ/qvv7/6DzbiQnUJTuPHK14GETfl\nMIyaYFOUGNWqDks0lqc6Td2pDlOxGEYGrCXMqM7WrdIFKkJCpAHo8yCUkyP9XkiI9HVbt6qilspn\nYSG90dDSku94LS2gf3/1D8CA9GZKT0++Y/X0pMczTBXCgjCjGoWXaCyvVUQkfd28eVU3EFeX4NSh\ng3SZTX192Y7LX55TE1YFYxgZsCDMVL7wcNnXSAb+C8QREcqplypVp+A0fXrBtVJ5rX8tLc1bH5th\nZMCCMFP5Vq2SpprlkZMjPb4qKhScyk1Na3pwmj4duHYNGT16IFdLC/R5FkBPT9rP7ekpXRdbE6+R\nYSqADcxiKld1GoQkr4gI6Y3GmTPSYFv4hiV/sFr//tIUtCa1gEuwaNEi6H78iJ/t7aWLjaSnS6da\ntWwpHQVdVX/HDPP/aqq6Akw1w+USjfPnK16WOmrfXjoCODVVep2PHyMhKgr/JCej58yZVSY4ERGC\ng4Nx4MABoGNHVVeHYVSCBWGmclWXJRq5YG5ecKOR+ewZpgwahOgqdOPx9OlT5OTkoENVnXrGMBXA\n+oSZylVdlmjkWKNGjRAXF4ccefvS1VBwcDCGDh0KLXmnZjFMFcCCMFO5qssSjRyrVasWGjVqhOfP\nn6u6KpzJD8IMU52xIMxUruqyRKMSNG/eHE+fPlV1NTjx4sULpKamonPnzqquCsOoFAvCTOVi6wfL\nrSoF4eDgYHh6eqJGDfYRxFRv7B3AVK7qtEQjx5o3b44nT56ouhqcCA4OxrBhw1RdDYZROTZPmKl8\n4eHStaBlXTELkC5Qce2axs+PlceLFy/Qr18/vH79WtVVUUhMTAw6dOiAxMRE1KzJJmgoRUqKdHpb\nZKR0MKSRkbQraMKEankDq85YEGZUo/Da0RVE+vrQ0tQVojggFotRt25dpKamok6dOqqujtzWrVuH\nqKgo7Ny5U9VVqXrYrmQah6WjGdWQYYlG0tJCnrY2djVrBpo2rZIqqH60tbXRuHFjPHv2TNVVUcjR\no0fVY1R0VdvDmu1KppFYEGZU5//XD4anp3TEdCnrB2t5eoKuXsUObW38+uuvqqmrmtD0wVnx8fF4\n/vw53N3dVVeJ8HDpvsYODsDSpcDBg8CpU9J/ly0D7O2lz4eHq66OsmK7kmkslo5m1EOhJRpLWz84\nMTERrq6uWL9+vXq0pFRg5cqVyMjIgL+/v6qrIpdNmzbh77//xv79+1VTgfxglZNTdrDS0pLeBGpC\n9wcbY6HR2KgIRj0UWqKxNFZWVjh+/Dj69esHR0dHtGnTppIqpz6aN2+Obdu2qboacgsODsYPP/yg\nmpPLMg6hcGsRUO9AzMWuZMHB3NaJqTDWEmY0zp9//ol58+bh7t27sLS0VHV1KtWrV6/g5uaGN2/e\nqLoqMktJSYGTkxOSkpKg93nXg7JV1dYi25VM47E+YUbjfP3115g4cSI8PT2Rq+hmEBqmQYMGePfu\nHT5+/KjqqsgsJCQE/fr1q/wADFTdPay53JWMUQkWhBmNtGTJEtjZ2WHKlCmoTsmcGjVqoGnTpoiK\nilJ1VWSmsgU6UlKkU3bk/Tshku7trI6jptmuZBqPBWFGI9WoUQN79+7F06dPNXaQkrw0cYR0eno6\n7ty5g6+++qryT16VW4tsVzKNxwZmMRpLX18fJ06cgKurK5o1a4ZBgwZVfiVUsDKRJgbhkydPws3N\nDQYGBpV/8qrcWmS7kmk81hJmNJqtrS2OHTuGSZMm4XFlfkiqcK6pJq4hrdIFOqpya5HtSqbxWBBm\nNJ6rqys2btyIQYMGIbUy+u1UvDJRixYtNKol/OHDB1y7dg0DBw5UTQWqcmuR7Uqm8VgQZqqEkSNH\nYuTIkfDy8oJAIFDeidRgZSJ7e3tkZmYiIyODszKV6fTp0+jatSvq1aunmgpU5daihQUkfftCwnYl\n01gsCFcVVW0dXDksX74cZmZmmD59unJGTIeHy7zpBID/AnFEBCfVqFGjBpo1a6YxI6SDg4NVu8JZ\nFW4tJicnY0ZCAgTyBmE9PelmDozKsCCs6ariOrhyqlGjBg4cOICIiAhs2LCB+xOo0VxTTRmclZWV\nhYsXL2Lw4MGqq0QV3cP66tWraNu2LYz79EGt33+XLioiC3196bKc6rgISXVCjObasoVIX59IS4tI\neq9e8kNLS/q6LVtUXeNKERMTQ5aWlnTmzBnuCk1OJtLVLfvnXN5DV5coJYWT6vz22280a9YsTspS\npqNHj5K7u7uqq0H099/S94A8vzd9faLwcFVfQQGRSES//PILWVpa0vnz5/97gn0eaCTWEtZUatA3\nqa4cHBxw9OhRjBs3jrtt/9RsrqmmjJBW2QIdn+vQAZLffkOutrZsx6lZazE5ORn9+vXDpUuXcO/e\nPfTp0+e/Jyu4Kxk8PaWvU+f1sKsTVd8FMHKoQnf1yrRnzx5q2LAhvXv3TvHCRo1SrBWc/xgzRvG6\nEFFsbCxZWlpyUpay5ObmUr169SgxMVHVVSEiafZgdf36JNHQ1mJYWBhZW1vTTz/9REKhsOwXp6QQ\n+ftL/94GDpT+6+/PWSaG4Q4LwprI07P8D5GyPly8vFR9BZVm3rx51KNHDxIIBIoVNHAgN0F44EBO\nrksikZChoSGlpaVxUp4yhIaGUteuXVVdDSIiunXrFllYWFBMTIz0JtTLS9o9oKdX9Pejpyf9vpeX\n2tyslpp+ZqoEtmKWpuFyHVw1G2iiDKtXr8bgwYMxY8YMbN26FVryDs5Rs7mmWlpacHZ2xtOnT9G1\na1dOyuSaykdF/793795hxIgR2LlzJxwcHKSDGIODK7SHtaolJydj9OjREAqFuHfvHqytrVVdJYZj\nrE9Y06hZ36S609bWxqFDh3Djxg1s2bJF/oLUcK6pOo+QFgqFOHnyJLy8vFRaD4lEgnHjxoHP58PD\nw6Pok/l7WO/fD4SGSv+dP19tAvCVK1fQtm1bfPHFF7h06RILwFUUC8Kapiqvg6skhoaGCA0NxfLl\ny3Hx4kX5ClHDuabqHISvXLkCJycn2NnZqbQev/32G9LT07Fy5UqV1kMWYrEYv/zyC0aOHIk9e/Zg\n+fLlqFmTJS2rKhaENU1VXgdXiRwdHREYGIjRo0fjxYsXsheghnNN1XmEtDqkom/evIl169bhyJEj\nqFWrlkrrUlHJycno27cvwsLCio9+ZqokFoQ1jZr1TWqS7t27Y8WKFfDw8EC6PDchCxcWn/ZRUUpY\nmUhd15AWi8UICQlRaRBOTU2Ft7c3du/eDXt7e5XVQxb56edOnTqx9HM1woKwplHDvklN8s0336Bf\nv37g8/kQiUSyHdyhg3TOqJqsTGRlZQWhUFg5m1bI4ObNm7C2toajo6NKzi+RSDB27FiMHDkSAwYM\nUEkdZFE4/bx3716Wfq5mWBDWNGrYN6lp1q5dCy0tLcydO1f2g6dP/y8Ql5OaJi2t/wKwEhZG0NLS\nUst+YZVuWwjAz88PHz9+xIoVK1RWh4r6PP3cu3dvVVeJqWQsCGsaBfsmxQAeWlsjrUb1/dXXrFkT\ngYGBOH/+PLZv3y57ARVYmUiorY1Hjo5KX5lI3YKwRCLBsWPHVLZK1vXr17Fx40aN6AfOTz937tyZ\npZ+rMZbz0EQLFwLnz8u+mw+AGnp6uNCuHdY0a4YlS5Zg2rRpav9hpQz16tVDaGgounTpgsaNG6NH\njx6yFdC+fZlzTdP794d7t254yONBmeOD1W1w1t27d1GvXj00bdq00s+dkpJSMKLY1ta20s9fUWKx\nGL/++isCAgKwb98+1vqt7lS9Wggjp/zF2mVdsvL/l+F7/Pgxubu7k7OzM124cEHFF6M6Fy9eJB6P\nR69eveK8bB8fH/rmm284L7ewS5cuqc2qVEREc+fOpSVLllT6ecViMfXp04d8fHwq/dyySEpKInd3\nd+rRowfFx8erujqMGmBBWJMpuGuKRCKhkJAQcnR0pEGDBlF0dLSKLkS1Nm3aRM7OzpSZmclpuWlp\naWRqaqrUn2tSUhKZmJiQRCJR2jlKlJxM5OcnXVN74ECiUaNI4udHbWxt6eHDh5VbFyJasWIFdenS\npfw1lVXo8uXLZG1tTT///DOJRCJVV4dREywIazoO1sHNzc0lPz8/MjU1pQULFnAejDTB9OnTqX//\n/px/OPr6+tIYjjZtKIlEIiFTU9PK2yTh77+la5fr6hbb2lFcuzblaGmRxNNT+rpKcuXKFbK0tKS4\nuLhKO6csRCIRLVu2jKysrOjixYuqrg6jZlgQrio42DUlMTGRJkyYQFZWVrRr1y4Si8VKrLB6EQgE\n5ObmRnPnzuW03MzMTDI3N6enT59yWm5h3bp1o0uXLimt/AJquF9tUlIS2djY0Llz55R+LnkkJiaS\nm5sb9ejRgxISElRdHUYNsSDMFBMeHk6dO3emdu3a0c2bN1VdnUqTlpZGjRo1ot27d3Narp+fHw0b\nNozTMgubPn06bdy4UWnlE5HCYxCUQSQSUa9evWjx4sVKO4ciWPqZqQgWhJkSSSQSOnToENna2pK3\ntzfFxsaqukqVIioqiszNzTm9+cjKyiIrKyu6f/8+Z2UWtmnTJuUOAFPT/at9fX2pe/fuatcPzNLP\njCyq72RRpkxaWlrw9vbG8+fP4eTkhDZt2sDX1xfZckyL0iTNmjXD/v37MWzYMMTExHBSpr6+PhYu\nXIglS5ZwUt7nlD5XeNUq6aYf8sjJkR7PsbCwMGzduhWHDh1Sq9WlkpKS0KdPH1y9ehX37t1Dr169\nVF0lRt2p+i6A0QwxMTE0fPhwsre3pyNHjlT+aNxKtn79emrZsiV9/PiRk/Jyc3PJzs6Obt++zUl5\nhaWkpJCRkZFyfifJycUGYMn80NWVaWxCeRITE8na2lrtptZdunSJrKysWPqZkQkLwoxMrl+/Tm3a\ntKEuXbrQvXv3VF0dpZFIJDRp0iQaPHgwZwPUduzYQe7u7pyU9TkLCwvljA7281M8COvpSQcJckAk\nEpGbm5tK5iKXRiQS0dKlS1n6mZELS0czMunatSvCw8Mxbtw4DBgwAJMnT0ZycrKqq8U5LS0tbNmy\nBe/fv8dPP/3ESZnjxo1DTEwMrly5wkl5hSktJa1m+1cvX74cEokES5cu5aQ8RSUlJaF37964fv06\nSz9XVEoK4O8PjB4NeHhI//X3l64+Vx2p+i6A0VwZGRk0d+5cMjU1pd9++43y8vJkL6SERR/Iz4/T\n9KUiUlJSqEGDBvTHH39wUt6BAweoc+fOnKeOv//+e1q3bh2nZRKR9HeiSCs4/zFwoMJVyU/3qstU\nn/z6LF26lKWfK6KMOeYFaxpU8hxzdcCCMKOwf/75hwYOHEhOTk4UGhpasQCjQW/Ix48fk7m5Od25\nc0fhskQiETk7O9OZM2c4qNl/tm7dShMnTuS0TCKS3hRxEYQVXLAkISGBrKysKmc+dDkKp5/VoT4a\nQQ3nmKsLFoQZzpw9e5aaNm1Kffr0KXtxCg18Q548eZKsra05map19OhRatu2Laet4evXr5Orqytn\n5RVQgz5hkUhEPXr0oKVLl3J3XXJKTEyknj17Us+ePblvkat5VkhuajjHXJ2wIMxwSiAQ0MaNG8nM\nzIxmzpxJ79+/L/oCDX5D+vn5UZs2bejTp08KlSMWi6lNmzYUHBzMUc2kC43UrVuX+xHSajA6esmS\nJeTm5qbylK/S0s8alBWSmZrOMVcnLAgzSpGamkrTp08nCwsL2rx5s3RBBQ1/Q0okEho7diwNGzZM\n4RHTp0+fpubNm3P6YW5lZUVv3rzhrLwCnp7lZy3KymZ4ecl96vPnz5O1tXXlrY1dApFIRD///LNy\n0s8amBWSiQr/djQFC8KMUj169Ih69uxJLVq0oOQvv9T4N2ROTg516tRJ4dSoRCKhTp06cTbgi4io\nV69enPc1E5HKbp7i4+PJ0tKSwsLCOL6giktISChIP3N+I6DBWaEKUYMsiiZgQZhROolEQqd276Yc\nRd6MavSGTEpKInt7ewoMDFSonMuXL1OjRo1IIBBwUq9Zs2bRb7/9xklZxVRywBAKhdStWzfy9fXl\n+EIq7uLFi8ob/azhWaEKUYPxBJqAzRNmlE5LSwsDUlNRW1dX0YKAvXs5qZMieDweTpw4ge+++w4R\nERFyl+Pm5gZ7e3vs37+fk3o1b94cT5484aSsYqZPB9asAfT1pb+HsmhpSV+3Zo30ODksW7YMOjo6\nWLx4sVzHK0IsFmPp0qUYO3YsDhw4gGXLlkFbW5vbk6jhUqCcU7M55mpL1XcBTDWhJlNduBQcHEy2\ntrYUHx8vdxm3bt0ie3t7ys3NVbg+t27dovbt2ytcTpnCwymzd2/KAShXW7t4q6UC+1eX59y5c2Rj\nY0PJyckcVrxi8tPPbm5uyuuHri5pWjWaY67OWEuYqRyZmdyUk57OTTkc8PLywtSpUzFkyBDkyNmq\n6dy5M1q0aIEdO3YoXB9nZ2c8e/YMEolE4bJK1b49trq7w9XKCs+9vYExY4CBA6X/+voCsbFAcDDQ\nvr1cxcfHx2P8+PE4ePAgLCwsOK582S5duoR27dqhe/fuuHDhAiwtLZVzIi6yOWqSFSqTkRE35Rgb\nc1OOulL1XQBTTVTBljCRtL97xIgR5O3tLff0oHv37pGVlRVlZWUpXB9bW1t6/fq1wuWUpUOHDqSn\np8fZ5hb5hEIhde3alVasWMFpueUpPPr58uXLyj9hFX0v5IuOjqZff/2V1lpaUrai18j6hBmZsDVR\nS9eqFaBon7CeHtCyJTf14YiWlhZ2796Nly9fYuXKlXKV0bZtW3Tu3BmbN29WuD7K3tYwMTERT58+\nRZ8+fWBgYMBp2UuWLIGenh4WLlzIabllSUxMRK9evXDz5k3cv38fbm5uyj9pFcwKxcTEwN/fH+3a\ntUOXLl0QHx+PTgEB0FX0PU8EjB/PSR3VlqrvAqqEqjzZnitVvB8sPj6ebG1t6dixY3Id/+TJEzI3\nN6fMzEyF6jFnzhxavXq1QmWUZdu2bWRtbc3p1CoiojNnzlR6P3D+6GdfX9/KXQikirSEY2Njae3a\ntdSxY0cyMzOjKVOm0OXLl4v+LNk84XKxIKyoqj7ZnksKvCFFAL3t2FGt9zEODw8nMzMzevDggVzH\njx49mn755ReF6rBr1y4aPXq0QmWUpU+fPqSrq0sZGRmclRkbG0s8Ho+uXbvGWZllEYlEtGTJErK2\ntq6c9PPnNHjqTnx8PG3cuJE6d+5MJiYmNHHiRDp//nzp0+yqw1QsBbEgrIiqPtmeawq8IXO0tWlY\n/frk5uZW9rrUKnbkyBFycHCgpKQkmY+Njo4mU1NTSktLk/v8d+7coTZt2sh9fFk+fPhAenp61Lt3\nb87KFAgE1LlzZ1q5ciVnZZYlISGBevToQe7u7ipbhSvlyRMSfD6yXI2zQklJSbR582bq1q0b1atX\nj8aOHUunT5+u+K5p7HOyTCwIy4vd4clHjjekRE+PgtzcyMzMjDw9PcnU1JRmz57NaWuMSz///DN1\n6tRJrmlHkydPpoULF8p97vxAqYz0alBQEFlYWNCuXbs4K3PBggXUr18/hZcBrYgLFy6oJv38/xIT\nE2nu3LlkbGxMDxo0IIkap2lTU1Np27Zt5O7uTkZGRjRy5Eg6ceKE/FPpWMawVCwIy4v1dchPzjfk\ns2fPqF+/ftSoUSPq06cPWVlZ0b59+yrlA1wWYrGYhg4dSmPHjpU5ff7mzRsyMTFRqG/UwcGBoqOj\n5T6+NHw+n3R1dendu3eclHfq1Cmys7Oj1NRUTsorjarTz/Hx8TRr1iwyNjamGTNmUFxcnFrexL9/\n/5527dpFffv2JUNDQxo+fDgFBwdTdnY2NycID5d+7unqStPpha+JoznmmogFYXlU8UFGlUKBN+Tp\n06epcePG1KlTJ2revDl17tyZ7t+/r4KLKN2nT5+oTZs25C9Hv92MGTPohx9+kPvc/fv3p5CQELmP\nL4lAICADAwPq0qULJ+W9efOGLCws6MaNG5yUVxpVpp/fvn1L33//PRkbG9Ps2bOLb32oBmnajIwM\n2rdvHw0YMIAMDQ3Jy8uLAgMDFd4prEwpKdL+7DFjpAtxjBkj/bqafh6yICwPDR5YoXbkfEPm5eXR\n2rVryczMjHr16kVmZmY0ffp0hfpTuRYbG0vW1tYUGhoq03GJiYlkYmJCb9++leu88+fP53yu7cWL\nF8nU1JS2bt2qcFkCgYA6deqk1FHcRKpLP8fExNC0adPI2NiY5s2bV/b4ABWkaT98+EAHDx6kwYMH\nk6GhIQ0aNIgOHjxIHz58ULhsRnYsCMujikwxqAqSk5NpypQpZGFhQT169CBzc3Patm2byveezffX\nX3+Rubk5PX78WKbjFixYQNOmTZPrnHv37iVvb2+5ji3NtGnTqHbt2py0JufNm0f9+/dXWjdC4fRz\nZe7A9Pr1a5o8eTKZmJiQj48PpVS0ZVcJadpPnz5RUFAQDR06lAwNDal///60b98+Sk9Pl7tMhhss\nCMuDrYmqdu7fv0/dunWjxo0bU4sWLahdu3b0119/qbpaRER04MABatCgQcU/lIno3bt3ZGpqSq9e\nvZL5fOHh4dSqVSuZjyuNRCIhMzMzateuncJlnTx5Uqn9wPHx8dS9e3dyd3eXa4S6PKKjo2nChAlk\nYmJCP/30k/x95hynabOzs+nYsWPE5/PJyMiI+vTpQ7t27VKrbBHDgrB8OGoJ32/Rgi5fvkw5OTmq\nvqIqQSKRUFBQEDk4OFCHDh3I3Nycxo8fX2kfxmXx8fGhbt26VXxaBxEtXbqUxo0bJ/O5Pn36RLq6\nuiQUCmU+tiQRERFkaGhIGzZsUKicmJgYsrCwoFu3bnFSr89duHCBLC0t6ZdffqmUTMg///xDY8eO\nJVNTU1q6dCm9f/9e6ecsT25uLp08eZJGjRpF9erVIzc3N9q2bZtMN4BM5WJBWB4c9AmLdHToTM+e\n9MUXX1CdOnXIzc2NVqxYQbdv3+Zsf9nqKjs7m5YvX04mJibk6upKpqamtGHDBs6CkjzEYjENGjSI\nJk+eXOER0xkZGWRmZkbPnj2T+XyOjo70/PlzmY8ryaJFi0hXV1fuPmoiaR++q6urXAPVyiMUCumn\nn36qtPRzVFQUjRw5kszMzGj58uUqnyqXl5dHZ86coXHjxpGxsTF169aNNm3apLJ50IxsWBCWB8ej\nozMzMyk0NJRmz55NLi4uZGhoSAMGDKC1a9fSgwcP1G4KjqZ4+/YtjRo1ing8Hjk7O1Pz5s3pypUr\nKqvPhw8fqGXLljK1KFetWkXDhw+X+VweHh4UHBws83EladCgATk7OytUxpw5c2jgwIGc/y3np597\n9eql9IzH48ePic/nk7m5Oa1cuVLhJUYVIRQK6cKFCzRp0iQyNTWlzp0704YNG6TTnxiNwoKwvJQ4\nTzglJYWCgoJo2rRp1LhxYzI1NaVhw4bRli1b6Pnz52q9dKM6yt9nt3HjxsTj8WjEiBEKteoU8e+/\n/5KlpSWdPXu2Qq//9OkTWVpa0sOHD2U6j4+PD/n6+spTxSJevXpFenp6Co1kDgkJIQcHB877Is+f\nP09WVlZKTz8/fPiQhg4dSjwej/z8/DjfPaqiRCIRhYWF0dSpU8nc3Jw6duxIa9asoTdv3qikPgw3\nWBCWVyVOto+NjaV9+/bRuHHjyNbWlmxsbGjMmDG0Z88e9gasILFYTHv37iVLS0tq1aoVGRsb0+rV\nq+VfAUgBN27cIHNz8wqnmTds2ECDBg2S6RwHDhyQqwX9uTVr1pCurq5cA8SIpCOGzc3NOR0kVzj9\nrMzMxr1792jw4MFkaWlJa9euVe7c2VKIxWK6fv06fffdd8Tj8aht27a0evVqpW9XyVQeFoQVoYLJ\n9hKJhF68eEEBAQE0fPhwMjMzo4YNG9KUKVPoyJEjlboLjSb68OED+fj4kLGxMTVt2pQaNWpE586d\nq/R67Nq1ixo1alSh1mFOTg7Z2trSnTt3Klz+/fv3qXnz5opUkYiIWrVqRY6OjnIdm5eXRx06dKC1\na9cqXI98lZF+vnv3Lg0cOJCdDAV8AAAgAElEQVSsra1p48aN3K0YVUESiYRu375Ns2bNImtra2rV\nqhWtWLGCXrx4Uan1YCoHC8KKUvGaqGKxmCIjI2n9+vXk4eFBRkZG1KJFC5o1axadOHGCzQMsxcuX\nL2nIkCHE4/GIx+PR4MGDK711MWfOHHJzc6vQQLxt27bJtHFCdnY26erqKjTILzU1lXR0dGjp0qVy\nHT9r1iwaNGgQZ90n58+fJ0tLS1q+fLlS0s+3b9+mfv36ka2tLW3atKlSZy1IJBL6+++/ae7cuWRv\nb0/NmjWjZcuWUVRUVKXVgVENFoS5oEZrogqFQrpz5w6tXLmSevXqRQYGBtShQwfy8fGhCxcuUFZW\nltLroEkuXrxIzs7O5OjoSEZGRrR06dJKa/mIRCL66quv6Ntvvy33tQKBgBwdHenq1asVLt/JyUmh\nHad27dpFurq6co3OPnbsGGf9wEKhkBYvXkw2NjZKST/fuHGDevfuTQ4ODhQQEFBpXRQSiYTu379P\nP/74IzVo0ICcnJzop59+osePH7NxH9UIC8JcUsM1UXNzc+nq1au0ZMkS+vLLL6lOnTrUrVs38vX1\npRs3bsg0b7WqEgqFtHnz5oLUvp2dHR0/frxSPggzMjKoWbNmtHnz5nJfu2/fPurSpUuF6zVkyBAK\nCgqSu25du3Yla2trmY979eoVmZuby5Q+L018fDx169ZNKennK1euUM+ePalBgwa0Y8eOSnkvSCQS\nioyMpMWLF5OTkxM1aNCAfHx86MGDByzwVlMsCFczHz9+pLNnz9K8efOobdu2VLduXerbty/5+/tT\nRESE2iz3qAppaWk0Y8YMqlevHvF4POrduzdnc23L8vLlS+LxeHTp0qUyXycSiahp06YV7sNevHgx\n/fzzz3LVKSsri3R0dGj+/PkyHZebm0vt27en9evXy3XewpSRfpZIJHTp0iXq1q0bNWzYkPbs2VMp\n8/KjoqJo2bJl1KxZM7K3t6d58+ZReHg4C7wMC8LVXVpaGh07doy+++47atasGRkbG9OQIUPof//7\nHz19+rRafkg8efKEevXqRTwej+rWrUs//vij0qelhIWFkYWFRbmDb4KCgqh9+/YV+r0cOnSIhg4d\nKld9jh8/TrVr16ZHjx7JdNyMGTNoyJAhCv3dKCP9LJFI6Ny5c9S5c2dq3Lgx7d+/X+mLt7x48YJW\nrFhBLVu2JBsbG/rhhx/or7/+qpbvKaZ0LAgzRSQkJNDBgwdp4sSJ5ODgQDwej7y9vWnnzp3ValqE\nRCKhEydOUIMGDcjGxoYsLCzo8OHDSv0ADQgIoCZNmpQ5mE4sFpOLiwsdP3683PIePXpETZs2lasu\nHh4eZGZmJtP1/vnnn9SgQQOFlm/MTz/37t2bk/SzRCKh06dPk6urKzVr1owOHTqk1GzP69evafXq\n1dSmTRuytLSk77//nm7cuMEW3GFKxYIwU6bXr1/Tzp07ydvbm3g8HtWvX58mTpxIBw8eLL4/ahWU\nm5tL/v7+ZGRkRObm5vTll19SZGSk0s43Y8YM6tu3b5mttNDQUGrRokW5H+y5ublUu3ZtmQcaCYVC\n0tPTk2kXp5cvX5KZmRn9/fffMp2rsPz084oVKxQOWvk3Ue3ataMWLVpQUFCQ0gLhmzdvaM2aNQXr\nlU+bNo3CwsKqddcOU3EsCDMVJpFI6OnTp/S///2PhgwZQvXq1aNmzZrRd999R8eOHavSu7MkJibS\nhAkTyNDQkAwMDOj7779XyvQvoVBIvXr1oh9++KHU10gkEnJ1daVDhw6VW17Tpk1lvmm4evUq1a5d\nm8IrOJo/JyeH2rZtSxs3bpTpPPkKp59lGf1dErFYTMeOHaPWrVuTi4sLBQcHKyX4xsXF0YYNG6hT\np05kampKkydPpgsXLqh0fXJGM7EgzMhNJBJRREQE+fv7U9++fcnAwIDatm1L8+bNo7Nnz6pseT9l\nioiIoI4dO5KpqSmZmJjQ7t27Of+Qf//+PTVu3Jh27NhR6msuXrxITk5O5X7oDx06lA4fPizT+ceM\nGUNGRkYVTkV/99135OXlJVeqvnD6WZGFZsRiMQUFBVHLli2pbdu2FBISwnnXQVJSEm3atIm6du1K\nxsbGNH78eDpz5gzbcIVRCAvCDGfy8vLoxo0b5OvrS926daM6derQl19+SUuWLKGrV6+qZIlIZZBI\nJHT48GHi8XhkYmJCrVu3rnCrsaL++ecfMjc3L7VlKJFIqEePHrR79+4yy/n5559p8eLFFT6vRCIh\nY2NjGjVqVIVeHxgYSI6OjnJlBc6dO6dw+lkkEtHhw4fJ2dmZOnToQKdOneI0+KakpFBAQAD17NmT\n6tWrR6NHj6aTJ09Wmb9lRvVYEGaUJisriy5cuEA+Pj7UoUMHMjAwoF69etHKlSvp7t27Gp+6y8rK\nop9//pkMDAyoTp06NGHCBE43q79w4QLxeLxS122+ceMGOTg4lBkQAgMDaciQIRU+Z2RkJNWqVYtu\n3LhR7mujo6PJzMyMIiIiKlw+kTT9vGjRIoXSz0KhkA4cOEBNmjShTp060blz5zgLvmlpabRz507q\n3bs3GRkZ0YgRI+jYsWOVvnwlU4bkZOmWsqNGSddkGDVK+rUG7pvMgjBTadLT0+nEiRM0a9YsatGi\nBRkZGZGHhwetX7+eIiMjNXYE6Zs3b8jLy4sMDAyobt26tGnTJs4G5fzvf/+j5s2bl7ptXr9+/cpc\n6OPJkyfk5ORU4fPNnDmT9PX1y/1d5OTkUOvWrWnTpk0VLptI2pfatWtXudPPQqGQ9u7dS05OTtSl\nSxe6ePEiJ8E3IyOD9u7dS1999RUZGhrS0KFDKSgoiK0wp27+/lu6g52ubvHtZPNXJ/T0lL5OQ7Ag\nzKhMUlISHTlyhKZMmUINGzYkc3NzGj58OAUEBFB0dLTGzae8fv06NW3alAwNDalx48Z08+ZNhcuU\nSCQ0depUGjhwYImBPSIigqytrUttpeXl5VHt2rUrvA6ytbU1DR48uNzXTZs2jb7++muZfkf56edf\nf/1V5hsugUBAO3fuJEdHR+rRowdduXJF4b+PDx8+0B9//EEeHh5kaGhIgwcPpkOHDlXJsQxVgorX\n6VcWFoQZtRETE0N79uyhMWPGkLW1NdnZ2dG4ceNo3759Ktv/V1YikYh27NhB9erVI319fRo2bJjC\nU7kEAgH16NGj1NWrPD09ac2aNaUe37x5c3rw4EG554mNjSVtbW26ePFima87fPgwNWzYkDIyMsot\nk6ho+vnatWsVOiZfbm4ubdu2jerXr0+9evWS+fjPffr0iY4cOUKenp5kaGhIAwYMoP3791f4WhgV\nUcGOdZWFBWGmbCrqe5FIJPT8+XPasmULDRs2jExNTalx48Y0bdo0CgoK4rTvVRkyMzNp1qxZpKen\nR/r6+uTn56fQKNp3795Rw4YNae/evcWee/z4MVlYWNCHDx9KPHb48OH0xx9/lHuOZcuWUe3atcvs\nq//nn3/IzMyM7t27V6F656ef+/TpI1P6OScnhzZv3kx2dnbUt29funXrVoWP/Vx2djYdPXqUhg8f\nToaGhtS3b1/avXu3QouKMJWoEvduVwUWhJmSqVnfi1gspgcPHtDatWtpwIABZGhoSC4uLjR79mwK\nDQ0ttc9U1V68eEE9e/YkPT09srW1LbeVWZanT5+Subl5iQFp5MiRtGLFihKP8/X1JR8fn3LLd3Jy\nInd391Kfz87OJhcXF9pSwdaFPOnn7Oxs2rhxI9nY2NCAAQPk3gQiNzeXQkJCaOTIkWRkZETu7u60\nfft2tb95Y0rg6Vl+Crqs1LSXl6qvoEwsCDPFaUDfi0AgoNu3b9OKFSvIzc2N6tSpQ1988QUtWrSI\nLl26pHYjWc+ePUu2trakq6tLffr0oTdv3shVzunTp8nKyopiYmKKfP+ff/4hU1PTElt3R48eJQ8P\njzLLff/+PWlra5e5HOaUKVOIz+eX2xcrT/o5KyuL1q1bR1ZWVjR48GCZR1wTSfu/T506RWPHjiVj\nY2Pq3r07bdmyRaH5x4yKJScXbwTI+tDVVetR0ywIM0VpaN9LdnY2Xb58mRYvXkydOnWiOnXqUM+e\nPWn58uV069YttVhQQSAQ0Nq1a0lfX590dXVp8eLFcs03Xbt2Lbm4uBQbQDRx4sQS5wQ/e/aMHB0d\nyyzz999/p1q1apW6nd/BgwfJycmp3IyDrOnnjx8/kr+/P/F4PPLy8qpQ33VhAoGAzp07RxMnTiQT\nExP68ssv6ffff6f4+HiZymHUlJ+f4kFYT0+6payaYkGY+U8V6nvJzMykU6dO0Zw5c6h169ZkaGhI\n/fv3pzVr1tD9+/dVOh0qNTWVRo8eTTo6OmRmZkYnTpyQ6XiJREITJkygIUOGFLmOmJgYMjExoZTP\n7vqFQiHp6uqWOd2mdevW1KlTpxKfe/78OZmZmZUbIM+ePVvh9POHDx9o1apVZGFhQcOHD5dpaU2R\nSESXLl2iKVOmkJmZGbm6utK6desoNja2wmUwGmLUKMUCcP5jzBhVX0mpWBBm/lOF+15SU1Ppzz//\npOnTp1OTJk3I1NSUhg4dSps3b6Znz56pZDpUZGQkubi4kI6ODrm6utLLly8rfGxubi516dKlWMv3\nu+++ozlz5hR7fatWrUpN8ebk5JC2tjbt27ev2HNZWVnUsmVLCggIKLUuQqGQFi5cSLa2tuWmnzMy\nMmj58uVkZmZG3t7e9OTJkzJfn08kEtG1a9fo22+/JR6PR+3atSN/f3/6999/K3R8lVKFFqooTCwW\nU0pKCkVGRtKFCxdo//79FN2sGTdBeOBAVV9eqVgQZqSqQd9LYW/fvqX9+/fT+PHjyc7OjqytrWn0\n6NG0e/fuYv2tyiSRSCgoKIhMTEyoVq1a9O2331Z4gYjk5GSqX78+HTx4sOB7CQkJZGxsTHFxcUVe\n6+3tXeLIaiJpqllbW7vEucSTJ08mb2/vUm9S4uLiqEuXLtS3b99iLfDC3r9/T8uWLSNTU1MaM2YM\nPXv2rNzrE4vFdOvWLZo5cyZZWVmRi4sLrVy5kqKjo8s9tkpSs8GSFSGRSOj9+/cUFRVFV65cocOH\nD9P69evJx8eHxo8fT/369aM2bdqQlZUV1axZk0xNTal58+bk7u5OI0eOpIimTat8S1iLiAhM2VJS\ngL17gchIIDMTMDICWrUCJkwAzM1VXTtu+PsDS5cCubnyl6GnB/j6AvPnc1evSkBEePXqFcLCwgoe\ndevWhbu7O9zc3NCzZ0/weDyl1iE3Nxe+vr5Yt24ddHV1sXnzZowaNQpaWlplHhcZGQl3d3ecPn0a\nHTt2BADMnz8f2dnZ2Lx5c8Hrfv31V2RmZsLf379YGd26dcPHjx/x4MGDIt//448/sHz5ckRERKBu\n3brFjjt37hwmTJiAmTNn4scff0SNGjWKvSYtLQ0bNmzAli1bMGjQICxatAhOTk6lXg8RITw8HIGB\ngfjzzz9haGgIPp+P4cOHo0mTJmX+LKq0rVuBefOAnBxpWCmNlpb0fbhmDTB9utKq8+nTJyQlJSEp\nKQnJycml/j85ORm6urrg8XiwtLSEpaVlqf+3sLBArVq1ip6oOnwuqfYeQM1p4J2n3KpB30tFSSQS\nioyMpA0bNtCgQYPIyMiImjdvTjNnzqSQkBClbGGYLz4+nvr27Us1a9YkZ2fnCqVrT5w4QTY2NgUL\nmqSmppKJiUmRVO3x48epf//+xY4Vi8Wko6NDv//+e5HvR0VFkZmZGT169KjYMRVJP6emptLChQvJ\nxMSEJk+eXOr610TSn/e9e/dowYIFVL9+fWrcuDEtWbKkwqnqKq+SBkvm5ORQTEwM3blzh0JCQmjb\ntm3k6+tL06dPJy8vL+rcuTM5OjqSvr4+6enpkaOjI3Xq1Ik8PT1p+vTptGzZMgoICKCQkBD666+/\n6N9//1V8lkI1yNCxlnBp1OzOU+k8PIBTpxQu5qKuLpa2aQN7e3vY29vDzs6u4P/29vYwMTEpt3Wn\nbkQiER48eIDLly8jLCwMf/31F5o2bVrQUv7yyy9Rp04dTs95+/ZtjBw5EvHx8fj6668REBAAQ0PD\nUl+/evVqHD16FNevX4e+vj5+/vlnxMXFYffu3QCA6Oho9O7dGzExMUWOO3/+PPr3748PHz4UXEN2\ndjZcXV0xc+ZMfPPNN0VeHxcXB29vb9SpUwcHDhyA+WeZoJSUFKxZswY7d+7E8OHDsXDhQjg4OBSr\nLxHh8ePHCAwMRFBQECQSCfh8Pvh8Plq1aqVxfyNKEx4O9OgBZGfLfqy+PkSXLyPZzq7U1mrhr3Ny\ncirUYuXxeDAwMKi835GXFxASUvbncGm0tABPTyA4mPt6cYQF4ZLkB2BZ/vD19TU7EI8eDRw8qHAx\nWV5eeDhnDmJjY0t8CASCIkH584etrS1q167NwQUpT15eHu7cuVOQun7w4AHatm1bEJRdXV2ho6Oj\n8HkkEgkCAgIwf/58EBFWr16NGTNmlPjhR0QYO3Ys8vLyEBgYiMzMTDg5OeHWrVto3LgxxGIx6tat\ni5SUFBgYGBQcN2DAALx8+RL//PNPwfcmTZqEvLw8HDhwoMi5yko/JyYmYs2aNdizZw9GjhyJH3/8\nEXZ2dsXqGRUVVRB4c3JyMHz4cPD5fLRt25YF3pIoEIDEAE5oaeH7cgJq/v/r1aunnr8DBW9EcO0a\n0L4959XijApb4eqpCk3TkUklzcfLzMykJ0+e0JkzZ2jbtm20ePFiGjNmDHXv3p0aNGhAOjo6xOPx\nqEOHDjR06FCaPXs2rV+/noKDgyk8PJySk5PVbmOHjx8/0rlz52j+/PnUrl07MjAwoD59+pCfnx+F\nh4crvKPSx48fafz48aStrU329vb0119/lfi6nJwccnV1JV9fXyIi+vXXX2nEiBEFz7dp04bu3r1b\n5Jg6deoUvJ6IaN++fdSkSZMic5CFQiH5+PiQra0tXb9+vcjxcXFxNHPmTDI2NqaZM2cWGxBGJF1I\n5JdffqEWLVqQra0tzZ49m+7cuaN2v0dVKjyAKSwsjA4dOkQBv/xCAm1thd6TEjVPxVaYhq5fUBGs\nJfy5Kp76KFVKCuDgoNgACF1dIDZWocFqYrEYycnJpbak3759i0+fPhVJc3+e8razs4O+vr7816Gg\n9PR0XLt2rSB9nZCQgO7duxe0lJ2dneVqcbx69Qp8Ph8PHjxAr169cPjwYZiYmBR5TVJSEjp27Ii1\na9fiq6++QqNGjXDhwgW0atUKY8aMQc+ePTFx4kQAQEREBDp27Ii0tDQYGxsjKioK3bt3R1hYGFq2\nbAmg9PTz27dvsXr1ahw+fBgTJkzAvHnzYGVlVVCP169fF7R4k5KS8PXXX4PP56NTp04lDuCqioio\nYABTWYOX8v/V09Mr0kIdGReH/n//jVoikfyVUPdBSbKool2ELAgXpiaBSGU05AYkOzsbb9++LTNQ\n161bt9SUt52dHSwtLSstGCQlJeHKlSsFQTk7Oxs9e/YsCMoNGjSQKSifPHkSEydOxIcPH+Dj44Nl\ny5YVuZYHDx6gT58+OH/+PK5du4br16/j+LZtuDJuHAxjYtCuUSPAyAgHHz/GmrQ0PIiLQ1ZWFjp2\n7Ii5c+cWBOmzZ89i4sSJmDVrFhYsWIAaNWogJiYGq1evRlBQEL755hvMnTsXFhYWAIA3b94gKCgI\nQUFBiI2NxdChQ8Hn89GlSxdoa2tz+0NVoZycnCLBs6zgCgBWVlblpoN5PB50dXUBSIN3dnY2MGYM\n6hw/rniFx4wB9u9XvBx1EBEBrFoFnDkj/czJyfnvOT096WdX//7AwoXqnYIuhAXhwqrDcPiyVJG+\nF4lEgtTU1DIDdXp6OmxsbMoM1CVNy+HCv//+W2Q6VO3ateHm5gZ3d3f07NkT1tbW5ZYhFouxdOlS\n+Pv7w8jICAcOHEC/fv0Knj969CjmzJmDv37/HZHe3ugrkUACoKZAUPCabAC1tLVRa9Ag+AoEeGVi\ngn379kEsFmPJkiX4448/cOjQIXTt2hWvX7/GypUrcfz4cUydOhVz5syBmZkZ4uLi8OeffyIoKAgv\nX76Ep6cn+Hw+unfvjpo1ayrhp6ccQqEQKSkp5U67SUpKQm5ubrn9q/lTbogI79+/L/eRlpZW5Gtt\nbW2cIEJvRT6L8g0cCISGKl6OOklNlU4bffwYSE8HjI2Bli2B8eM1rgHEgnBhHA1O0ug7z2oyKC03\nNxdxcXEltqLz/1+7du1SU9729vawsrJSONAQEZ4/f46wsDBcvnwZV69eBY/HKwjKPXr0KJZyLuz9\n+/cYOXIkLly4gA4dOiA4OBi2trYAgFMDB8L97FnUJkKNMt7mEi0t5AGosX49UocOhbe3NwwMDLB/\n/35kZGRg5cqVCA0NxbfffosffvgBeXl5OHr0KIKCghAVFYXBgweDz+fDzc2t+DxPFRKLxXj37l2F\nRgZ/+PABZmZmRYJoflC1sLCAgYEBateujZo1a0IgECA9Pb3cYJqeng5dXV2YmJgUPExNTYt8XdLD\n2NgYenp67POommBBuDCOpuncqFcPi1u2hK6ubqmP2rVry/Vc4edr1qypnNGMVbTvRRb5LZjSWtKx\nsbF49+4dLC0tS2xF5//fyMhIpt+RWCzGo0ePCoLyrVu30KhRo4Kg3LVr1yKjm/NFRERg+PDhePPm\nDb755htsatEC2j/+CC0ZbqZEtWtjkY4OTBYtwqBBg7Bq1SqcPXsWM2bMgLe3N8LCwhAYGIiHDx/C\nw8MDfD4fvXv35mQkeEUREdLT08sMqPn/f/fuHYyNjQsCqoWFBerVqwcDAwPo6emhVq1aqFGjBogI\neXl5xQJrfkDNzMyEgYFBiQGzrKBqbGys2M+mumfmqgkWhAvj6M4z9auv8MzHB7m5uQWPvLy8Il9/\n/pDneYlEorQAbxEbC6ejR2F69y6gpYUaeXkF10e6ugV9L1qLFqlFCloVBAIBEhISSg3Sb968gZaW\nVplTsmxsbMpsPQoEAoSHhxcE5YiICLi4uBQE5S+++KKgLxEAtm7dikOzZ+N8Xh7kGZom0tHB0h49\nsOPBA3zzzTfg8XgIDQ1FeHg4+vfvDz6fj759+xY5p6IKD2AqLx2ckpICPT09mJubw9jYGHXr1kWd\nOnUKWqmA9EZGIBAgOzsb6enpBcH006dPMDIyKrMVWlJQrVevnmpS69V9jEo1wYJwYRp25ykSiQqC\nszKCfG5uLnQ/fkSfxEQ0zMpCHaEQ6USIBLCXCPECAWrVqsX5DYAszystG8ABIkJmZmap6e7Y2Fgk\nJibC3Ny8zEBdeIGT7Oxs3L59uyAoR0VFwdXVtSAot2vXDlpDh0Lr5EnIM+xMDCDc2hpLnJ3x999/\no2/fvuDz+fjqq69kHnFeeABTSQE1MTERCQkJSElJQY0aNWBkZFRiK1UkEiE3NxdZWVnIyMhATk5O\nuSndkoKqkZGR5o3M1pDBkoz8WBAujN15yoSIIBAIlHoTUN7z+dkAZQT4ij6nyAe7SCRCYmJiqaO8\nY2NjkZeXV2rK29jYGK9fv8bNmzdx+fJlZMfEICorCzoSidx1EtSogdNbt6L3yJHFUt8CgaBgAFNy\ncjISExML6hkfH4+kpCS8e/cO6enpEAqFxVqpEokEeXl5yM7OhkQigbGxMUxNTWFmZlbhoFq3bl21\nvfHiXBUZLMmUjgXhz7E7T42Snw1Q1U1AXl4eatasqdT+f4lEgoyMDLx//x7v3r1DampqQUsyLi4O\nCQkJMDY2hr29PaZ//IiRL16gtgJBWFizJkLatMFec3OkpqYiLS0NGRkZ+PTpE4RCYbFWKgAYGBjA\n0NAQJiYmsLCwKOiHLavPtE6dOtUnmCqimgyWrK5YEP4cu/NkZJCfDVDVTUBubi5EIhF0dXVRq1Yt\n7MjNBV8oVPi6gvX14duwIczMzMDj8WBtbQ07OzvY2dkVa7Xq6elx8JNkysQGS1ZZLAiXhN15MhpE\nLBYXBGm94cOhd/mywmU+adAAF77/vkgK3MLCQvP6VKuSKrhQBcOCcOnYnSej5rKysvD48WM8fPgQ\nDx8+xKNHjzAzPBzeYrHCZUe1a4cdXbsW6aPOzMyEra1tmQuccL2bFFOCKrRQBcOCcNnYnSejBogI\niYmJRYLtw4cP8fbtWzRr1gxNmzaFtrY24uLi0OX2bSwSCKCrwNs6G8AZV1fYrF+PL774oqDfNicn\np8QFTgo/6tSpU+ZI78pcLpRhNAELwhXB7jyZSiIUCvHPP/8UCbYPHz4EALRu3RqtW7dGq1atYGRk\nhKdPn+LMmTN49OgR3Nzc0Lt3b2T9+y9mrl0LRWbxCmrUQMNatfBRVxd6enoYPXo0RowYUe52g0SE\n1NTUMoN0/nKhDg4OpbamS1qMhGGqKhaEGUZFMjMzERkZWaSFGxUVBTs7O7i4uBQE3datW8PU1BQ3\nb95EaGgoTp06hby8PAwcOBAeHh5o0aIFduzYga1bt6JXr14ISEmB4dWrZS5VWRoxgLh27VD71Cns\n2bMHmzdvhkgkgkQiQd26deHt7Q0+n48WLVrINbK5tOVCCz/09PTKbU1XpQ0hmOqNBWGGUTIiQmxs\nbLF0ckpKClq0aFEQaF1cXNCyZcuClmBaWhrOnj2L0NBQXLhwAU5OTvDw8ICHhwdcXFzw9u1brF27\nFgcOHMDXX3+N+fPnw9HREfu+/x78rVvlWjFLrKuL0ba2+NikCbZt2wYrKytcunQJAQEBuHjxIhwd\nHZGSkgJjY2OMGDECfD4fTZo04fRnlZaWVuYqZO/fv4e1tXWZgVpZm28wDNdYEGYYDuXl5SEqKqpI\nsH306BH09PSKBNvWrVujUaNGRVp0+Zs5hIaGIjQ0tCDN7OHhgf79+xfs1/vs2TP4+fnh5MmTmDRp\nEmbPng1ra2t8+PAB48aNQ3JyMs4MGgSDpUuL7JpUHomuLmqsWwfBpElYuXIltmzZgt9++w1jx46F\nlpYWEhMTsXv3bmzfvlenr54AACAASURBVB36+vqwsbHB06dPwePxCgJygwYNOP+Zfi4vL6/c1rSO\njg7s7e1LTXtbWVmx1jSjFlgQZhg5paWlFem3ffjwIaKjo9GwYcMi6WQXF5eCPXc/JxQKcf36dZw6\ndQqhoaFF0sw9e/YsMgc3PDwcq1atwq1btzBjxgx89913MDY2BgBERUXB09MT7u7u2LBhA54/f479\nnTvDXyyGVl4etMraRQnSfmB/Hg9zo6MLRjg/fPgQ48ePh42NDbZv3w4bGxsA0ilR58+fx7Zt23D9\n+nV0794dOjo6uHr1KurXr48RI0Zg+PDhBbs5VbaKbr5hZWVVZmva0NBQJfVnqhcWhBmmHBKJBK9f\nvy6WTv7w4QNatWpVJNg2b9683MUrykszF+5rJSJcvnwZq1evxosXLzBv3jxMmjSpyFSg4OBgTJ8+\nHf7+/hg/fjwyMjLQvn17LF++HN5OTnjI58M5JgYSoiKjpvNq1EBtHR3k9eoFj1u3oNulC4yNjbF3\n796COggEAqxatQqbN2+Gv78/xo0bV6R+cXFx2LVrF3bu3Alra2t069YNKSkpOHXqFJydncHn8zFs\n2DBYWlpy9evghEAgQHx8fLFUd+Gva9asWWaQtra21qg9kxn1xIIwwxSSnZ2NJ0+eFAm2kZGRMDEx\nKZZOrl+/foWm25SWZh44cCAGDBhQkGYuTCKRICQkBKtWrcKnT5/w448/YuTIkUW2xhOLxVi8eDGO\nHDmC4OBgtGvXDhKJBIMHD4ajoyM2btyIrKws2Nvb45shQ9A9JgZf2dgA6en4WLMmNly+jCWvXgHm\n5ti+fTv27t2LzMxMzJkzB5MmTSpSn9JaxflEIhHOnj2LgIAA3LlzByNGjICzszPu3LmDU6dOoW3b\ntuDz+fDy8oKZmZmcv53Kk79lYlmt6ZSUlHJb00ZGRqq+FEbNsSDMVFtJSUnF0skxMTFo2rRpkXRy\nq1atYGJiIlPZsqSZCxMIBDh48CD8/PxgaGiIhQsXYvDgwcWC/bt37+Dt7Q0iwpEjRwoC24oVK3Du\n3DmEhYVBR0cHu3fvRkhICFJTU7FixQq4u7sDkAYZMzMzPHnyBFZWVhCLxXB1dQWfz4e/vz8uXboE\nFxeXYte0cuVKbNq0qaDVXdII6Tdv3mDnzp3YtWsXHB0dMXHiROjr6+P48eM4d+4cOnfuDD6fjyFD\nhqBevXoy/VzViVAoLNaa/rxlXaNGjXJb02VtZclUfSwIM1WeSCRCdHR0sXSyUCgs1nfbrFkzuTdi\nlyXN/LmsrCzs3LkTa9euRZMmTeDj4wM3N7cSj7l//z6GDh0KPp+PFStWFKREz58/j4kTJyI8PBzW\n1tYAgI4dO2LBggUYP348UlNTiwT/Pn36YObMmRg4cCAA4O7du/Dy8sIvv/wCPz8/RERElNgv+ujR\nI4wfPx6WlpbYsWNHqX2/QqEQp06dQkBAAO7fv48xY8Zg1KhRiI6ORmBgIMLCwtCjRw/w+XwMGjSo\nys0PLmkry89T3snJyeDxeKUGaQcHBxgZGVW/jS5SUqRrM0RGApmZgJER0KoVMGFClVubgQVhpkr5\n+PFjwdzb/GD79OlTWFlZFUsn29raKvThVjjNfOrUKTx8+LDcNPPn3r9/j02bNmHTpk3o2rUrfHx8\n0KFDh1Jfv2/fPsybNw9bt27FsGHDCr4fExMDV1dX/Pnnn+jWrRsAabD29PTEpk2bsHbtWly9erVI\nWQsXLoSuri6WLl1a8L1JkybB2NgY2dnZePfuHQIDA0v8GQmFQqxevRq///47/Pz8MGHChDJ/lq9f\nv8aOHTuwZ88eNG3aFFOnToW7uzvOnTuHwMBA3Lx5E3369AGfz8eAAQOqzaYQQqEQCQkJZbamAZTZ\nmraxsak6renwcOkqhWfPSr8uvK1s/iqFX30lXaWwjPeJJmFBmNFIRIS4uLhi6eTExEQ0b968SLBt\n2bIlZyNdhUIhbty4UdC/W9E08+cSEhKwbt067N69G4MHD8aPP/6Ipk2blvp6gUCA2bNn49KlSzh+\n/DicnZ0LnsvNzcWXX36J0aNHY/bs2QXfnzp1Kuzt7ZGRkQEDA4MiwRaQDujat28fTp48WfC9/LnL\n58+fx+TJkzF+/HjMmDGj1HpFRkZi/Pjx4PF42L59O+zs7Mq8boFAgBMnTmDbtm0Fx06ZMgXGxsY4\nfvw4AgMDER4ejgEDBoDP56Nv376oXbt2mWVWdZ+3pj9/JCYmwsLCosxAbWxsrP6t6Wq6Xj8Lwoza\nEwgEeP78ebF0cs2aNYusKuXi4oLGjRtzPmJVkTTz56Kjo/Hbb7/h6NGjGDt2LObOnVtu4EpISMCw\nYcNgbm6O/fv3FxvsM3nyZHz8+BFHjhwpqMuHDx/g4OCAqKgoeHh4YN26dQUt5HwxMTHo3LkzEhIS\ninx/06ZNOH78OLZv345OnTrh1KlT6NixY6n1K9wqXr16NSZOnFihn0l0dDS2b9+Offv2oVWrVpg6\ndSoGDx6M9PR0BAcHIzAwEI8fP8bgwYMxYsQIuLm5VZ0WH4dEIhESExNLTHfnP0QiUZkpbxsbG7m7\nYThRjXeuY0GYUSvp6elFFrl4+PAhnj9/jvr16xdLJytr2gsXaebPPXjwAKtXr0ZYWBi+/fZbzJgx\no0KjhG/evAk+n49vv/0WCxcuLDZAa+fOnVi/fj3u3r1bpE81ICAAly5dwo4dO2Bvb493794Va1F+\nPjgrn0gkQrt27fDTTz+hVq1amD17Nu7du1fu4LTIyEhMmDAB5ubm2LFjR7k3F/ny8vJw7NgxbNu2\nDc+fP8fEiRPxzTffoEGDBoiPj8eff/6JwMBAvHz5El5eXhgxYgS6devGFtuQQWZmJt6+fVtma9rM\nzKzM1rSJiYlyWtPVfA93FoQZlSAi/Pvvv8U2Knj//n3B3Nv8YNuiRQvo68uzCGPFcZVmLoyIcP36\ndaxevRqRkZGYM2cOpkyZUqElFYkImzdvxvLly7Fv3z7069ev2Gvy07Y3btwosnQkEaFNmzZYs2YN\nsrKysGnTJly8eLHE8/Tt2xczZswoGJyV78aNGxg1ahSioqKwdOlSvHjxAidOnCh3SpZQKISfnx82\nbtyIVatWYdKkSTJ9cD9//hzbt2/H/v370b59e0ydOhUDBw5ErVq1EBMTg6CgIBw5cgSJiYkYNmwY\nRowYgU6dOrGdmRQkFosLWtOlPfLy8soM0ra2tvJ1HXh5ASEhZaegS6OlBXh6AsHBsh+rJlgQZpQu\nNzcXT58+LZJOfvToEQwNDYuNTm7YsGGlfaBymWYuTCKR4PTp01i1ahVSU1OxYMECjB07tsIfUNnZ\n2Zg2bRoiIyNx7NgxODo6FnvNu3fv0L59e6xfvx6enp5Fnrtz5w5Gjx6NFy9eYM6cOeDxeFi4cGGJ\n51q0aBF0dHSwbNmyYs+NGTMGdnZ28PX1Rffu3TFkyBAsWLCgQtfw+PFjjB8/HmZmZgWtcVnk5OTg\n6NGj2LZtG/7999+C1nF+OS9evCgIyJmZmeDz+eDz+Wjfvr36931qqI8fP+Lt27elprwTEhJgYmJS\nasrb3t4epqamRX8/KSmAg0PRAViy0tUFYmM1d9Q0MQyHkpOT6cKFC+Tv70+jRo2i5s2bk+7/tXff\nUVFd2x/ANzF5D4yRMjMUQSxolDxRniCWICpiRwxqLMRuTCzRNH2KRkUNoghRMUqUxBJiYgN7ixrE\nRJIoEBVrxBLsWLCEPnO/vz/mB7FQptyZOwP7s1aWS2buuXvkZvY9556zj6UlPDw8MHToUERHR+Pg\nwYO4e/eu0WMTBAFnz55FZGQk2rdvj9q1a6NPnz6Ii4vDzZs39W6/uLgY3333HZo1awZPT09s3LgR\nSqVSqzYuX74MT09PhISEIDc3t8z3KJVKBAQEYOrUqWW+PmLECERGRgIAPDw88Ouvv5Z7vi1btiAw\nMLDM127evAm5XI4LFy4gKysLjo6OSE5O1vizFBUV4fPPP4dcLkdcXBwEQdD42KdlZGRg4sSJsLOz\nQ69evbBjx45n/l0zMjLw2WefoXHjxmjYsCFCQ0Nx4sQJnc/HdKNUKnH9+nWkpKRgw4YNiIyMxAcf\nfICgoCB4enrCzs4OVlZWaNKkCbp06YLRo0fjxy5dUPzKK4C6H6zbf1ZWwP9f7+aIkzDTiVKpxPnz\n57FhwwaEhoaiR48ecHJygrW1NTp06IAPP/wQq1evRnp6OgoKCiSLs6ioCIcOHcJHH30ENzc3uLi4\nYOzYsdi9ezfy8vJEOUdeXh6WL1+O+vXrw8/PD3v37tUpAezbtw/29vZYunRphcdPnz4d/v7+KC4u\nfuG1Bw8ewMbGBtnZ2cjOzkbt2rVRVFRUbltXr16Fk5NTua9HR0eje/fuEAQBe/fuhbOzM+7cuaPV\n58rIyICXlxe6dOmCv/76S6tjn5abm4vVq1ejdevWcHFxQVhYGK5fv176uiAISE9Px//+9z/Uq1cP\nTZo0wezZs3H27Fmdz8nE9eTJE5w9exb79u3DqlWr8EezZvol4JL/hg6V+qPpjJMwq9STJ0+QkpKC\n2NhYvP/++2jdujVeffVVNGjQAMHBwQgLC8O2bdtw5coVk+h93Lt3D/Hx8Rg4cCBsbGzQqlUrzJ07\nF+np6aLG9/DhQ0RERMDR0RG9e/fG0aNHdWpHEASEh4fDycmp0p7mtm3bULdu3XIT4dKlSzF48GAA\nwObNm9GzZ89Kzy2TyXDjxo0yXy8qKoK7uzu2bdsGAPjss8/QuXNnrXv4RUVFCA8Ph1wux6pVq/T+\nPZw4cQLjxo2Dra0t+vTpgz179jwTkyAI+O233/DRRx+hTp06aN68OcLDw5GZmanXeZnIAgPFScLl\njOaYA07CrJQgCLhx4wZ2796N8PBwDBgwAK+//jqsrKzQsmVLjBo1CjExMUhOTkZOTo7U4ZYy9DDz\n827fvo1p06bBzs4OQ4YMwalTp3Ru69GjRwgODkabNm2e6dWV5c8//4RCocBvv/1W5uuCIMDd3b00\nkY8bNw6LFi2qNIauXbtix44d5b5+6NAh1K9fH3l5eVAqlejUqRNmz55dabtlebpXfPXqVZ3aeNqT\nJ08QFxcHb29v1KtXD59//vkLv3OVSoXk5GSMHz8e9vb28PLywqJFi/TqlTORvPMO94SlDqBKuHMH\nWLhQfUEFBqr/XLgQyM6WOrJyFRUVISMjA/Hx8Zg8eTICAgIgl8shl8sREBCAyZMnIz4+HhkZGRUO\nZ0rFGMPMz7ty5QrGjx8PW1tbjB8/HpcvX9arvbNnz6JJkyYYO3ZspUP2f//9N5o1a4bY2Nhy35Oc\nnAx3d/fSXmbTpk2RmppaaRzTp0+vNKkOGDCg9D23bt1CnTp1sH///krbLktxcTHmz58PuVyOlStX\nijY6kZqaijFjxsDGxgZ9+/bFjz/+CJVK9cK5Dx48iHfffRcymQzt2rXD0qVLDXKzxjSwcCFgacnP\nhJmOjh0DgoPVF9HzF5KVlfpnwcHq90no4cOHSE5ORkxMDEaNGoWWLVvCysoKr7/+OgYMGIDw8HDs\n3r0bN27c0P4L0Yg3IMYaZn5eRkYGhgwZAjs7O0ybNg23b9/Wu82EhAQoFAp88803lb5XEASEhIRg\n+PDhFX7OkJAQLFmyBIB6UpWtra1Gw8YJCQno1atXhe/JysqCTCbDpUuXAABJSUlwdHSstPdekYyM\nDHh7eyMgIECUXnGJR48eITY2Fp6enmjYsCEWLFhQ5vB9YWEhdu/ejWHDhsHGxgYdO3ZEbGwssk34\n5rnKuXNH/yRsaWnSHZ7KcBLW1YoVQM2agIVFxReIhYX6fStWGDwkQRBw9epVbNu2DWFhYQgODkaD\nBg3w6quvonXr1nj//fcRGxuLX3/9FU+ePNHvZEa4AREEAefOnSsdZn7ttdcQFBRksGHm56WkpKB3\n795wdHREREQEHj58qHebSqUS06ZNg6urK44fP67RMTExMfD09Kywh3/37l1YW1vjwYMHAID169ej\nT58+GrV/9epVODo6Vvq+iIgIBAUFlf59/vz58PX11Wuk5Ole8VdffSXqzZQgCPj9998xcuRI2NjY\nYMCAATh06FCZ58jPz8fWrVsxaNAgWFtbo2vXrvjmm29K/z2ZAQUHV/49WtH3a9++Un8CvXAS1kVJ\nAtbmYhE5ERcUFCA9PR2rV6/Ghx9+iA4dOsDGxgZOTk7o0aMHQkNDsWHDBpw/f17rSTSVMuANyNPD\nzI0aNTLKMPPTSmYB+/n5oX79+li+fLlo57137x66dOkCf39/jXtbv/zyC+zt7Ut7oOVZtGgRhg8f\nXvr3d999t7RXXBlBECCXy8udnFWioKAAjRs3xu7duwGon7X27NkTU6ZM0eg8FTl9+jRatWqFzp07\ni9orLpGTk4Nly5ahWbNmaNy4MaKiospdJvf3339j48aN6Nu3L2rXro3AwEDEx8fj8ePHosfFoL5R\n1/b79OnvVQ1vZk0VJ2FtSXDB3Lt3DwcPHkR0dDSGDh0KDw8PWFpa4j//+Q/eeecdREZG4scff9R6\n6YhODHADItUw89OUSiU2btyI//73v2jWrBm+++67MpcA6SotLQ3169fHlClTNG731q1bcHZ2xp49\neyp8n0qlQqNGjZ5ZD+zm5qbVhLFu3bph+/btlb5v7969aNSoUekz7Hv37sHV1VWjYytTXFyMBQsW\nQC6XIzY21iC/e0EQcPToUQwdOhTW1tYICQlBcnJyued69OgR4uPjERgYiNq1a6Nv377YtGlTuWu4\nmY5MoGMjFU7C2jLg0IlKpcLFixexefNmzJgxA7169YKLiwtq164NX19ffPDBB/j666+RmpqK/Px8\nI37o/yfSDYjUw8xPKygowKpVq9CoUSO0bdsWO3bseGEyj77WrVsHuVyOTZs2aXxMUVER2rdvj7Cw\nsErfe+DAATRv3rw0kfz111+Qy+VafY7p06dj1qxZGr33rbfeQnh4eOnff/31V9jb2+s9Ua3EmTNn\n0KpVK/j7++PKlSuitFmW+/fvY/HixWjatCnc3d2xZMmSCoefHzx4gG+++QZdu3aFtbU1Bg0ahG3b\ntkm6Dr5KMcFHfMbASVgbIk4iyM3Nxe+//46VK1di/PjxaNeuHWrVqgVXV1cEBQVh1qxZSEhIwKVL\nl0RPCjrT4wZEsLDAHV/f0mFmZ2dnow4zP+/x48eIiopCnTp10L179wp7Q7oqLCzEhAkT0LhxY5w+\nfVqrYz/++GP07NlTo999//79seKpL6S1a9eif//+Wp0vMTGx0jXFJS5fvgyZTPbMEp8lS5bA29tb\ntIRU0iuWyWRYsWKFQf8fEAQBycnJCAkJgY2NDYYNG4ajR49WeD1kZ2cjNjYWHTp0gK2tLYYNG4Y9\ne/aY5EoCs3L8uLqjYmmpnlvy9PdIyVyTvn3Nfgj6aZyEtSHCdPqCGjWwUKGApaUlPD09MWLECCxe\nvBhJSUmmPQlEhBuQAgsLRE2datRh5ufdvXsXM2fOhFwux4ABA5Cenm6Q89y4cQPt2rVDUFCQ1hO6\nNmzYgAYNGuD+/fuVvvfWrVuwsbHBo0ePSn82fPjwZ5KyJv766y84ODho/HsJCwt7JtELgoC+ffti\nwoQJWp23MmfOnIGPjw/8/f1F62lX5O7du1i0aBEaN24MDw8PLFu2rNLf340bN7B06VK0bdsWMpkM\n7777Lg4ePCjq44xqJztbvexo6FD1qouhQ9V/N+NZ0OXhJKwNkRaWPwgMRGFhodSfRjtmvp4vKysL\nH374IWxtbTFmzBj8+eefBjvXzz//jDp16mDevHla9+BOnz4NuVyu8c1BeHg4xowZU/p3QRBQt25d\nnDt3TqvzCoIAhUKh8ZKjvLw8NGjQAAcOHCj92cOHD+Hm5oYNGzZode7KFBcXY+HChZDJZFi+fLlR\nRoYEQcChQ4cwYMAA2NjYYNSoUfj9998rvUn566+/sGjRInh5ecHBwQHjx4/HkSNH1DGbYT0BZnic\nhLVRnUusmWllm3PnzmHkyJGwtbXFp59+WukMYH0IgoAvv/wS9vb2pTOItfHo0SO8/vrrWLt2rUbv\nVyqVqFev3jMFOTIzM+Ho6KjTSEP37t1Ly1NqYvv27WjatOkzN5Tp6elQKBS4cOGC1uevzNmzZ9G6\ndWt06tTJKL3iEnfu3MGCBQvQsGFDeHp6IjY2VqOZ0hcvXkR4eDgGublhj6UlimrUgPJf/yp7iNUE\n6gkwaXAS1oaZJiJRmNkNyPHjx9G3b18oFArMnTtXo6FdfeTl5WHYsGHw8PDQqT6xIAgIDg7G2LFj\nNT5m9+7d8Pb2fuZncXFxCAkJ0fr8ADBjxgzMnDlT4/cLgoCePXu+UBpz5cqV8PDwMMgMYqVSicjI\nSKP2ikuoVCrs378fffv2hY2NDd577z2kpaVVfND/TzYSqtlkI6Y5TsLaMPMhWb2YwQ2IIAg4ePAg\nOnfujLp162LJkiX4+++/DXa+EleuXMF///tfDB48WOfzLVy4ED4+PlpNbAoKCsLXX3/9zM8GDx6M\nuLg4nWLYunWrxpOzSvz5558vbAAhCAKGDBmCUaNG6RSHJs6dO4c2bdqgY8eOla6hNoSbN2/i888/\nR7169eDt7Y24uLgXC+BU42U3THOchLVRnUusmfANiEqlQmJiInx8fNC0aVOsWbPGaM/cf/zxRzg4\nOGDx4sU6TzY7dOgQHB0dkZWVpfExWVlZsLW1fSbpC4IAR0dHnXcKysrKgr29vdafY/r06S/0vp88\neQJ3d3esWbNGp1g0oVQqsWjRIshkMnz55ZeSrCJQKpXYvXs3goKCYGtri3HjxuHEiRN6LedTWVpW\nqdm/rGKchLVVXUusmeANSFFREdasWYOmTZvC29sbCQkJRvsiFgQBERERcHJywuHDh3VuJysrC46O\njjh06JBWx82ePfuFmchnz56Fq6urzjcDJZOzrl27ptVxf//9N1xdXV/YhvHMmTOQy+V67TKliXPn\nzqFt27bo0KGDJL3iEteuXUNYWBhcXFyQZGsLlY7fE0oiHLS2xsKFCw26TpqZBk7C2qrOJdZM5AYk\nNzcXS5cuRd26ddG5c2ccPHjQqEueSrYfbN26tdYJ62kFBQXw8fHBwoULtTquuLgYzs7OLyS35cuX\nP1O6Uhc9evTQanJWic2bN8PDw+OFZTnx8fFo0qSJwUs+KpVKREVFQSaTYdmyZZKurS++cQPKV17R\n64ZV+a9/4ZOhQyGXy9GmTRssXrxYr80ymOl6iZh2WrUiiooiqllTu+Nq1lQf5+1tmLiMITSUyMpK\nt2OtrNTH6yEnJ4c+//xzatCgAR0+fJgSEhLo4MGD1LlzZ7KwsNCrbU2dP3+eWrduTfb29pScnEwu\nLi46t/XRRx+Rs7MzTZkyRavjdu/eTfXq1SMPD49nfp6UlET+/v46x0NE5OXlRampqVof169fP3Jw\ncKAVK1Y88/MhQ4aQn58fvffeewRAr9gqUqNGDfr000/p6NGj9P3335O/vz9dunTJYOeryMvffUc1\natTQq40aNWpQtIcH3bx5k2bPnk0nT54kDw8P6tChA61YsYKys7NFipZJTuq7ALNVTUusSTHZ5ObN\nm5g8eTLs7OwwYsQInD17VsQPpLnExETI5fIXJkPpYs2aNXj99defKbKhqe7du+Pbb7995mcqlQoy\nmUyr58pl2bp1K3r06KHTsWfPnoVcLn9hq8f8/Hx4enpi+fLlesWmqad7xTExMcbvFRtoEmNBQQG2\nb9+OkJAQWFtbIyAgAHFxcQaf+c8Mi5OwPqphiTUARrsBuXjxIt577z3Y2tpi0qRJz5RJNCalUonp\n06fD1dUVx0RYy5meng65XK51KUvgn5KRz5f6PHnyJNzc3PSO7dq1azpNzioxefJkjBgx4oWfX7x4\nEQqFQuPtG8Vw/vx5tGvXDn5+fjpPVtOJEZbz5ebmYvPmzejfvz9q166Nnj17Yt26daJst8mMi5Ow\nGKpRibVSBrwB+eOPPzBw4EDI5XLMnDlT0k3W7927h65du6JTp06i7FJ1//59NGjQQOeqUqGhofj4\n449f+PmSJUueqZylK0EQYG9vr3OP+vHjx3B2dkZKSsoLr23ZsgUNGjQwanlWpVKJL774AjKZDEuX\nLjVOr9jIy/keP36M9evXIygoCLVr18Zbb72FH374wSjL85j+OAkz/Yh4A3LkyBH06NEDderUwaJF\niyTfvzU9PR0NGjTA5MmTRakDrFKp0KNHjzKTqCYKCwvh4OCA8+fPv/BaUFAQvv/+e31DBKCenLV1\n61adj1+/fj1atmxZ5j7WH374Ifr06WP02uEXLlxAu3bt0L59e1y8eNGwJ5NwOV9OTg7WrFmD7t27\no3bt2hgwYAASExOl2XWNaYSTMJOUIAjYuXMn3nzzTbi5uWHlypUmsTXct99+C7lcjo0bN4rWZlhY\nGNq3b6/zTjubNm1Cx44dX/i5UqmEjY2NaNtAzpw5E5999pnOxwuCAD8/P8TGxr7wWmFhIVq3bo2o\nqCh9QtTJ073iJUuWGK5XbCLL+e7evYuVK1eiU6dOsLGxwZAhQ7Br1y7zq1tfxXESZpIoLi7G+vXr\n4eHhgRYtWmDDhg1l9pyMrbCwEB988AEaNWqEjIwM0drdvXs3nJ2dcevWLZ3b8Pf3L3MYOzU1Fe7u\n7vqE94xt27ahe/fuerVx8uRJKBQK3L1794XXSnZs+uWXX/Q6h67+/PNPvPnmm4btFZvIcr4St27d\nwrJly/Dmm2/Czs4Oo0ePxo8//sg7PZkATsLMqPLz87FixQo0aNAAfn5+2Lt3r2TbGj7v5s2b8PX1\nRWBgIHJyckRr99KlS7C3t9cr6Vy4cAH29vZl9mIiIyMxfvx4fUJ8xrVr16BQKPT+vUyaNAnvvfde\nma/t2rULLi4ukj3vVyqVWLx4MWQyGRYvXix+r9iE6wlkZWUhOjoarVq1gkKhwNixY3H48GGTuAmu\njjgJM6N49OgRWJJjqQAAG6ZJREFUFixYAEdHRwQGBuLo0aNSh/SMo0ePwtnZGXPmzBH1Czk3Nxee\nnp6IiYnRq51PP/0UU6dOLfO1Hj16YPPmzXq1/zRBEODg4KD3cqecnBw4OjqWOyM6NDQUXbt2lfTL\n/88//4Svry98fX3F397SDGpHX7p0CfPnz0eLFi3g5OSESZMmISUlxWRujKsDTsLMoO7cuYPQ0FDI\nZDK88847Bi9hqC1BELB8+XIoFArs2rVL9LaHDRuGkJAQvb7U8vPzIZfLyyzJWFRUhNq1a5c57KuP\nnj17IjExUe921qxZg9atW5d5Y1NcXIwOHTpg7ty5ep9HHyqVCkuWLCntFYt6U2BG9QTOnz+POXPm\nwN3dHa6urpgyZQpSU1PFS8i8n3KZOAkzg7hy5QomTJhQWtReypq+5cnLy8Pw4cPh4eFhkGeDsbGx\naNasmd5LRb777jt07dq1zNdSUlLQvHlzvdovy8yZMzFjxgy921GpVGjTpg2++eabMl+/efMmnJyc\ncPDgQb3Ppa+LFy+iffv2ePPNN8XtFZtZPQFBEHDq1ClMnz4dbm5uaNSoEWbMmIFTp07plpCPHVM/\nI7e0fHHCGu+nzEmYiev06dMYMmQI7OzsMHXqVL0mIhlSyfaDgwYNMsh6yt9++w0KhUKUL3NfX99y\ne6Xh4eH48MMP9T7H87Zv345u3bqJ0lZaWhocHBzKXR986NAhODk5PbMdolRUKhWWLl0KmUyGL774\nQtxesRnWExAEAampqZg8eTJcXV3xxhtvYM6cOWUukyuTGY0ESIWTMBPFr7/+iqCgIDg4OGD+/Pmi\nTmwSW8n2g1988YVBnn3duXMHdevW1WkjhOedPn0aTk5O5S5rCggIwPbt2/U+z/OuX78OuVwu2r/P\n2LFj8cEHH5T7+rx58+Dn52cys3UvXrwIPz8/tGvXDhcuXJA6HJOgUqmQkpKCSZMmwcnJCZ6enoiI\niMDly5fLPsAMnombAk7CTGeCIGDfvn3o2LEj6tevj+XLl79QTtGUCIJQOjksKSnJIOcoLi5Gp06d\nMH36dFHamzhxImbOnFnmawUFBahVq5ZBbnhK9iYWq1To/fv3YW9vr95rtwwqlQrdunXDtGnTRDmf\nGFQqFWJiYiCTyRAdHc2zh5+iVCqRlJSEsWPHQqFQwMfHB9HR0f/sKmbCs8NNDSdhpjWlUolNmzah\nZcuW+M9//oP4+HidC1AYy+PHj9GvXz/4+Pjotf1gZaZOnYqAgABRvrBzc3NhZ2dXbiJMTk6Gl5eX\n3ucpT69evZCQkCBaeytXroSvr2+5vevs7GzUrVtX9Aly+srMzCztFWs8DFuNFBcXY//+/Rg1ahTs\n7Ozg6+uLzObNIZjQOmlTxkmYaaygoABxcXFo3Lgx2rRpg+3bt0u6b6umzp07B3d3d4wZM8ag1bgS\nEhLg6uoq2kzl1atXI7CCIv5hYWGYMmWKKOcqy6xZs0Tr0QPqmzcvLy/Ex8eX+56jR4/C3t4eV69e\nFe28Yni6VxwVFcW94nIUFhZif3w8Cl96SfKKYeaCkzCr1JMnTxAdHQ1nZ2d069YNhw8fNpt1hFu3\nboVCoUBcXJxBz3P+/HkoFApRdlkq4ePjU2Gv0M/PD3v27BHtfM/bsWOHaJOzSvz222+oU6dOhVs4\nRkVFwcfHxyTLK2ZmZqJDhw5o27Yt94rLI2HtbHPESZiV6969e5g9ezbkcjnefvttpKWlSR2Sxkq2\nH6xbty5+//13g57ryZMneOONN7Bq1SrR2kxPT4erq2u5Pa68vDy8+uqrBt3k4saNG5DJZKLfcI0a\nNQqffPJJua8LgoA+ffoYZNa3GFQqFb788kvIZDIsWrSIe8XPM/IuUubuJWLsOdevX6ePP/6YGjdu\nTDdu3KCUlBTatGkTtWzZUurQNPLgwQPq1asXpaSkUGpqKvn4+BjsXABo9OjR1LZtWxozZoxo7a5c\nuZLGjBlDNWrUKPP1lJQUat68Ob322muinfN5derUoVdeeYWysrJEbXfBggUUHx9PZ86cKfN1CwsL\nWrt2Le3cuZO2bNki6rnF8NJLL9GECRPo2LFjtGvXLvL19aXz589LHZbpePRInHZycsRpx8RxEmal\nLly4QKNHj6YWLVpQjRo1KCMjg+Li4qhx48ZSh6axEydOkLe3NzVr1owOHDhA9vb2Bj3fkiVL6NKl\nS/Tll1/q1kB2NlFkJNGQIUS9exMNGUIF8+bRoQ0baPTo0eUe9tNPP1GnTp10jFpz3t7elJaWJmqb\nCoWCZs2aRRMnTiQAZb7HxsaGNm3aROPHj6fMzExRzy+Whg0b0k8//URDhgwhX19fWrRoEalUKqnD\nkp61tTjt2NqK046pk7orzqSXmpqKfv36QaFQYM6cObh//77UIekkPj4ecrkcP/zwg1HOl5ycDAcH\nB1y5ckX7gyuoIlT0yivqiS0VVBFq27atUapMzZ49G6GhoaK3W1xcjObNm1e6VeSKFSvQokULk176\nBqhrMHfs2BFt2rTBuXPnpA5HWvxMWCuchKspQRDw008/oUuXLnBxccHixYsNUjnKGIqKijBx4kS4\nubkZrTb1jRs34OTkhH379ml/sJ5VhB4/foxXX33VKIlpx44d5ZbM1NfPP/8MFxcXPHnypNz3CIKA\nQYMGYcyYMQaJQUwqlQrLly+HTCbDwoULq++zYhPZT9lccBKuZlQqFbZu3QofHx80adIEq1evNslZ\nqJq6desWfH190atXL6NV6SosLES7du0wb9487Q8WoYrQnj174OfnJ+InKp+hJmeVGDJkSKUFOh4/\nfowmTZrg22+/NUgMYrt8+TI6deqE1q1b4+zZs1KHIw0T20/ZlHESriaKioqwbt06vPHGG/Dy8sKW\nLVvM/k49JSUFzs7OCAsLM+p65UmTJiEwMFD7c4pURWjKlCkICwszwCcrm5OTk25D7hq4efMmZDJZ\npct9MjIyIJfLcfr0aYPEITaVSoUVK1ZALpdj4cKFJlOO02i4YpbGOAlXcbm5uYiJiYGrqyv8/f1x\n4MABs1njWx5BELBixQooFArs3LnTqOdev3493NzcdOt1i9Q78Pb2RnJyssifrHyBgYHYsmWLwdqP\njo5G165dK70u165dC3d39wqHr03NlStX4O/vDx8fn+rXK+ba0RrhJGyKRNh3MycnB59//jkcHBwQ\nHBxs8LWyxpKXl4cRI0agWbNmBtl+sCKnTp2CXC4vt/5xhUR6Tvbw4kXUqlXLoJW/nhcWFmaQyVkl\nioqK8MYbb2Dr1q2VvnfUqFF6789sbCqVCrGxsZDL5ViwYEH16hXzLkqV4iRsSkTYd/PmzZuYMmUK\n7OzsMHz48Cp193316lV4eXlh4MCBRu8N5eTkoFGjRhWWXKyQSDNGTw8fjoCAAHE/XCV27tyJLl26\nGPQchw4dQv369ZGbm1vh+/Ly8tC8eXOsXLnSoPEYwpUrV9C5c2e0atUKZ86ckToc4zGz/ZSNjZOw\nqdDzjjEzMxPvv/8+bG1tMXHiRJOrvauvAwcOwMHBAdHR0UbvBalUKvTu3RsTJkzQvRGRqggda9oU\n4eHh4n04Ddy8eRN2dnYG/3cfMGAAZs2aVen7Lly4AIVCYVYV3EoIgoCvvvoKcrkcERER1atXbIb7\nKRsDJ2FToMezkxMnTmDQoEGQyWT47LPPkG0OF7QWw+2CIGDhwoVwdHTETz/9JEGwQHh4ONq2bavf\nLPLAQFGScNJrryElJUW8D6ehOnXqGGxyVomsrCzIZDJkZmaqf1DBdbJx40a4ubnh4cOHBo3JUJ7u\nFZvLZDNmGJyEpabHLML8GjXQTSZDZGRkhQXxTYaWw+0l2w+2atUKWVlZkoS8f/9+ODk54fr16/o1\nJFJP+PuXX5Zk28jevXtj8+bNBj9PREQEPm7fXqPrJPLttxEcHGxWz4efJggCVq5cCblcjvnz51ev\nXjErxUlYanrMmFVZWEDZp4/Un0AzWg6335o9G+7u7nj33XeRn58vSchXr16Fg4MDkpKS9G9MhGfC\nxf/6F75u0kT/WHQQFhZW6XpeMRTFxCDPwgIqDa4ToWZNRNSrh8WLFxs8LkO6evUqAgIC4O3tzb3i\naoiTsJSqS2UZHYbbc4lwJCREspDz8/Ph7e2NqKgocRoU4XddVKMGlmnwzNQQdu3aZfgJYTpcJyor\nK0yuVUuSIXoxCYKAVatWQS6XIzw8nHvF1Qhv4CCltWv1b8PCQpx2DOX4caLJk4ny8rQ6rCYRtd+2\njSg11TBxVWLSpElUv359+uSTT8Rp0N6eqEcP9e9LFxYWlFSzJrUNChInHi15eXlRWloaATDMCXS8\nTl7Kz6eI4mIKDw6me/fuGSY2I7CwsKAxY8ZQWloaHT58mNq0aUOnT5+WOixmBJyEpXTqFFFBgX5t\n5OcTZWSIE48hRESoY9RFfr76eCP75ptv6Oeff6bVq1eTha5JsyyhoURWVjodKlhaUgRAnp6e4sWj\nBUdHR6pZsyZdvXrVMCfQ4zp5uaiIIqytadiwYSQIgsiBGZerqyvt37+f3n//ferUqROFh4eTUqmU\nOixmQJyEpVTV993Mzibau1c9cKgLgGjPHqK7d8WNqwJpaWk0bdo0SkxMFH+v3latiKKiiGrW1O64\nmjUpbdAgqu3vX+7+wsbg5eVFqYYYmRDhOmmWlUU1HjygBQsWiBubBJ7uFR85coTatGlDGaZ8o830\nwklYSlV9300zG26/f/8+9e/fn2JjY8nd3d0wJxk37p9EXFkv28JC/b6oKIp7+WXy9/c3TEwaKhmS\nFp0Iv18LCwv6LiCAli1bRocPH9a7PVPg6upK+/bto7Fjx5K/vz+Fh4dTcXGx1GExkXESllLz5kSW\nlvq1YWVF5OEhTjxiM6PhdpVKRSEhIdS/f3/q37+/YU82bhxRcjJRcLD69//8ELWVlfrnwcHq940b\nR0lJSdSpUyfDxlUJb29vwyRhka4T66ws+vbbb+mdd96h27dvixObxCwsLOjdd9+ltLQ0+vnnnzXv\nFWdnE0VGEg0ZQtS7t/rPyEijjioxDUk9M6xaq+qzo0UqUIHAQIOH+tlnn6Fjx47Gn5WqQRWhkiIW\nxtwpqiy3b9+Gra2t+OtyRb5OZs+ejY4dO5r9LmHPEwQBX3/9NeRyOebNm1f2enERSt8y4+IkLLWq\nvO+mSAUqMHSoQcPcsWMHXFxccPv2bYOeR1fr1q1D//79pQ4DAODs7IxLly6J26jI14lSqURAQABm\nzJghbpwmIisrC926dUPLli1x8uTJf17gzRLMEg9HS02PGbNkZaU+3lSZwXB7ZmYmjR49mjZt2kQO\nDg4GO48+TGEouoRBhqRFvk5q1KhB69evp3Xr1tHevXtFCNC01K1bl/bu3UsTJkygzp0707x580j5\n5Zf/LPGqbIIboH7f5MlEsbHGCZqVT+q7AIaqu++miQ+35+bmwsPDA8uXLzdI+2IQBAGurq44d+6c\n1KEAAObOnYv//e9/4jZqoOvkyJEjcHBwkKzkqTFcu3YNk9q2RZ6uo2k1a1bb3YtMBfeETYGOM2Zp\n3DjjxKcrEQpUUM+eRAqFuHEREQB6//33ydPTk8aZ8L/jlStXqKioiJo0aSJ1KERkoBnSBrpO2rdv\nT5988gkNHDiwys4qdnFxoSUODvRvXRuQaC0++wcnYVOhw4xZs2Ciw+0rVqygU6dO0VdffSVuQQ6R\n/fTTT9SpUyeTidFglbMMdJ1MnjyZZDIZTZs2TY/gTFh2Nlns20cv6fr7AIy+Fp89i5OwKfH2JkpI\nIMrKIpozh2joUKLAQPWfc+aof56QoH6fudCjQAVFRRnks6akpNCcOXMoMTGRamobl5ElJSVJvj74\naQ4ODlSrVi26fPmyuA0b6Dp56aWXaN26dZSYmEhbt24VIVATY2Zr8VkZpB4PZ9WEiczcvH37Nlxc\nXLBz506DtC8mQRDg5OT0z/66JqJPnz7YuHGjYRo30HXy+++/Q6FQmNy/pd7MZAUCKx/3hJlxmMBw\nu1KppIEDB9LIkSMpMDBQ9PbFduHCBXr55ZepYcOGUofyDIMV7SAy2HXi4+NDs2bNorfffpsK9C0M\nYkqqeunbauBlqQNg1UjJcPvdu+rhr4wM9f/8trbq5SUjRhhkElaJadOmkaWlJc2ePdtg5xBTyVC0\nqTwPLuHl5UVRUVGGO4GBrpMJEybQkSNH6OOPP6bYqrI0p6qXvq0GOAkz41MoiKZMMeopN2/eTAkJ\nCZSamirpJgjaSEpKol69ekkdxgu8vLwoPT2dABj2BkHk68TCwoK+/vpr8vb2pu+//55CQkJEa1sy\nzZurb1j06d2bcunbasACEHuaI2Om5dy5c+Tn50f79++nli1bSh2ORgRBIAcHB0pLSyNXV1epw3mB\nq6srJSUlkZubm9ShaO3kyZMUEBBAR44cMdxGHcaSnU1Ur55+SdjSUj3p04CjUKx8/EyYVWmPHz+m\n4OBgioyMNJsETER05swZsra2NskETGTAbQ2NoEWLFrRgwQJ6++23KTc3V+pw9GPCa/GZZjgJsyoL\nAI0aNYo6dOhAI0eOlDocrZhSqcqyGGxbQyMZNWoUeXt70/jx48Vf82xsJroWn2mGkzCrsqKjoykr\nK4tiYmKkDkVrJUU6TJW3t7fZ9oSJ1M+Hly9fTmlpabR69Wqpw9GPCa7FZ5rjZ8KsSkpKSqLBgwfT\nsWPHTHZItzwqlYoUCgWdOXOGnJycpA6nTHfv3qXGjRtTTk6Oyc3e1sb58+epffv2dPDgQWrRooXU\n4egnNla9KUN+fsWbOFhYqHvA5lD6thrgnjCrcq5fv04hISH03XffmV0CJlJPHHJwcDDZBExEpFAo\nyNrami5duiR1KHpp2rQpxcTEUP/+/enx48dSh6MfE1iLz7THS5RYlVJYWEhvv/02TZo0iQICAqQO\nRyemPhRdomRyVqNGjaQORS+DBw+mn3/+uXRLS3Pu2Uu9Fp9pj4ejWZUyYcIEunHjBiUmJtJLL5nn\nQE+vXr1o5MiR1L9/f6lDqVB4eDg9fPiQFi1aJHUoeisoKKA333yTRowYQRMnTpQ6HFaNmOe3FGNl\n+Pbbb+nAgQO0bt06s03AxcXF9Msvv1DHjh2lDqVSBi1faWSWlpa0efNmmjdvHh07dkzqcFg1Yp7f\nVIw958SJE/Tpp59SYmIiWYtVyk8CaWlpVK9ePZLL5VKHUqmSZUqCIEgdiigaNmxIq1atooEDB9KD\nBw+kDodVE5yEmdnLycmhfv36UUxMDDVr1kzqcPRialsXVkQul5ONjY3ZT8562ltvvUV9+/al4cOH\nV5mbC2baOAkzsyYIAg0dOpR69+5NgwcPljocvZl6kY7nVaUh6RILFiyg+/fvV4ln3cz08cQsZtbm\nzZtH+/fvp6SkJHrllVekDkcvhYWFJJfL6dq1a2RjYyN1OBqZP38+PXjwwLC7Kkng2rVr1KpVK9q0\naRP5+fmpf5idrZ5xfOqUegtBa2v1BgojR/KMY6YzXqLEzNa+ffvoq6++otTUVLNPwEREx44doyZN\nmphNAiZSPxdesGCB1GGIrm7durR27VoKCQmhk19/TbJVq4j27lW/+PRmCYmJRLNnq+s3h4aqq1cx\npgXuCTOzdOXKFWrTpg1t2bKF2rdvL3U4opg7dy49efLErIZB7927R25ubpSTk2O2M9IrsqNnT+q6\nfz/9GyALrkLFDIB7wsz0VDLsl5+fT/369aPQ0NAqk4CJ1EU6pk6dKnUYWpHL5WRra0uZmZn0+uuv\nSx2OuGJjqXdyMlloMkELIMrLU5eNJOJEzDTGPWFmOo4fJ4qIKHvYz8qKCCD06EHziovp7Kuv0g8/\n/GC+1Y2eu9FQ1qpFsxMSKPTCBarVoIHU0WmlX79+1L9//yoxMa7U8eNEHTuqE6u2atZUl4XkjRGY\nBjgJM9OgYfF5wcKCConI4osvyPKjj4wXn1gquNEosLAgy3//2+yeL0ZERND9+/er1uSsvn2Jtm2r\neCOE8lhYqOszJySIHxercqreQxxmfkoScF5epV96LwFkBZDljBnq48xJbKy6d7Vtmzr5Pt3TJyJL\nQP2zbdvU7zOTz1dSQ7rKyM5W3yTp2j8BiPbsUddvZqwSnISZtI4f/ycBa6Pk+Zu5fPlrcaPxzPNF\nM0jEXl5e9Mcff1Sd4hZr1+rfhoWFOO2wKo+TMJNWRIR6CFoX+fnq401dFb/RkMlkZGdnR5mZmVKH\nIo5Tp14YpdBafr56ByPGKsFJmEmnugz7VYMbjSo1JP3okTjt5OSI0w6r0jgJM+lUh2G/anKjUbKZ\nQ5Ug1gYgtrbitMOqNE7CTDrVYdivOtxoUBWrId28OZGlpX5tWFkReXiIEw+r0jgJM+lUh2G/6nCj\nQUQtW7ak9PT0qjE5a8QI/dsAxGmHVXlcMYtJpzoM+1WHGw0ikqlUFPryy/TkrbfIGjDvzQ3s7dVr\ntfVZJ9yzp/l9biYJ7gkz6VSHYb+qfqNx/Li6sEW9evTJo0dkvXMn0a5dROvXE4WFEbm6ql8/flzq\nSLUTGqq+tnRhZaU+njENcBJm0qkOw35V+UbjueIj/35+KDo/3yyLjxCRulpZVJS6BKU2atZUH8cl\nK5mGOAkz6ZQM++la/9kchv2q6o1GFS4+UmrcuH8ScWXXqIXFPwmYN29gWuAkzKRV1Yf9quKNRhUv\nPvKMcePUmzEEB6tHNJ6/Vq2s1D8PDla/jxMw0xJv4MCk93SvSlPm1OuoajvyVNfNDe7eVS8Vy8hQ\nT5SztVU/JhgxwrRukphZ4STMTIOGuyiZ7ebpVeVGIzubqF49/ZZdWVoSZWVx4mKMeDiamYqqPuxX\nVZ4vVpPiI4wZC68TZqbD21s9TFlVh/3GjVPPuo2IUJeitLB4tqa0lZV6FKBnT/WzblMagi5RTYqP\nMGYsnISZ6VEoiKZMkToKwzD3G41qUnyEMWPhJMyYFMz1RqOqFx9hzMj4mTBjTHNVufgIYxLg2dGM\nMc3x7GjGRMU9YcaY5qpi8RHGJMQ9YcaYdqpa8RHGJMQ9YcaYdnhzA8ZEw7OjGWPaKykiUpWrnDFm\nBDwczRjTXWqqeRcfYUxinIQZY/oz1+IjjEmMkzBjjDEmEZ6YxRhjjEmEkzBjjDEmEU7CjDHGmEQ4\nCTPGGGMS4STMGGOMSYSTMGOMMSYRTsKMMcaYRDgJM8YYYxLhJMwYY4xJhJMwY4wxJhFOwowxxphE\nOAkzxhhjEuEkzBhjjEmEkzBjjDEmEU7CjDHGmEQ4CTPGGGMS4STMGGOMSYSTMGOMMSYRTsKMMcaY\nRDgJM8YYYxLhJMwYY4xJhJMwY4wxJhFOwowxxphEOAkzxhhjEuEkzBhjjEmEkzBjjDEmEU7CjDHG\nmEQ4CTPGGGMS4STMGGOMSYSTMGOMMSYRTsKMMcaYRDgJM8YYYxLhJMwYY4xJhJMwY4wxJhFOwowx\nxphEOAkzxhhjEuEkzBhjjEmEkzBjjDEmkf8DiECcr071XLsAAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7ffb8675ed90>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import matplotlib.pyplot as plt\n",
    "%matplotlib inline\n",
    "nx.draw(nx_graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Try performing Neo4j query using module"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "08/02/2018 05:51:06 PM [INFO]: Created new log.\n",
      "08/02/2018 05:51:06 PM [INFO]: RequestFullTextSearch: Creating request\n",
      "08/02/2018 05:51:06 PM [INFO]: ConnectEutils: Connecting to eutils API:\n",
      " https://eutils.ncbi.nlm.nih.gov/entrez/eutils/esearch.fcgi?db=pmc&tool=graphsearch&sort=relevance&term=cancer&retmax=20\n",
      "08/02/2018 05:51:08 PM [INFO]: Max degree: 284\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10594042\n",
      "0\n",
      "> \u001b[0;32m/home/ubuntu/git/GraphSearch/backend/lib/FrontEndGraph.py\u001b[0m(141)\u001b[0;36mget_cyto_graph\u001b[0;34m()\u001b[0m\n",
      "\u001b[0;32m    137 \u001b[0;31m                        'target':edge['target'] }})\n",
      "\u001b[0m\u001b[0;32m    138 \u001b[0;31m        \u001b[0mcy_dict\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m'stats'\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mnetwork_stats\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'graph'\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m'nodes'\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mnode_lst\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'edges'\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0medge_lst\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0m\u001b[0;32m    139 \u001b[0;31m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0m\u001b[0;32m    140 \u001b[0;31m        \u001b[0;32mfrom\u001b[0m \u001b[0mIPython\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcore\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdebugger\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mTracer\u001b[0m\u001b[0;34m;\u001b[0m \u001b[0mTracer\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0m\u001b[0;32m--> 141 \u001b[0;31m        \u001b[0;32mreturn\u001b[0m \u001b[0mjson\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdumps\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcy_dict\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0m\n",
      "ipdb> cy_dict['stats']\n",
      "{'num_citations': 575, 'pub_years': {'values': [2000, 2009, 2007, 2012, 2012, 2006, 2010, 1999, 2011, 2008, 2012, 2011, 2002, 2006, 2015, 2012, 2009, 2012, 2010, 2002, 2012, 2006, 2011, 2003, 2004, 1997, 2011, 2008, 2004, 2009, 2006, 2003, 2011, 2006, 1998, 2008, 2012, 2012, 2011, 2012, 2009, 2004, 2003, 2012, 2001, 2006, 2004, 2000, 2009, 2011, 2004, 2007, 1994, 2010, 2011, 2007, 2011, 1987, 2010, 2011, 2004, 1999, 1995, 2011, 2012, 2011, 2011, 2003, 2006, 2011, 2011, 2009, 2011, 2011, 2011, 2001, 2002, 2012, 1999, 2010, 2012, 2008, 2011, 2011, 1992, 2005, 2010, 2011, 2013, 2007, 2003, 2010, 2003, 2008, 2012, 2004, 2012, 2012, 2008, 2006, 1994, 2011, 1999, 2008, 2010, 2002, 1993, 2014, 2010, 2007, 2011, 2012, 2011, 2011, 2009, 2006, 2011, 2012, 2010, 2012, 2004, 2007, 2006, 2008, 2010, 2008, 2013, 2004, 2007, 2010, 2010, 2011, 2009, 2011, 2009, 2011, 2011, 2015, 2009, 2006, 2004, 2005, 2009, 1997, 2008, 1994, 2000, 1992, 2005, 2010, 2010, 2012, 2012, 2011, 2011, 2005, 2010, 2011, 2005, 2009, 2010, 2009, 2011, 2011, 1993, 2011, 1997, 2011, 2007, 2014, 2011, 1985, 2006, 2011, 2012, 2012, 2001, 2009, 2009, 2012, 2005, 2010, 2012, 2008, 2009, 2013, 2008, 2008, 2006, 2013, 2012, 2010, 2003, 2011, 2014, 2008, 2011, 1991, 2011, 2008, 2012, 2011, 2004, 2008, 2010, 2011, 2013, 2001, 2008, 1997, 1988, 2003, 2005, 2011, 1995, 2011, 2010, 2009, 2011, 2008, 2006, 2011, 2001, 2009, 2006, 2006, 2011, 2008, 2011, 2007, 2011, 2012, 2010, 2011, 2010, 2005, 2005, 2009, 2012, 2009, 1998, 1999, 2007, 2011, 2011, 2001, 1994, 2007, 2012, 2006, 2009, 2001, 2011, 1992, 2007, 2011, 2011, 2011, 2004, 2011, 2001, 2011, 2007, 2007, 2011, 2012, 2012, 2007, 2006, 2011, 2006, 1994, 2010, 2010, 2010, 2005, 2010, 2010, 1984, 2011, 2010, 2008, 2008, 2009, 2009, 2007, 2010, 2011, 2014, 2005, 2006, 2010, 2011, 2007, 2000, 2001, 2002, 2010, 2011, 2003, 2007, 2012, 2010, 2013, 2006, 2013, 2004, 2002, 2010, 2012, 2012, 2010, 2010, 2011, 2012, 2007, 2007, 2012, 2010, 2007, 2005, 2008, 2002, 1999, 2009, 2005, 2011, 2010, 2009, 2013, 2006, 2002, 2011, 2007, 2011, 2010, 2012, 2008, 2006, 2011, 2010, 2003, 2008, 2010, 2002, 2007, 2012, 1997, 2007, 2003, 2009, 2010, 2008, 2000, 2009, 2016, 2012, 2009, 2010, 2011, 2011, 2011, 1988, 2007, 2007, 2012, 2011, 2012, 2011, 2011, 2011, 2006, 2007, 2012, 2009, 2011, 2007, 1996, 2006, 2010, 2006, 2013, 2002, 2012, 2012, 2006, 2012, 2004, 2011, 2003, 2011, 2006, 2010, 2010, 1997, 2015, 2012, 2009, 2011, 2009, 2011, 2005, 2009, 2005, 2000, 2012, 1999, 2012, 2010, 2010, 2012, 2010, 2010, 2007, 2012, 2011, 1997, 2001, 2012, 2007, 2010, 2010, 2012, 2004, 2010, 2011, 2006, 2010, 2011, 2002, 2009, 2011, 2009, 2011, 2007, 2011, 2006, 2002, 2012, 2009, 2005, 2004, 2005, 2009, 2010, 2009, 2007, 2009, 2008, 2003, 2009, 2012, 2006, 2005, 2006, 2011, 2011, 2008, 2011, 2009, 1996, 1974, 2011, 2007, 2006, 2012, 2012, 2003, 2012, 2012, 2002, 2011, 2012, 2008, 2007, 2004, 2011, 2012, 2004, 2009, 2006, 2007, 2010, 2007, 2010, 2010, 1996, 1996, 2012, 2010, 2011, 2012, 2012, 1989, 2005, 2010, 2006, 2004, 2011, 1988, 2000, 2007, 2007, 2003, 2015, 2012, 2003, 2012, 2009, 2012, 2006, 2011, 1999, 2003, 2011, 2002, 2012, 2003, 2005, 1996, 2008, 1991, 2005, 2005, 2007, 2012, 2012, 2011, 2009, 2012, 2011, 2006, 2010, 2014, 1982, 2004, 2011, 2009, 2011, 2009, 2007, 2011, 2006, 2003, 2009, 2008, 2011, 2006, 2008, 1989, 2003, 2003, 2007, 2011, 1988, 2010, 2010, 2008, 2012, 2011, 2012, 2005, 2011, 2005, 2010], 'num_bin': 21}, 'num_results': 0, 'top_authors': '   (28),  Robison Leslie L (15),  Batra Surinder K (11), Mimeault Murielle (11),  Mertens Ann C (10)', 'top_journals': 'Cancer Res. (28), Int. J. Cancer (26), PLoS ONE (22), Br. J. Cancer (21), Cancer Causes Control (21)', 'top_journals_list': ['Cancer Res. (28)', 'Int. J. Cancer (26)', 'PLoS ONE (22)', 'Br. J. Cancer (21)', 'Cancer Causes Control (21)'], 'num_links': 573, 'top_authors_list': ['   (28)', ' Robison Leslie L (15)', ' Batra Surinder K (11)', 'Mimeault Murielle (11)', ' Mertens Ann C (10)'], 'max_degree_cited': 284}\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "sys.path.append('../backend/lib')\n",
    "sys.path.append('../backend')\n",
    "from GraphDbConnector import NeoGraph\n",
    "from GraphSession import GraphSession\n",
    "import networkx as nx\n",
    "from networkx.readwrite import json_graph\n",
    "from FrontEndGraph import FrontEndGraph\n",
    "\n",
    "# Get pmc hits\n",
    "search_input = \"cancer\"#\"campbell cancer leukemia\" #\"nlp genomics\"\n",
    "graphsession = GraphSession(search_input)\n",
    "pmc_hits = graphsession.get_pubmed_results_from_fulltext(search_input, retmax=20)\n",
    "\n",
    "# Perform Neo4j request\n",
    "neo_graph = NeoGraph()\n",
    "\n",
    "nx_graph = neo_graph.process_search_request(pmc_hits)\n",
    "\n",
    "for node in nx_graph.nodes:\n",
    "    print node\n",
    "    break\n",
    "    \n",
    "#nx.get_node_attributes(nx_graph, 'group')\n",
    "\n",
    "#json_graph.node_link_data(nx_graph)\n",
    "\n",
    "frontendgraph = FrontEndGraph(nx_graph)\n",
    "cy_json = frontendgraph.get_cyto_graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "string indices must be integers, not str",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-4-5916f600b20f>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mcy_json\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'graph'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m: string indices must be integers, not str"
     ]
    }
   ],
   "source": [
    "cy_json['graph']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from networkx.readwrite import json_graph\n",
    "import json\n",
    "\n",
    "data = json_graph.node_link_data(resultGraph.G)\n",
    "json.dump(data,open('output/demo_network_neo4j.json','w'),indent=2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[u'10594042',\n",
       " u'19211554',\n",
       " u'17220709',\n",
       " u'22419113',\n",
       " u'22412968',\n",
       " u'16541321',\n",
       " u'19755960',\n",
       " u'10088625',\n",
       " u'21280033',\n",
       " u'14981919',\n",
       " u'18202660',\n",
       " u'22487097',\n",
       " u'21116605',\n",
       " u'12395331',\n",
       " u'16391371',\n",
       " u'26147988',\n",
       " u'22262369',\n",
       " u'7745774',\n",
       " u'19718046',\n",
       " u'22421313',\n",
       " u'20107164',\n",
       " u'12153983',\n",
       " u'22120574',\n",
       " u'16114056',\n",
       " u'21227456',\n",
       " u'12917301',\n",
       " u'14618625',\n",
       " u'9308706',\n",
       " u'21499299',\n",
       " u'18443270',\n",
       " u'15306667',\n",
       " u'20055873',\n",
       " u'17035408',\n",
       " u'14512791',\n",
       " u'21922147',\n",
       " u'16729877',\n",
       " u'9486458',\n",
       " u'18268068',\n",
       " u'22498643',\n",
       " u'22286766',\n",
       " u'21917926',\n",
       " u'22180128',\n",
       " u'19640651',\n",
       " u'15128610',\n",
       " u'12714970',\n",
       " u'22465832',\n",
       " u'11604436',\n",
       " u'16456578',\n",
       " u'15342808',\n",
       " u'10749120',\n",
       " u'19690547',\n",
       " u'22137794',\n",
       " u'15127411',\n",
       " u'17084552',\n",
       " u'8117767',\n",
       " u'20113899',\n",
       " u'21392092',\n",
       " u'17671448',\n",
       " u'21640519',\n",
       " u'3469460',\n",
       " u'20578004',\n",
       " u'22087262',\n",
       " u'15164171',\n",
       " u'18521283',\n",
       " u'7666483',\n",
       " u'21778785',\n",
       " u'22541435',\n",
       " u'21334674',\n",
       " u'21396984',\n",
       " u'12490539',\n",
       " u'16987655',\n",
       " u'21415163',\n",
       " u'21343390',\n",
       " u'19255307',\n",
       " u'21415165',\n",
       " u'21938478',\n",
       " u'22124364',\n",
       " u'11513191',\n",
       " u'12397646',\n",
       " u'22077552',\n",
       " u'9934746',\n",
       " u'20338259',\n",
       " u'22083267',\n",
       " u'18033764',\n",
       " u'21911388',\n",
       " u'21398527',\n",
       " u'1434027',\n",
       " u'15668486',\n",
       " u'20587661',\n",
       " u'21071498',\n",
       " u'24215312',\n",
       " u'17397032',\n",
       " u'12627523',\n",
       " u'20574527',\n",
       " u'14506117',\n",
       " u'18268128',\n",
       " u'22284032',\n",
       " u'15184246',\n",
       " u'22661101',\n",
       " u'22467266',\n",
       " u'18506898',\n",
       " u'16096651',\n",
       " u'7947103',\n",
       " u'21512126',\n",
       " u'10582706',\n",
       " u'18791122',\n",
       " u'20716670',\n",
       " u'12242281',\n",
       " u'8347787',\n",
       " u'24507548',\n",
       " u'20656964',\n",
       " u'17450524',\n",
       " u'21819554',\n",
       " u'22308314',\n",
       " u'21767143',\n",
       " u'21102523',\n",
       " u'19549812',\n",
       " u'12674416',\n",
       " u'16847054',\n",
       " u'21778878',\n",
       " u'21544812',\n",
       " u'20930144',\n",
       " u'22145808',\n",
       " u'15205345',\n",
       " u'17977646',\n",
       " u'17119028',\n",
       " u'18191814',\n",
       " u'20732288',\n",
       " u'18337451',\n",
       " u'23301832',\n",
       " u'15150583',\n",
       " u'17595271',\n",
       " u'20920698',\n",
       " u'20660845',\n",
       " u'21166958',\n",
       " u'19825802',\n",
       " u'21115865',\n",
       " u'19919690',\n",
       " u'21876459',\n",
       " u'22132214',\n",
       " u'25422316',\n",
       " u'19336553',\n",
       " u'17021919',\n",
       " u'14689581',\n",
       " u'15735193',\n",
       " u'19444913',\n",
       " u'9310563',\n",
       " u'19020659',\n",
       " u'8208269',\n",
       " u'10691731',\n",
       " u'1287744',\n",
       " u'15983061',\n",
       " u'20682444',\n",
       " u'20552555',\n",
       " u'21319288',\n",
       " u'22353805',\n",
       " u'21368581',\n",
       " u'21602426',\n",
       " u'16258363',\n",
       " u'20179163',\n",
       " u'22147606',\n",
       " u'15700252',\n",
       " u'19231160',\n",
       " u'21128808',\n",
       " u'19244127',\n",
       " u'22203527',\n",
       " u'20217088',\n",
       " u'9010910',\n",
       " u'8449644',\n",
       " u'21748485',\n",
       " u'9354440',\n",
       " u'21799876',\n",
       " u'17409425',\n",
       " u'24366296',\n",
       " u'21057546',\n",
       " u'3998058',\n",
       " u'16775234',\n",
       " u'21703345',\n",
       " u'22382881',\n",
       " u'21722303',\n",
       " u'11242036',\n",
       " u'19727403',\n",
       " u'19443538',\n",
       " u'22184053',\n",
       " u'16230395',\n",
       " u'20927579',\n",
       " u'21929650',\n",
       " u'18618278',\n",
       " u'19286309',\n",
       " u'23757085',\n",
       " u'18387499',\n",
       " u'18215105',\n",
       " u'16418516',\n",
       " u'23300288',\n",
       " u'21889332',\n",
       " u'20037603',\n",
       " u'14695152',\n",
       " u'21436587',\n",
       " u'24925676',\n",
       " u'19080260',\n",
       " u'21494085',\n",
       " u'1932543',\n",
       " u'20860653',\n",
       " u'19095944',\n",
       " u'22263802',\n",
       " u'21688131',\n",
       " u'15380796',\n",
       " u'18990751',\n",
       " u'20051944',\n",
       " u'21790252',\n",
       " u'23110810',\n",
       " u'11522653',\n",
       " u'18467664',\n",
       " u'9139868',\n",
       " u'3369417',\n",
       " u'12937141',\n",
       " u'15753540',\n",
       " u'21824412',\n",
       " u'8634649',\n",
       " u'20958264',\n",
       " u'20479278',\n",
       " u'19664792',\n",
       " u'22152097',\n",
       " u'18664655',\n",
       " u'17097563',\n",
       " u'21906872',\n",
       " u'11287973',\n",
       " u'19018260',\n",
       " u'16510872',\n",
       " u'16987886',\n",
       " u'21911602',\n",
       " u'18679071',\n",
       " u'21978143',\n",
       " u'16920734',\n",
       " u'21081242',\n",
       " u'22196409',\n",
       " u'21067584',\n",
       " u'20473853',\n",
       " u'20628130',\n",
       " u'15886700',\n",
       " u'15632264',\n",
       " u'21296855',\n",
       " u'19168635',\n",
       " u'22100961',\n",
       " u'19676082',\n",
       " u'9583711',\n",
       " u'10468285',\n",
       " u'17141498',\n",
       " u'21752291',\n",
       " u'21562753',\n",
       " u'11808705',\n",
       " u'8200846',\n",
       " u'17826033',\n",
       " u'21898753',\n",
       " u'16844421',\n",
       " u'19752085',\n",
       " u'11349222',\n",
       " u'21554950',\n",
       " u'1500222',\n",
       " u'17361218',\n",
       " u'21934509',\n",
       " u'21887310',\n",
       " u'21792314',\n",
       " u'15090721',\n",
       " u'21499308',\n",
       " u'11161410',\n",
       " u'21555371',\n",
       " u'17033617',\n",
       " u'17320377',\n",
       " u'21676926',\n",
       " u'22619084',\n",
       " u'22052244',\n",
       " u'17418410',\n",
       " u'17051156',\n",
       " u'21437769',\n",
       " u'17000944',\n",
       " u'8014014',\n",
       " u'20699369',\n",
       " u'20934571',\n",
       " u'19899826',\n",
       " u'15644546',\n",
       " u'20375133',\n",
       " u'20596026',\n",
       " u'6711540',\n",
       " u'21378328',\n",
       " u'20687211',\n",
       " u'18363110',\n",
       " u'18347186',\n",
       " u'19800794',\n",
       " u'19908334',\n",
       " u'17531933',\n",
       " u'20215500',\n",
       " u'21320746',\n",
       " u'24872349',\n",
       " u'16215871',\n",
       " u'16452478',\n",
       " u'20556833',\n",
       " u'21953276',\n",
       " u'17522713',\n",
       " u'10818118',\n",
       " u'11359907',\n",
       " u'12429530',\n",
       " u'20015196',\n",
       " u'22205924',\n",
       " u'12704444',\n",
       " u'18265476',\n",
       " u'22710709',\n",
       " u'20228997',\n",
       " u'23625157',\n",
       " u'16527702',\n",
       " u'23401292',\n",
       " u'15534610',\n",
       " u'11756187',\n",
       " u'19808918',\n",
       " u'22184410',\n",
       " u'22275380',\n",
       " u'19789842',\n",
       " u'19774634',\n",
       " u'21949692',\n",
       " u'21820134',\n",
       " u'16767717',\n",
       " u'17324130',\n",
       " u'22941335',\n",
       " u'20427809',\n",
       " u'17974913',\n",
       " u'16184470',\n",
       " u'18281474',\n",
       " u'12146846',\n",
       " u'10393723',\n",
       " u'19169242',\n",
       " u'16039111',\n",
       " u'21188630',\n",
       " u'19095149',\n",
       " u'20185296',\n",
       " u'19240222',\n",
       " u'23484904',\n",
       " u'16565084',\n",
       " u'11901534',\n",
       " u'21537144',\n",
       " u'17509946',\n",
       " u'21347297',\n",
       " u'20392992',\n",
       " u'22294499',\n",
       " u'18707871',\n",
       " u'17164361',\n",
       " u'21802006',\n",
       " u'20446891',\n",
       " u'14695184',\n",
       " u'18071194',\n",
       " u'19858293',\n",
       " u'11991597',\n",
       " u'17335689',\n",
       " u'22350783',\n",
       " u'10497622',\n",
       " u'17440036',\n",
       " u'12727858',\n",
       " u'19327986',\n",
       " u'19880525',\n",
       " u'18676824',\n",
       " u'10861016',\n",
       " u'19477429',\n",
       " u'27433937',\n",
       " u'21567203',\n",
       " u'20656522',\n",
       " u'19671685',\n",
       " u'20442777',\n",
       " u'21487321',\n",
       " u'20922787',\n",
       " u'21274512',\n",
       " u'3372055',\n",
       " u'16839219',\n",
       " u'17349583',\n",
       " u'17877065',\n",
       " u'22500211',\n",
       " u'21931642',\n",
       " u'22302244',\n",
       " u'22216200',\n",
       " u'21458985',\n",
       " u'21127501',\n",
       " u'16877536',\n",
       " u'18008174',\n",
       " u'22442756',\n",
       " u'19528458',\n",
       " u'22016776',\n",
       " u'17222791',\n",
       " u'8841022',\n",
       " u'16945591',\n",
       " u'17979879',\n",
       " u'19840244',\n",
       " u'16406574',\n",
       " u'23954078',\n",
       " u'12181105',\n",
       " u'21785460',\n",
       " u'22689798',\n",
       " u'16912155',\n",
       " u'22241219',\n",
       " u'14762783',\n",
       " u'21972408',\n",
       " u'12805337',\n",
       " u'21947833',\n",
       " u'16269611',\n",
       " u'20383575',\n",
       " u'19951937',\n",
       " u'9048836',\n",
       " u'25989269',\n",
       " u'22384099',\n",
       " u'19098000',\n",
       " u'20458531',\n",
       " u'19996459',\n",
       " u'22124112',\n",
       " u'16123806',\n",
       " u'19915670',\n",
       " u'15983343',\n",
       " u'10737690',\n",
       " u'22264788',\n",
       " u'10597976',\n",
       " u'22455594',\n",
       " u'20924188',\n",
       " u'20184544',\n",
       " u'22170054',\n",
       " u'20634481',\n",
       " u'20531412',\n",
       " u'17301260',\n",
       " u'21894176',\n",
       " u'20473855',\n",
       " u'9815680',\n",
       " u'11401910',\n",
       " u'22359577',\n",
       " u'17923820',\n",
       " u'20447915',\n",
       " u'20123159',\n",
       " u'22248732',\n",
       " u'14643885',\n",
       " u'20112293',\n",
       " u'21480310',\n",
       " u'16899407',\n",
       " u'20166205',\n",
       " u'21615592',\n",
       " u'12034163',\n",
       " u'19770585',\n",
       " u'21712410',\n",
       " u'19190630',\n",
       " u'20669224',\n",
       " u'17906209',\n",
       " u'21642683',\n",
       " u'16557372',\n",
       " u'11984129',\n",
       " u'21909688',\n",
       " u'19363294',\n",
       " u'16288121',\n",
       " u'15144951',\n",
       " u'15802268',\n",
       " u'19621072',\n",
       " u'20372829',\n",
       " u'19030995',\n",
       " u'17764494',\n",
       " u'19584260',\n",
       " u'18362938',\n",
       " u'13130303',\n",
       " u'19320986',\n",
       " u'22399057',\n",
       " u'17062558',\n",
       " u'15886696',\n",
       " u'17035650',\n",
       " u'22012259',\n",
       " u'21673687',\n",
       " u'18259202',\n",
       " u'21212411',\n",
       " u'20027313',\n",
       " u'10157040',\n",
       " u'4378317',\n",
       " u'21104117',\n",
       " u'17314971',\n",
       " u'17077147',\n",
       " u'23046351',\n",
       " u'22161730',\n",
       " u'12629218',\n",
       " u'22516347',\n",
       " u'22113945',\n",
       " u'12149254',\n",
       " u'22031289',\n",
       " u'22187293',\n",
       " u'18297062',\n",
       " u'17872573',\n",
       " u'15470214',\n",
       " u'21407221',\n",
       " u'22144496',\n",
       " u'15470213',\n",
       " u'19622766',\n",
       " u'16450398',\n",
       " u'17689296',\n",
       " u'20129251',\n",
       " u'17557301',\n",
       " u'20569497',\n",
       " u'20139893',\n",
       " u'8690526',\n",
       " u'8731004',\n",
       " u'22129971',\n",
       " u'19840191',\n",
       " u'21912438',\n",
       " u'22519904',\n",
       " u'22094992',\n",
       " u'2916544',\n",
       " u'15647826',\n",
       " u'20402651',\n",
       " u'16284945',\n",
       " u'15448019',\n",
       " u'21255190',\n",
       " u'3357350',\n",
       " u'11021485',\n",
       " u'17699784',\n",
       " u'17554121',\n",
       " u'12784339',\n",
       " u'25648592',\n",
       " u'22355351',\n",
       " u'12559942',\n",
       " u'21500193',\n",
       " u'19165860',\n",
       " u'22674293',\n",
       " u'16729295',\n",
       " u'21802218',\n",
       " u'10230844',\n",
       " u'12548609',\n",
       " u'21474104',\n",
       " u'12436437',\n",
       " u'22435731',\n",
       " u'14768471',\n",
       " u'15758009',\n",
       " u'8614005',\n",
       " u'18567795',\n",
       " u'1993545',\n",
       " u'16288300',\n",
       " u'15952101',\n",
       " u'17371428',\n",
       " u'21996751',\n",
       " u'22644306',\n",
       " u'22025955',\n",
       " u'19352387',\n",
       " u'22496152',\n",
       " u'21764390',\n",
       " u'16894525',\n",
       " u'20061818',\n",
       " u'24419490',\n",
       " u'7068798',\n",
       " u'15166964',\n",
       " u'21505205',\n",
       " u'19332714',\n",
       " u'20593179',\n",
       " u'19487287',\n",
       " u'17372249',\n",
       " u'21981945',\n",
       " u'16520474',\n",
       " u'12883263',\n",
       " u'19111879',\n",
       " u'18604175',\n",
       " u'21338440',\n",
       " u'16552335',\n",
       " u'17849473',\n",
       " u'2925272',\n",
       " u'12566908',\n",
       " u'12766105',\n",
       " u'15589307',\n",
       " u'17150983',\n",
       " u'21415356',\n",
       " u'3390835',\n",
       " u'20633560',\n",
       " u'19725922',\n",
       " u'18854000',\n",
       " u'21836617',\n",
       " u'21235356',\n",
       " u'22855257',\n",
       " u'16091065',\n",
       " u'21056661',\n",
       " u'16007214',\n",
       " u'20148361']"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo_graph.assign_search_group(pmc_hits = [])\n",
    "neo_graph.nodeIds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Han Mingli',\n",
       " ' Wang Yimeng',\n",
       " ' Liu Manran',\n",
       " ' Bi Xiaokai',\n",
       " ' Bao Junjie',\n",
       " ' Zeng Ni',\n",
       " ' Zhu Zhikun',\n",
       " ' Mo Zhiqiang',\n",
       " ' Wu Chengyi',\n",
       " ' Chen Xin']"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x = 'Han Mingli, Wang Yimeng, Liu Manran, Bi Xiaokai, Bao Junjie, Zeng Ni, Zhu Zhikun, Mo Zhiqiang, Wu Chengyi, Chen Xin'\n",
    "\n",
    "x.split(',')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAecAAAFCCAYAAADL3BUJAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAFu5JREFUeJzt3X1snWX9x/HPfXrannMglgYp24qM\n1QSdYWOQ1kSIjMXImIynxZhoTCwm09SIOtjDry7gH4vZKGM4M63IH1aNf4jgNtAtAyMPoiae8tQF\nzO+njo1tdZwSZ5l92tpzfn9cHtaVtjttzznX977P+5WchI6u/a6Dvntd932uE+RyuZwAAIAZMd8D\nAACAcxFnAACMIc4AABhDnAEAMIY4AwBgDHEGAMAY4gwAgDHEGQAAY4gzAADGEGcAAIwhzgAAGEOc\nAQAwhjgDAGAMcQYAwBjiDACAMcQZAABjiDMAAMYQZwAAjCHOAAAYQ5wBADCGOAMAYAxxBgDAGOIM\nAIAxxBkAAGOIMwAAxsR9DwAAoZXJSF1dUk+P1N8v1dVJS5dKd90lXXKJ7+kQYkEul8v5HgIAzJos\nwPX10qFD0u9/795nePjs+8fjUjYrNTRIixdLiYSUSkkjI+73NjW59zt0iKBjSsQZAPLGh/jIEffo\n7XXBHRkp3edNJqVcTlq1Smpvl1paSve5EArEGQDSaWnrVmn/fvf2+JVwOQWBC/X27VJbm58ZYAJx\nBlDZOjul9euloSG3erWgulr67nelDRt8TwJPiDNQboXcRMSNRuXR0SFt3iyNjvqeZHIXX+y2uFes\n4O++whBnoJQmXsM8fFg6ccJdw5zsJqL6eqmqSvrXv97/PlyXLJ50Wtq4UXruOd+TFCYedw/+7isG\ncQZKodTXMKuqpGuvlT77WVZUM5Xfxh4c9D3J7CST0kMPcU064ogzUGzl3CplRTUzYQ9zXizm/hwP\nPOB7EpQIcQbmKr91/eyz0h//KJ065WeOeNzdRLRxo5/Pb106LX3yk6V9SlS5bdokbdvmewqUAHEG\nZmv81vXoqJ2biq6+Wnr0UVbREy1bJr32mu8piisWk3btYos7gjhbG5iNzk7pxhulPXvc9WQrYZZc\ngG64wc0Ip6MjemGW3E2E3/iG1N3texIUGStnYKbCct0ykZB27GBVlU5L118vnTnje5LSWbZMeuUV\n31OgiIgzMBPptFsxWw9zXk2Nuw7e3Ox7En/WrJF27/Y9Rek9/bT06U/7ngJFQpyBmVizxm1lh+l/\nm0peVWUy0sKF/o7jLKerrpIOHvQ9BYqEa85AoTIZ6amnwhVmSXr1VemZZ3xP4UdXl+8JyueNN6S+\nPt9ToEiIM1Cor37V1o1fM3HPPb4n8KOnpzJWzXmV9MNIxBFnoBDptLR3r+8pZq9SV1X9/b4nKJ9s\nlm3tCIn7HgAIhbVrw7edPVFXl99XOfLxYh51daX5uFadPOl7AhQJcQbO58CB8D9H1ueqKn9Yy759\n0tjYuZcGfvlL6f77pc98pjTHjy5dKj3xROVsbSeTvidAkbCtDZzPvff6nqA4fKyqOjvdgSi7d7tj\nMydesx8ddb++e3dpDk5pbS3ux7NuYMD3BCgS4gxMJ5OR/vpX31MUR319eT9fZ6f0zW8WvmodHpa+\n9a3iBrqhwb0oSBAU72NadsEFvidAkRBnYDpRufs1mZSWLCnf50unXWhneirX6dPu9xXzOMr29srZ\n7h0a8j0BioQ4A9Pp6XHXa8MulyvvFu/GjS60s3H6dNFeWWtgYED/V1en//3KVzRaU1OUj2lauXdH\nUDLcEAZMJwpPxQkCd8NVqe6IniiTkV54YW4f4/nn3VO/ppg5m82qr69Px48fP+dx5MgRHTp0SEeP\nHlVfX5/OnDmjRCKhIAj0pWxW2yQlFdFVSbl3R1BSxBmYTgSeinM6Htfupiad/vnPlUqllEgklEwm\nlUgkzvnn8b9WW1urYLbXaXftmvNuQy6b1ZENG/TnlSt17Nix9+J79OhRvfXWW+rr61MikVAqlVJV\nVZVGR0c1ODiokZERNTQ06PLLL9fy5cv1kY98RIsWLdIVV1yhK664QsljxxR74AHpySfDe6DMVMq9\nO4KS4mxtYDodHe6aZUi3tgcl/U91tX4k6cyZM6qqqnrvEYvFFASB8t8CstmsxsbGNDY2pmw2q3g8\nrpqaGtXW1qq2tlbJZFLJZFKpVEoXXnihUqnUpJH/1s9+pgVvvz3n2Q/W1OhzTU3KZrMaHh5Wf3+/\nBgcH1djYqA9/+MNqamp6L7r5x7x58xSLFbAu7utzJ749+aR7elfYBYF0553uaWOIBOIMTCeTkebP\nD1+cg8Btc27f/t5LRmazWQ0MDOjUqVOTPt59991z/vnf//63+vv71d/f/96/+89//qOBgQENDg4q\nm80qmUy+F++amhpVV1frD2++qXlFCN6/Uin9aPPm2cW3UN3dZ5+DHQTn3lCVTLrV6EUXSSdOFO9z\nlkIq5S4FVPKrj0UMcQbO56qrpNdf9z1FYfJByR/qUcJv1qdPn35f1E+dOqUbvvAFpYrxnOrGRunY\nsbl/nEL09bk78w8edM8Hr693129bW6V166Rf/KI8c8xGKnXOD2GIBuIMnM+BA9LNN/ueYmqxmPSp\nT0nz5p0NSrlu/prMNde4V8Kaq2uvlV56ae4fZ646OqTvfMfeKWOT7I4gOrghDDiflSulq6+2eYRn\nEEh33GHrWuOttxYnzqtXz/1jFENrq4uzFdXVUlVVWXZH4A8rZ6AQ6bR0/fUzP1Sj1CxeayzGdfpY\nzF3n9bkDMN6aNdKePX5f/OQDH3D/Da5Y4X93BCUXyaf7AUXX0iLt3CnV1vqe5Kz8tUZLYZbckZk3\n3DC3j7F8ua34+DxlLB6XHnjAPed+3z73ymKWvjYoCeIMFKqtTXr4Yf+BDgL7NwF1dLjt19morna/\n35KWFvf1TqXK8/mSSSmRcCv2P/+5aCemITzY1gZmqrvbvb5zMa6rzkQZ78QuivwLX8zkUkB1tduh\nsPpDR2entH69e8pVMb91BoHbyl+82N1QZ+HGPnhFnIHZevBBafPm0l6HrqoK9zfszk73VKSRkfO/\nb22t25mwGua88c+NPn167tfWa2rC8wMXyoY4A3Mx3SEWcxGlp8nkv0a//a07jWv8sZnxuPsB5JZb\nwhenvj5pyxbphz+c3SljVVXS174m3XdfuH7gQlkQZ6AYxh9icfiwe/T2um3a8c+PTSbdN/IPflB6\n5x33DXqyU6miuJKa7qCPMMcpv9U9OFj477F+zwC8I85AqZwvRlGNVSUq9Fp0lHZEUFLEGQCKoZBz\nuqO4I4KSIM4AUEzsiKAIiDMAAMZwCAkAAMYQZwAAjCHOAAAYQ5wBADCGOAMAYAxxBgDAGOIMAIAx\nxBkAAGOIMwAAxhBnAACMIc4AABhDnAEAMIY4AwBgDHEGAMAY4gwAgDHEGQAAY4gzAADGEGcAAIwh\nzgAAGEOcAQAwhjgDAGAMcQYAwBjiDACAMcQZAABjiDMAAMYQZwAAjCHOAAAYQ5wBADCGOAMAYAxx\nBgDAGOIMAIAxxBkAAGOIMwAAxhBnAACMIc4AABhDnAEAMIY4AwBgDHEGAMAY4gwAgDHEGQAAY4gz\nAADGEGcAAIwhzgAAGEOcAQAwhjgDAGAMcQYAwBjiDACAMcQZAABjiDMAAMYQZwAAjCHOAAAYQ5wB\nADCGOAMAYAxxBgDAGOIMAIAxxBkAAGOIMwAAxhBnAACMIc4AABhDnAEAMIY4AwBgDHEGAMAY4gwA\ngDHEGQAAY4gzAADGEGcAAIyJ+x4AAGBMJiN1dUk9PVJ/v1RXJy1dKt11l3TJJe//97W10uCglEpJ\nIyPvf3/MWJDL5XK+hwAAlNlkge3tlY4ckU6ccO+TzZ59/3hcGhuTamqkM2ekWEwaHZ364ycS7v0W\nLJAWLnQPgl0w4gwAUTYxwqOj0tGj0t//LgWBNDxcvlnicRf8hgZp8WIXcFbbkyLOABBF6bS0dau0\nf797u5wRnq0gcI+GBmnZMmnFioqNNXEGgKjIr5Iff1x66aVzt6XDKPbfe5YrMNbEGQDCLJORtmyR\n9u6Vjh8Pf5CnE4+7x6pVUnu71NLie6KSIc4AEEb5beunnpr+xqwoCgIpmZS2b5fa2nxPUxLEGQDC\npqND2ry58qI8UW2t9PDDkQw0cQaAsEinpbVrpdde8z2JLZ/7nLRrV6SuRXNCGACEQUeHdN11hHky\njz0mXXqpdPnl0t13S319vieaM1bOAGAZq+WZi8elW28N9U1jxBkArOrslNatc4d0YOZSqdDeNMa2\nNgBYRJjnbnBQWr/efS1DhpUzAFiTTkvXX+/OpsbcJZPSCy9Izc2+JykYcQYAa668Uvrb33xPES0L\nFkh79oTmGjTb2gBgyd13E+ZS6O2Vli8PzRY3cQYAKzo7pR/8wPcU0TU0FJpr0GxrA4AF6bRb2Q0N\n+Z4k+lIp6fnnTV+DZuUMABZs3UqYy2VoyH29DWPlDAC+ZTJSYyNnZZdTIiG99ZbZIz9ZOQOAb1u2\nEOZyy+Xca18bRZwBwLe9e31PUHlGRqSDB31PMSXiDAA+ZTLS8eO+p6hMJ074nmBKxBkAfDK8tRp5\nb7/te4IpEWcA8KmnR8pmfU9Rmd55x/cEUyLOAOBTf7/vCSqX4ScrEWcA8KmuzvcElStmN4F2JwOA\nSrB0qelIRNqll/qeYEr8FwEAPrW2+p6gcq1e7XuCKXFCGAD4dtVV0uuv+56i8mQynBAGAJjCQw/5\nnqDypFJmwywRZwDwb+VKaf5831NUlk98wvcE0yLOAGDBT37ie4LKsnKl7wmmxTVnALCCa8/lEYu5\nozvZ1gYAnBer5/L42MdMh1kizgBgR0uL+WuhkbBjh+8JzottbQCwJJMxfThG6C1bJr3yiu8pzouV\nMwBY0tAg3Xij7ymiKR6XHn3U9xQFIc4AYE1Hh1Rd7XuKaAkC6fvfl5qbfU9SEOIMANa0tEg7dxLo\nYtq4UWpr8z1FwYgzAFjU1uYCXVvre5Lw27RJ2rbN9xQzQpwBwKq2NunFF6U1a9y2LGYuhGGWuFsb\nAMLh6aelW26RRkd9TxIOsZi0YUMowyyxcgaAcLjpJndDUyrlexL7kklp167QhlmS4r4HAAAUKH9D\n07p10siI31ksqqlxr9Hc3h6au7KnwrY2AIRNd7e0dq306qu+J7EhFpNuv1165BHzx3IWim1tAAib\n5mZ3ylWlPx86CNw2/65d0q9/HZkwS6ycASDcurulrVulffuksTHpzBnfE5VHPC7ddlsktrAnQ5wB\nIAr6+qSuLunZZ92qOpNx271Ru7v7Qx+S7rhDuu++SK2UJyLOABBF+VgfPCi9+aZ7neiTJ31PNTNV\nVVIuJzU2VkSQxyPOAFApnnlGuuce6Y033NvZrN95JHfdOAik+fOlhQtdiIeGpPp6ackSqbW1YoI8\nHnEGgEozflV9+LB79Pa6m8uGh0v7ufOr4YYG6ZprpBUrKjbA0yHOAIBzg33ypDvIY2BAuuCCsyvZ\nRYvcKvcvf5n6unYi4W5KW7DAPfI3qF18sTRvXkWvhmeCOAMAZmdi0Ct8K7qYiDMAAMZwCAkAAMYQ\nZwAAjCHOAAAYQ5wBADCGOAMAYAxxBgDAGOIMAIAxxBkAAGOIMwAAxhBnAACMIc4AABhDnAEAMIY4\nAwBgDHEGAMAY4gwAgDHEGQAAY4gzAADGEGcAAIwhzgAAGEOcAQAwhjgDAGAMcQYAwBjiDACAMcQZ\nAABjiDMAAMYQZwAAjCHOAAAYQ5wBADCGOAMAYAxxBgDAGOIMAIAxxBkAAGOIMwAAxhBnAACMIc4A\nABhDnAEAMIY4AwBgTNz3ACiSTEbq6pJ6eqT+fqmuTmpqkoJA+sc/zv7a0qXS6tXSb35z7vtO9+t3\n3SVdconvPyEAVIwgl8vlfA+BKUwW3IkRPXLEPXp7pXhcGhkp7GMHgVTIX308LmWzUkODtGyZtGIF\nsQaAEiPOFqXT0tat0v797u3hYb/zjBcE7tHYKN1+u3T//YQaAIqMOFuRXyU//rj08svS2JjviQoT\nBNJll0kLF7oH2+AAMGfE2adMRtqyRdq7Vzp+3G0fh13sv/cYLl4s7dgh3XST33kAIISIc7nlg7xn\njwty1L/88+e7HQEiDQAFI87lcuCAdO+90uuv+57Ej4sukr74Ra5RA0ABiHOppdPS2rXSa6/5nsSG\nIJAuvZQ7vwFgGsS5lDo6pPb2aFxLLoXqaqmqSlq1yn2dWlp8TwQAJhDnUjhwwK0I//lP35OEQxBI\nyaS0fbvU1uZ7GgDwjjgXE1vYcxOLSbfdJv34x2x1A6honK1dLJ2d0nXXEea5yGbdXeyXXSatWeN+\n2AGACsTKuRg2bXJbslxbLh62ugFUMF74Yq42bXI3fqG4cjlpcFBav969TaABVBBWznNBmMsjlZKe\nf15qbvY9CQCUBdecZ4swl8/goLRhg+8pAKBsiPNsEObye+456cEHfU8BAGXBtvZMEWZ/qqulnTu5\n/gwg8ojzTHR2Sl//Ondl+8T1ZwAVgDgXKp2Wli+XhoZ8T1LZgkC6807piSd8TwIAJUOcC7VmjbR7\nt+8pIEnxuNTbyyliACKLG8IKkclI+/f7ngJ5o6PuNbEBIKKIcyG6unxPgIkee8z3BABQMsS5ED09\n0vCw7ykw3ttvS319vqcAgJIgzoXo7/c9ASbz7W/7ngAASoI4F6KuzvcEmMyvfuV7AgAoCeJciKYm\n3xNgMv39bG0DiCTijHDjZj0AEUScC3HokO8JMJWDB31PAABFR5wLwQ1hdp086XsCACg64lwIbgiz\nq77e9wQAUHTEuRBLl0qJhO8pMFEQSEuW+J4CAIqOs7ULkclICxdyEIlFmQxnbAOIHFbOhWhokFat\n8j0FJrrwQsIMIJKIc6Ha2902Kuz4+Md9TwAAJUGcC9XSIl19te8pkBcE0s03+54CAEqCOM/E5z/v\newLkVVdLra2+pwCAkiDOM9HaKtXU+J4CkrR6NdebAUQWcZ6Jhgbpllu49uxbMunuAQCAiCLOM9Xe\n7uIAP6qqpIcekpqbfU8CACVDnGeqpUXavp1A+7J+vdTW5nsKACipuO8BQikfh7vvlsbG/M5SKWIx\nacMGads235MAQMlxQthc/PSn0pe/LGWzvieJtpoa6XvfY8UMoGKwcp6LL31JGhyU7r1XGhryPU00\n1dVJv/sd15gBVBRWzsXQ2SmtWyeNjPieJFqqq6U//YkwA6g43BBWDG1t0osvSsuW+Z4kOhIJaedO\nwgygIhHnYmlull55RerokOJcLZi1IJBSKWnHDq4xA6hYbGuXQne3tHat9OqrvicJl3hcuu0291xy\nVswAKhhxLqWODmnzZml01PcktlVVuSg/8ghHcgKAiHPpdXdLW7dK+/a5SBPqs1gpA8CkiHO59PVJ\nXV3Sc8+5m8fefdf3RH7EYlJjo3THHdJ997FSBoBJEGdfnnlGuuce6Y03pFzOPaKqocGtjG+80b2y\nF0EGgGkRZ9/Gr6hfflnKZNyvh/XUsdh/nwDA6hgAZo04W5OP9bPPuqdmZTL2V9Z1ddJHPypdeaW0\nZAmrYwCYI+Js3WQr61jM341lVVXuBwVWxgBQMsQ5bPKxPnhQOnnSvXTlwIB0wQXSiRPS4cNSb687\n+nJ4eG6fK5FwPwTMny8tXCgtWsTKGADKgDhH0XQBHxp6/9v19VJTk1sRv/mm+z319YQYADwhzgAA\nGMPZ2gAAGEOcAQAwhjgDAGAMcQYAwBjiDACAMcQZAABjiDMAAMYQZwAAjCHOAAAYQ5wBADCGOAMA\nYAxxBgDAGOIMAIAxxBkAAGOIMwAAxhBnAACMIc4AABhDnAEAMIY4AwBgDHEGAMAY4gwAgDHEGQAA\nY4gzAADGEGcAAIwhzgAAGEOcAQAwhjgDAGAMcQYAwBjiDACAMcQZAABjiDMAAMYQZwAAjCHOAAAY\nQ5wBADCGOAMAYAxxBgDAGOIMAIAxxBkAAGP+H28Yjk1M3kWtAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7fa930695650>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import matplotlib.pyplot as plt\n",
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "nx.draw(nx_graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
